[
  {
    "cook_time": "50 Minutes",
    "description": "Chermoula is a marinade or sauce that forms the basis of many Moroccan dishes. This version made with eggplant, basil, dried herbs and lime can be used as a great dip. ",
    "ingredients": [
      "1 large eggplant",
      "1 Tbsp tahini paste",
      "4 garlic, smashed",
      "1/2 Tbsp lemon juice",
      "1 Tbsp olive oil",
      "Salt to taste",
      "1 tsp dried parsley",
      "1/2 tsp rosemary, fresh",
      "1/2 tsp thyme, fresh",
      "1 tsp basil"
    ],
    "prep_time": "15 Minutes",
    "method": [
      "Pre-heat oven to 400 degree f, arrange oven that has low and high rack in the oven.",
      "2.Cut a shallow slit along the side of the eggplant. And place into a baking dish.",
      "Roast in preheat oven on the lower rack until the eggplant is completely shrunken and soft, about 40 minutes. Move dish to higher rack and continue baking until the skin is charred. About 5 minutes more. Let eggplant cool until cool enough to handle.",
      "Peal and discard skin from eggplant. Put eggplant into a bowl add tahini, garlic, lemon juice, mint leaf chopped, rosemary, thyme, green chilly, and salt ",
      "Stir until ingredients are evenly mixed drizzle olive oil over the B&B Aubergine charmoula sauce and garnish with parsley.",
      " "
    ],
    "name": "Aubergine Chermoula Sauce"
  },
  {
    "cook_time": "10 minutes",
    "description": "This is possibly the quickest of all soups we make at home, and along with my watermelon soup (below), it one of the coolest, most soothing summer dishes.",
    "ingredients": [
      "4 cucumbers",
      "1 litre thick yoghurt, approximately",
      "2-3 Tbsp fresh fennel, chopped",
      "1 cup water or stock",
      "1 Tbsp lemon juice"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Peel and chop the cucumbers, roughly, if you like, scrape off the seeds but I usually keep them in because I like the texture.",
      "Blend everything in the blender, then season and cool. If you find the texture to be too thick, then add a little cold water to make the consistency as thin as you like. Done!",
      "To posh it up, you can serve this with garlic bread or croutons. For croutons, take any old bread, brush on both sides with olive oil, then slice into cubes. Toast (or fry, for a truly decadent version) them until crisp, then scatter over the soup just before serving. The truly health-conscious may even omit entirely the olive oil step. "
    ],
    "name": "Cucumber Soup"
  },
  {
    "cook_time": "15 minutes, plus chilling time",
    "description": "A fruit soup! And what is more summery than a crisp, chilled watermelon? This is a fairly easy recipe but for the laborious deseeding of the watermelon.",
    "ingredients": [
      "6 cups chopped and deseeded watermelon",
      "1 Tbsp ginger-garlic paste",
      "2 Tbsp fresh chopped mint",
      "1/2 Tbsp chilli flakes (or to taste)",
      "Olive oil, to cook"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Sauté the ginger-garlic paste and the chilli flakes in a little olive oil. Set aside to cool.",
      "Puree the watermelon and the mint in a blender until thoroughly blended. Add the watermelon puree into the saucepan with the ginger-garlic and chilli flakes, and simmer, until it thickens a little bit. Season well, then chill for at least 1-2 hours before serving. ",
      "You can add a couple of ice cubes into the soup, spoon over some olive oil and serve garnished with a sprig of mint. This is a soup that is best eaten the same day of preparation. "
    ],
    "name": "Spicy Watermelon Soup"
  },
  {
    "cook_time": "20 minutes",
    "description": "There's nothing like roasted pumpkin. Team it with hummus and it's a lip-smacking treat. Spice it up with red chilli powder and Tabasco sauce, and if you have za'atar, add that in too.",
    "ingredients": [
      "2 cups chickpeas, boiled",
      "200 gm pumpkin",
      "¼ cup olive oil",
      "4-5 garlic cloves",
      "2 Tbsp lemon juice",
      "½ tsp cumin powder",
      "1 Tbsp Tabasco sauce",
      "Salt to taste",
      "Red Chilli powder, for topping",
      "Olive oil, for topping",
      "Rosemary sprigs to garnish"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Oil the pumpkin slice and roast it in the oven for 15 minutes.",
      "In a food processer or blender, mix chickpeas and garlic, and pulse until smooth. You can add a little water, if you find the mixture a little dry.",
      "Add the pumpkin, cumin powder, Tabasco sauce, olive oil and salt, and blend again until smooth.",
      "Transfer to a bowl, and add the lemon juice. Mix well and check seasoning. Finish with a drizzling of olive oil, a sprinkling of red chilli powder and rosemary sprigs on top. Serve with pita breads. "
    ],
    "name": "Spicy Pumpkin Hummus"
  },
  {
    "cook_time": "30 minutes",
    "description": "Pork and Litchi together? Sounds odd but tastes delicious. Try this unique combination this summer.",
    "ingredients": [
      "1/2 kg of pork, deboned and cleaned",
      "1/3 cup of red wine vinegar",
      "1/2 cup of chicken stock",
      "1 cup of litchis, peeled and seeded",
      "1/2 cup of cucumbers, julienned",
      "1 Tbsp of cornstarch",
      "Salt to taste"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "1. Cube the pork, then dip them into the cornstarch. Deep fry for 5 minutes until cooked, then set aside.  ",
      "In a large kadhai, throw together the rest of the ingredients until the stock and vinegar come to a boil. ",
      "Add the pork and simmer at low heat, covered, for 2 minutes. Serve with steamed rice."
    ],
    "name": "Pork Litchi"
  },
  {
    "cook_time": "20 minutes + (15 minutes for marination)",
    "description": "This one is an extremely easy salad, quick to put together and perfect for those days when you just can't be bothered.",
    "ingredients": [
      "500g of prawns, shelled and cleaned",
      "2 tbsp of spring onions, chopped roughly",
      "1 mango flesh, roughly chopped",
      "500g litchis, deseeded",
      "1 tsp of chilli flakes",
      "1/2 lemon for lemon juice ",
      "1 tbsp of olive oil",
      "A handful of peanuts, to garnish",
      "Salt to taste"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "1. Toss the oil together with the lemon juice, spring onions and chilli flakes. Use this as a marinade for the prawns - let them marinate for 15 minutes in this mixture.",
      "Toss the prawns together with the marinade on high heat in a kadhai and stir fry for about 2-3 minutes, by which time the prawns should be cooked.",
      "Set aside, while you mix together the mango and litchi, then add everything together, add the peanuts for a bit of crunch, season and serve immediately."
    ],
    "name": "Prawn and Litchi Salad"
  },
  {
    "cook_time": "15 Minutes",
    "description": "If you are looking for a no-fuss but extremely delicious snack, this is your pick. Grab those exotic vegetables you have been eyeing for a while and give them a new twist. A pinch of five spice powder brings out the depth of your fritters. Enjoy them with a nice game of football and a cold glass of iced tea.",
    "ingredients": [
      "20 gm of asparagus ",
      "30 gm of corn ",
      "20 gm of carrot ",
      "30 gm of broccoli ",
      "10 gm of zucchini ",
      "20 gm of baby corn ",
      "100 gm of glass noodle ",
      "Olive oil to fry",
      "Salt to taste",
      "Black pepper to taste",
      "5 gm of five spice powder ",
      "100 gm of tempura flour ",
      "130 ml of cold water ",
      "10 gm of spring onion "
    ],
    "prep_time": "10 Minutes",
    "method": [
      "1.Wash all the vegetables and cut them in even size.",
      "Make the batter by mixing tempura flour with cold water, if any lumps don't worry.",
      "Take a kadhai and put olive oil in it. Once the temperature reaches to 160 degree fry the glass",
      "noodles and make a desired shape as shown in picture or make any other shape like a basket.",
      "Chop the spring onions and keep it aside for garnish.",
      "Dip the vegetables into the batter and fry them till it becomes crisp. Take it out on a tissue paper to remove excess oil.",
      "6.Toss these vegetables with salt, pepper and Chinese five spice powder and enjoy these",
      "vegetables in your daily routine.",
      "Serve hot."
    ],
    "name": "Crunchy Vegetables and Corn With Five Spice Powder"
  },
  {
    "cook_time": "20 minutes",
    "description": "This recipe brings together the two most popular condiments - pesto and hummus. Serve it with crisp toasts or vegetable crudites and win praises from your friends and family.\n\n ",
    "ingredients": [
      "2 cups chickpeas, boiled",
      "4-5 garlic cloves",
      "¼ cup of pine nuts",
      "1 cup of  basil leaves, plus extra for garnish",
      "1/2 cup olive oil, plus extra for topping",
      "¼ cup of Parmesan",
      "2 Tbsp of lemon juice",
      "Salt to taste",
      " "
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Method:",
      "First prepare the pesto sauce: mix basil leaves, garlic, Parmesan and pine nuts in a blender. Add the olive oil, a little at a time to emulsify, and continue blending until all the ingredients come together.",
      "Add the chickpeas and salt, and blend again until smooth.",
      "Transfer to a bowl, and add the lemon juice. Mix well and check seasoning. Finish with a drizzling of olive oil, a sprinkling of red chilli powder and fresh basil leaves on top. Serve with pita breads.",
      "  "
    ],
    "name": "Basil Pesto Hummus "
  },
  {
    "cook_time": "20 minutes",
    "description": "A perfect summer dip, the flavours of lemon and basil come together to make this recipe light and refreshing.",
    "ingredients": [
      "2 cups chickpeas, boiled",
      "4-5 garlic cloves",
      "1 tsp sesame seeds",
      "1 Tbsp curd",
      "1 tsp cumin powder",
      "2 Tbsp lemon juice",
      "Salt to taste",
      "A bunch of basil leaves",
      "½ cup olive oil, plus extra for topping",
      "Salt to taste"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "In a pan, roast the sesame seeds until aromatic. Allow to cool and then ground into a powder.",
      "In a food processor or blender, mix chickpeas and garlic, and pulse until smooth. You can add a little water, if you find the mixture a little dry.",
      "Add the sesame powder, curd, cumin powder and salt, and blend again until smooth.",
      "Transfer to a bowl, and add the lemon juice. Mix well and check seasoning. ",
      "In a blender, pulse the basil leaves and olive oil till well mixed.",
      "Top it on the prepared hummus, along with a sprinkling of red chilli powder and fresh basil leaves. Serve with pita breads."
    ],
    "name": "Lemony Hummus with Basil Dressing"
  },
  {
    "cook_time": "20 minutes",
    "description": "Black beans push over chickpeas in this recipe to make this classic dip. Blend it with fresh herbs and spices, and serve it with breads.",
    "ingredients": [],
    "prep_time": "10 Minutes",
    "method": [
      "In a food processor or blender, mix the black beans, sesame seeds and garlic, and pulse until smooth. You can add a little water, if you find the mixture a little dry.",
      "Add the cumin powder, black pepper powder, curd, olive oil and salt, and blend again until smooth.",
      "Transfer to a bowl, and add the lemon juice. Mix well and check seasoning. Finish with a drizzling of olive oil and coriander sprigs on top. Serve with pita breads."
    ],
    "name": "Black Bean Hummus"
  },
  {
    "cook_time": "10 Minutes ",
    "description": "A perfect cooler to go with your meal. This raita combines the goodness and sweetness of pineapple with soothing curd. A beautiful blend of flavours.",
    "ingredients": [
      "25 gm of pineapple",
      "60 gm of hung curd ",
      "1 chopped green chilli",
      "2 sprigs of mint leaves",
      "black salt to taste",
      "1/2 tsp sugar  ",
      "2 gm of black pepper powder"
    ],
    "prep_time": "5 Minutes ",
    "method": [
      "Cut pineapple into 2\" cubes. ",
      "Put them on a skewer and cook in a tandoori till soft but not mushy. ",
      "Whisk the yoghurt in a bowl till smooth and add cooled and chopped pineapple, reserving little bit for garnish. ",
      "Add the rest of the ingredients and mix well. ",
      "Garnish with chopped pineapple and mint Sprig."
    ],
    "name": "Pineapple Raita"
  },
  {
    "cook_time": "10 Minutes",
    "description": "This basic condiment is a must have for your cooking. Now, ditch the store-bought packs and make it fresh at home. ",
    "ingredients": [
      "1/3 cup powdered ",
      "1/4 cup powdered ",
      "1 cup ",
      "3/4 cup powdered coriander seeds ",
      "2 Tbsp powdered red chillies",
      "1/2 cup powdered ",
      "1 3/4 cup salt"
    ],
    "prep_time": null,
    "method": [
      "Mix all ingredients well",
      "Store in an airtight jar"
    ],
    "name": "Channa Masala"
  },
  {
    "cook_time": "15 Minutes + Freezing Time",
    "description": "Mango season would be devoid of all its glory if you don't try this classic accompaniment along with those hot and crisp pooris or parathas.",
    "ingredients": [
      "4 mangoes",
      "1/2 tsp cardamom powder",
      "1/2 tsp ghee per serving (optional)",
      "Sugar as per taste "
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Chill 4 mangoes in the fridge for a few hours. The mangoes which have started wrinkling are the best for aamras.",
      "Massage the fruit with its skin on. Then squeeze out the pulp. Mix in sugar only if needed. ",
      "3 .Add cardamom powder and mix well with a wooden blender. ",
      "Leave the aamras pulpy and thick. Portion out in small serves in steel bowls or pretty glasses. Top serve with molten ghee."
    ],
    "name": "Aamras"
  },
  {
    "cook_time": "30 minutes",
    "description": "This is one of the easier biscuit recipes that don't require a blending of various flours. They are pretty healthy and made using coconut oil.",
    "ingredients": [
      "1 cup toasted quinoa flour",
      "1/2 tsp baking soda",
      "1/2 tsp baking powder",
      "1/2 cup melted coconut oil",
      "1/2 cup brown sugar",
      "1 egg",
      "Orange or vanilla essence (or rose or lemon or whichever you choose)",
      "1/2 cup chopped almonds"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Preheat the oven at about 350 degrees F. ",
      "Add the quinoa flour, baking soda and baking powder in a large bowl and sift. ",
      "In another bowl, mix together the sugar and coconut oil - you may need to use an electric beater for this. Once the mixture is smooth, add in the egg and beat until creamy. This should take another 2-3 minutes or so. Finally, add the orange or vanilla flavouring.",
      "Then very carefully, fold in the dry ingredients into the wet, until everything is perfectly combined. ",
      "Add the nuts to this mixture. If you like, you can put in chocolate chips or another type of nut - it is all up to you. ",
      "Onto a baking sheet, plop little scoops of the batter and flatten the top slightly. They will expand once they cook so make sure to leave lots of space between each scoop. ",
      "Bake them for about 10 minutes or until the edges become a little hard - they maybe a little underdone, but turn off the oven anyway. Let the cookies cool and harden for a few minutes, then transfer them gently to a wire rack where they will soon be ready to eat. "
    ],
    "name": "Quinoa Biscuits"
  },
  {
    "cook_time": "1 Hour",
    "description": "This tasty yet healthy paneer recipe gives you a fantastic dose of protein and calcium. Not just that, the crunchy bell peppers provide you with Vitamin A, Vitamin C, folate and a punch of antioxidants.",
    "ingredients": [
      "1 cup low fat yoghurt",
      "1 Tbsp Bengal gram flour (besan)",
      "1 Tsp ginger garlic paste",
      "1 tsp chilli powder",
      "1 tsp cumin powder",
      "1 tsp garam masala powder",
      "1/2 tsp black pepper powder",
      "2 Tbsp coriander and green chilli paste",
      "1 tsp Kasoori methi",
      "Salt to taste",
      "1 cup low fat paneer, cut into cubes",
      "1/2 cup bell peppers, cubed",
      "1/2 cup onions, cubed",
      "1 tsp olive oil"
    ],
    "prep_time": "20 Minutes",
    "method": [
      "Mix all the ingredients of the marinade in a bowl. Combine the paneer, bell pepper cubes, onion cubes and mix into the marinade. Be careful while tossing it and do not mix vigorously otherwise the paneer cubes will break. Set aside for 25-30minutes.",
      "Now start skewering. Place a piece of Bell pepper, onion, 2 paneer cubes and again bell pepper cube on a satay stick.",
      "Repeat the same process and make the rest of the satays.",
      "On a medium flame, place a non-stick pan, grease it with 1/2 tsp oil and place half of the satay sticks on it till the paneer and veggies turn slightly brown in color.",
      "Repeat the same step for the rest of the satays.",
      "Serve fresh with some mint coriander chutney."
    ],
    "name": "Paneer Methi Satay"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Help your taste buds relish your snacks better by using this sweet and peppery accompaniment. ",
    "ingredients": [
      "1 cup liquid (water or stock)",
      "1 Tbsp cornflour",
      "1 Tbsp vinegar",
      "1 tsp black pepper, powdered",
      "1 tsp worcestershire sauce",
      "1 Tbsp tomato ketchup",
      "1 tsp salt or to taste"
    ],
    "prep_time": null,
    "method": [
      "Mix all ingredients together and cook till a it gets a little thick."
    ],
    "name": "Brown Sauce / Brown Gravy"
  },
  {
    "cook_time": "20 minutes + overnight soaking",
    "description": "Craving for chaat? Try this healthy sprouts and corn chaat recipe. Loaded with proteins, Vitamin K, dietary fiber, Vitamin C, and Folate, this recipe is a storehouse of nutrients.",
    "ingredients": [
      "15g mixed sprouts, boiled",
      "15g corn, boiled",
      "1 tomato, finely chopped",
      "1 onion, finely chopped",
      "1 Tbsp coriander chutney",
      "1/2 tsp cumin powder",
      "1/2 tsp red chilli powder or paprika",
      "Salt to taste",
      "A handful pomegranate seeds, to garnish",
      "A handful freshly chopped coriander leaves, to garnish"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Soak the sprouts overnight and next morning pressure cook it for around 10-15 minutes. Strain well.",
      "Now in as bowl, combine all the ingredients together and serve. Simple to prepare, easy to consume."
    ],
    "name": "Mixed Sprouts Corn Chaat"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Get the basic white sauce right with this recipe. ",
    "ingredients": [
      "2 cups milk ",
      "2 Tbsp flour ",
      "1 Tbsp butter/oil ",
      "1 tsp salt ",
      "1/4 tsp powdered black pepper ",
      "1/8 tsp nutmeg-grated"
    ],
    "prep_time": null,
    "method": [
      "In a heavy-bottomed saucepan, heat the fat, and stir in the flour over low heat. ",
      "Saute till there is just a suggestion of brown. ",
      "Take the pan off the fire, and add the milk very gradually, stirring vigorously all the time to avoid lumps. ",
      "Add enough only to make a thick paste at first. ",
      "When\n the paste is smooth and you have ensured that there are no lumps, add \nthe rest of the milk very slowly and mix till the milk, flour and fat \nare well blended. ",
      "In case lumps do form, strain the mixture. ",
      "Place\n the pan over the fire again and stirring all the time, let it come to a\n boil and then simmer for about 4-5 minutes, continuing to stir off and \non. ",
      "Now add the salt and pepper or any other desired seasoning and take it off the heat."
    ],
    "name": "White Sauce"
  },
  {
    "cook_time": "5 minutes",
    "description": "This mix of five spices is usually used in Chinese cuisine.",
    "ingredients": [
      "Fennel seeds ",
      "Cloves",
      "Star anise ",
      "Cinnamon ",
      "Sichuan pepper"
    ],
    "prep_time": null,
    "method": [
      "Toast equal amounts of the spices in a dry pan over a low heat. ",
      "Then grind all the spices to a powder. ",
      "Store in an air-tight jar. "
    ],
    "name": "5 Spice Powder"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Panada sauce is a thick, milky white sauce which is usually added to bind the batter. It may be used as thickening agent in soups and bakes.",
    "ingredients": [
      "1/3 cup flour ",
      "3 Tbsp butter or oil ",
      "1 cup milk ",
      "1 tsp salt or to taste"
    ],
    "prep_time": null,
    "method": [
      "Heat the butter/oil for the sauce and add the flour. ",
      "Saute over low heat till slightly colored. ",
      "Add milk, stirring vigorously all the time, so no lumps form. ",
      "Bring to a boil and cook for a minute or so. ",
      "Add the salt. ",
      "Leave to cool."
    ],
    "name": "Panada Sauce"
  },
  {
    "cook_time": "25 minutes",
    "description": "Mulagapodi powder is an intense mix of red chillies, coconut and black gram, flavored with tamarind. It is a popular South Indian condiment.",
    "ingredients": [
      "1/4 cup whole dried red chillies ",
      "2 Tbsp Bengal gram ",
      "3 Tbsp husked black \ngram ",
      "2 Tbsp desiccated coconut ",
      "Salt to taste ",
      "1 Tbsp tamarind-scraped \n(brown portion only)"
    ],
    "prep_time": "10",
    "method": [
      "Dry roast the red chillies, Bengal gram, black gram and coconut \nseparately till slightly coloured.",
      "Add the salt and tamarind.  ",
      "Powder this mix and store."
    ],
    "name": "Mulagapodi Powder (Gun Powder)"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Chettinad cuisine from Tamil Nadu is one of spiciest cuisines in India. Use this freshly made fiery masala to liven up your meals.",
    "ingredients": [
      "1 dry grated coconut ",
      "10 gm sabut lal mirch ",
      "15 gm sabut dhania ",
      "5 gm chhoti elaichi ",
      "5 gm cinnamon ",
      "5 gm cloves ",
      "3 gm kalpasi bark ",
      "3 gm star anise ",
      "3 gm kadhi patta ",
      "2 gm turmeric powder"
    ],
    "prep_time": "2 minutes",
    "method": [
      "Dry roast and coarsely powder all the ingredients."
    ],
    "name": "Chettinad Masala"
  },
  {
    "cook_time": "10 minutes",
    "description": "Dhansak masala might seem tedious at first glance but is totally worth the effort! It's a popular dish of the Parsi Zoroastrian community and combines elements of Persian and Gujarati cuisine. ",
    "ingredients": [
      "250 gm sabut dhania",
      "125 gm jeera",
      "125 gm sabut lal mirch",
      "10 gm shahi jeera",
      "10 gm mustard seeds",
      "10 gm methi dana",
      "10 gm phool pathar (also known ar kalpasi and dagad phool)",
      "1/2 tsp sabut kali mirch",
      "30 gm khus khus",
      "30 gm dal chini",
      "30 gm laung",
      "30 gm tamal patta",
      "30 gm badian",
      "1/8 tsp mace (javitri)",
      "1 nutmeg"
    ],
    "prep_time": null,
    "method": [
      "Grind all the ingredients together.",
      "Store in an airtight container."
    ],
    "name": "Dhansak Masala (Spices for Dhansak)"
  },
  {
    "cook_time": "15 Minutes",
    "description": "This fiery Goan masala is a blend of hot, aromatic spices, tomatoes, onions and tamarind. Add it to your curries to serve absolutely delectable delicacies.",
    "ingredients": [
      "1 1/2 cup onions - roughly chopped ",
      "1 Tbsp garlic - chopped ",
      "4 cloves ",
      "1/4\" piece cinnamon - ground ",
      "1 Tbsp salt ",
      "3-4 dried red peppers ",
      "A walnut sized tamarind ball or 1 tsp concentrate ",
      "1 tsp sugar ",
      "1 cup onions - thinly sliced ",
      "1 cup tomatoes - finely chopped ",
      "1/4 cup oil."
    ],
    "prep_time": null,
    "method": [
      "Heat oil and add sliced onions.",
      "Let the onions turn brown.",
      "Add tomatoes and fry till the fat separates. ",
      "Now add the ground paste and fry till the fat separates again.",
      "Masala is ready."
    ],
    "name": "Recheado (Goan Red masala)"
  },
  {
    "cook_time": "30 minutes",
    "description": "This incredibly easy pasta salad recipe will get you hooked. Tip in some fresh herbs like parsley and basil for some added flavour, or a dollop of cream for some indulgence.",
    "ingredients": [
      "1 cup broccoli, cut into small pieces",
      "6-7 babycorns, diced into big chunks",
      "1 Tbsp olive oil",
      "1 tsp chopped garlic",
      "Salt and pepper to taste",
      "2 cups penne, multi-flavoured (spinach, beetroot)",
      "¼ cup Parmesan shavings"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Blanch the broccoli in a pan of hot water for 7-8 minutes, and drain well.",
      "Boil the penne until al dante. Run under cold water and drain well.",
      "Heat olive oil in a pan, add garlic and saute for 1-2 minutes. Add the babycorn and saute until slightly brown.",
      "Add the broccoli and toss well for 1-2 minutes. Add seasoning and remove from the flame.",
      "Toss in the pasta, and finish with a shaving of Parmesan on top."
    ],
    "name": "Broccoli, Babycorn and Colourful Pasta Salad"
  },
  {
    "cook_time": "20 minutes",
    "description": "It can't get simpler than this! Penne tossed with black olives, fresh parsley and Parmesan, for a super quick mid-week lunch.",
    "ingredients": [
      "1 cup penne pasta",
      "½ cup black olives, sliced",
      "½ cup parsley, chopped",
      "½ cup parmesan, grated",
      "1/4 cup walnuts, chopped",
      "Salt and pepper to taste",
      "1 tsp olive oil",
      "2 Tbsp orange juice"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Boil the pasta until al dante. Drain well.",
      "Immediately transfer to a large salad bowl, and add in all the remaining ingredients. Toss well and serve immediately."
    ],
    "name": "Parsley and Parmesan Pasta Salad"
  },
  {
    "cook_time": "15 minutes",
    "description": "This pickle is a spice lover's dream come true. Whole chillies stuffed with a host of sizzling spices make this Banarasi preparation a popular one.",
    "ingredients": [
      "1 kg lal mirch (red peppers) ",
      "1 3/4 cup ",
      " (dried mango powder) ",
      "2 1/2 cup ",
      " (powdered mustard seeds) ",
      "1 1/4 cup ",
      " ( fenugreek seeds, powdered)",
      "1 cup ",
      " (fennel seeds) - powdered ",
      "1 1/2 Tbsp ",
      " (asafoetida) ",
      "1 cup salt ",
      "1/2 cup ",
      " (turmeric powder)",
      "4 cups ",
      " (mustard oil) ",
      "1 sterilised container with a lid"
    ],
    "prep_time": "15 minutes",
    "method": [
      "Remove the stalk of the red peppers cutting around the base of the stalk, thus creating an opening to fill them. ",
      "Mix together, everything, except the oil and the red peppers. ",
      "Add 1/4 cup of the oil and rub it into the mixture. ",
      "Stuff this mixture into the red peppers, pressing the filling in firmly, so that it is tightly stuffed. ",
      "Dip each red pepper into the oil and place in the container, one by one. ",
      "Pour the remainder oil over to cover the red peppers. Keep it under the sun for about a week."
    ],
    "name": "Lal Mirch ka Benarsi Achaar"
  },
  {
    "cook_time": "20 minutes",
    "description": "A tangy tamarind chutney that can turn around any meal.\n",
    "ingredients": [
      "1/2 cup tightly packed ",
      " (tamarind)",
      "3/4 cup broken up ",
      " (jaggery)",
      "2 tsp ",
      " (white rock salt) ",
      "1 tsp ",
      " (black rock salt), powdered ",
      "1 tsp ",
      " (powdered dry ginger) ",
      "1/4 tsp",
      " (powdered black pepper) ",
      "1/4 tsp chilli powder ",
      "1 tsp"
    ],
    "prep_time": "2-3 minutes",
    "method": [
      "Soak tamarind in water till soft and pulpy.",
      "Strain and add enough water to make it into a pouring consistency.",
      "Add rest of the ingredients and bring to a boil, then simmer over low heat till it thickens.",
      "Cool and serve. "
    ],
    "name": "Sonth ki Chutney (Vrat)"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Bring alive your everyday food with this zingy chutney. A fresh and quirky mixture of basil onions, ginger, coriander and apples.",
    "ingredients": [
      "150 gm basil leaves ",
      "100 gm coriander leaves ",
      "200 gm chopped onion ",
      "250 gm apples - peeled, cored and chopped ",
      "One green chilli ",
      "1 tsp salt ",
      "50 gm ginger - peeled and chopped",
      "2 tsp pomegranate mollases or tamarind paste."
    ],
    "prep_time": null,
    "method": [
      "Put all ingredients in a blender and puree. ",
      "Refrigerate and serve. "
    ],
    "name": "Basil Chutney"
  },
  {
    "cook_time": "1 Hour",
    "description": "A jar full of prawns that have been marinated in a spicy mix, and then deep fried to perfection. They'll make the perfect accompaniment to any meal.",
    "ingredients": [
      "1/2 kg prawns, deshelled and deveined (pull out the vein)",
      "1 cup coconut vinegar ",
      "200 gm ginger",
      "200 gm garlic",
      "100 gm chilli powder",
      "250 ml sesame oil",
      "Salt to taste ",
      "2 tsp fenugreek (",
      ") seeds "
    ],
    "prep_time": null,
    "method": [
      "Marinate the prawns with salt, 2 tsp chilli powder and two spoons of vinegar and refrigerate for 1 hour. ",
      "Dry roast fenugreek (",
      ") seeds, powder them and keep aside. Boil the vinegar and keep aside. ",
      "Heat oil in a thick bottomed deep pan. Deep fry the prawns and be sure to not overdo them.",
      "In the same oil add the ginger cut into long thin strips. ",
      "Saute for a while, add garlic and saute for 2 minutes. Turn off the flame and add chilli powder till the mix turns cold. ",
      "Mix the fried prawns, salt and vinegar and wait till the mixture comes to room temperature. ",
      "Store in dry glass bottles."
    ],
    "name": "Prawn Pickle"
  },
  {
    "cook_time": "35 Minutes",
    "description": "An unusual sidekick made with brinjals, tomatoes, spices, vinegar and a pinch of sugar.",
    "ingredients": [
      "4 cups ",
      " diced  ",
      "3 Tbsp canola oil  ",
      " 2 tsp ",
      "2 tsp ",
      "1/4 cup curry leaves",
      "1 1/2 cup tomato chopped  ",
      "2 tsp red chilly powder ",
      "2 tsp turmeric",
      "Salt to taste ",
      "3/4 cup sugar",
      "1 cup vinegar "
    ],
    "prep_time": "5 minutes",
    "method": [
      "Heat canola oil and add ",
      " and  ",
      ". ",
      "Once it crackles add curry leaves and immediately add the tomatoes. Sauté for a minute.",
      "Add red chilly powder, turmeric powder, salt and sugar. Stir for a minute.",
      "Now add ",
      " and cook for 3-4 minutes. ",
      "Add vinegar and simmer on slow heat, covered for 2-3 minutes.",
      "Stir again and check for seasoning.",
      "Remove and allow to cool. "
    ],
    "name": "Baingan Ki Chutney"
  },
  {
    "cook_time": "15 Minutes",
    "description": "A tangy Caribbean dip made with tomatoes, onions, celery, red chillies, pepper and squeeze of lime. Goes best with a plateful of crunchy crackers. ",
    "ingredients": [
      "1 cup or 200 gm tomato puree",
      "1/4 cup fresh lime juice",
      "1 tsp white sesame seed",
      "1 cup or 2 medium red onions finely chopped",
      "1 stalk celery finely chopped",
      "4  fresh red chilli finely chopped",
      "Salt to taste",
      "Black pepper to taste",
      "5 pimiento stuffed olives cut into slices"
    ],
    "prep_time": "5 minutes",
    "method": [
      "In a bowl, thoroughly blend together the tomato puree, lime juice, onions, celery, chili pepper, salt, and black pepper.",
      "Stir in the olive slices and sesame seed.",
      "Serve chilled garnished with sprig of coriander leave."
    ],
    "name": "Salsa Creole"
  },
  {
    "cook_time": "45 minutes",
    "description": "Use this freshly made moulding icing to make your cakes and bakes special.",
    "ingredients": [
      "2 cups icing sugar ",
      "1 egg white ",
      "1/4 Tbsp glycerine ",
      "1 Tbsp lemon juice"
    ],
    "prep_time": "5 minutes",
    "method": [
      "Make a dough with all the ingredients. ",
      "Keep covered for 1/2 hour or so. ",
      "Proceed to roll or make the flowers."
    ],
    "name": "Moulding Icing"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Buknu is a powered mixture of several spices. It is an ancient recipe, popular in parts of Uttar Pradesh. It is a local hit for rendering a distinct taste to delicacies.",
    "ingredients": [
      "1 cup ",
      "1 cup salt or to taste ",
      "2 tsp ",
      "powder ",
      "1 tsp oil ",
      "1 tsp cumin ",
      "1/8 tsp ",
      "1 tsp ",
      "1 ",
      "seeds only"
    ],
    "prep_time": "5 minutes",
    "method": [
      "Heat oil and saute ",
      "and ",
      "till a little aroma emanates. ",
      "Cool the sauteed ingredients.",
      "Add ",
      "salt and ",
      "Powder all the ingredients in a blender. ",
      "Store in an airtight jar."
    ],
    "name": "Buknu"
  },
  {
    "cook_time": "1 Hour 30 minutes",
    "description": "This savoury jam with caramelised onions is an absolute treat. Use it in sandwiches, burgers, salads or dips and it will instantly add a boost of flavours.  ",
    "ingredients": [
      "1 kg onions, sliced lengthwise",
      "1 Tbsp oil",
      "1/2 Tbsp butter",
      "2 Tbsp brown sugar (more if you prefer sweeter jam)",
      "1 tsp salt",
      "1 tsp black pepper",
      "1 tsp chilli flakes",
      "Few sprigs of fresh rosemary",
      "3 Tbsp balsamic vinegar"
    ],
    "prep_time": null,
    "method": [
      "Heat oil and butter in a heavy bottomed pan. Add chilli flakes and herbs and cook for 2 minutes until fragrant.",
      "Throw in the onions, and cook on a low flame for 15 minutes. Once they soften and become translucent, increase the flame to medium, cook for another 10-12 minutes or until they start to turn golden brown.",
      "Add brown sugar, salt, pepper and balsamic vinegar and cook for another 10-15 minutes on a low flame, stirring frequently. Cook until all the water has evaporated and the onions are sticky and dark brown in colour. Remove from the flame.",
      "Once cooled, discard the rosemary sprigs. Transfer to a clean and sterilised glass jar.",
      "Tip:This onion jam should be stored in the refrigerated and consumed within a month. It can be used in wraps, sandwiches, pizzas or add a spoonful of the jam to mayo to make a delicious caramelised onion dip."
    ],
    "name": "Onion Jam"
  },
  {
    "cook_time": "5 Minutes",
    "description": "Ready in a few minutes, this aromatic and flavourful Kashmiri masala can make any curry special. ",
    "ingredients": [
      "1/3 cup black pepper",
      "1/3 cup dry ginger",
      "1/3 cup cumin seeds",
      "5 gm cinnamon",
      "1/3 cup cardamom",
      "5 gm cloves"
    ],
    "prep_time": "2 minutes",
    "method": [
      "Grind all ingredients at high speed for 3 minutes.",
      "You should obtain a fine powder which can be sieved and stored in an airtight container. "
    ],
    "name": "Kashmiri Garam Masala"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Cherry and Ginger? Sounds odd right? It tastes the opposite. Don't miss out on this refreshing drink this summer from the house of Yauatcha, Mumbai",
    "ingredients": [
      "2 tbsp vanilla and chilli sugar",
      "3 ml ginger juice",
      "75 ml cherry juice",
      "35 ml jasmine juice",
      "10 ml lime juice",
      "25 ml grapefruit juice"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Take a highball glass.",
      "Add ice cubes.",
      "Shake all the ingredients in the tin.",
      "Strain it over fresh ice.",
      "Strain the contents into the serving glass (over fresh ice).",
      "Garnish with ginger and cherry in prisma."
    ],
    "name": "Cherry and Ginger Ice Tea"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Coriander chutney is common to most Indian households but this recipe will blow your mind! The overpowering taste of coriander is beautifully balanced with mint leaves and a few drops of lemon juice.",
    "ingredients": [
      "100 gm coriander leaves ",
      "1/4 cup chopped green chillies ",
      "1/4 cup mint leaves ",
      "2 tsp salt or to taste ",
      "2 Tbsp lemon juice"
    ],
    "prep_time": null,
    "method": [
      "Place all the ingredients in a blender and blend well.Add a little water only if required to ease blending or grind the ingredients on a grinding stone."
    ],
    "name": "Coriander Chutney (Hare Dhaniye ki Chutney)"
  },
  {
    "cook_time": "5-7 Days",
    "description": "This tangy chutney can brighten up a boring meal. Made with raw mangoes, chillies, cumin, sugar and salt, it will leave your taste buds tingling.",
    "ingredients": [
      "1 kg mango- raw, peeled, shredded and discard seed ",
      "1 kg sugar ",
      "250 gm salt ",
      "30 gm cumin-powdered ",
      "20 gm chilli powder ",
      "1 tsp turmeric"
    ],
    "prep_time": null,
    "method": [
      "Mix all ingredients together and sun for a few days. ",
      "Stir off and on, till sugar dissolves and gets sticky. This should take about 5-7 days."
    ],
    "name": "Chhunddo (Mango Chutney)"
  },
  {
    "cook_time": "20 Minutes + Time to mature(15 days)",
    "description": "This spiced lemon pickle can work wonders for your boring meals.",
    "ingredients": [
      "2 kg lemons, washed, wiped and chopped",
      "250 gm salt",
      "100 gm chilli powder or to taste",
      "50 gm fenugreek seeds (methi dana), finely ground",
      "15 gm asafoetida",
      "2 Tbsp turmeric powder",
      "1 cup sesame oil"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Heat 60 gm (1 cup) oil and add the lemons and saute for about 10 minutes over low heat.",
      "Add salt and chilli powder, saute for another 10 minutes",
      "Add fenugreek seeds, asafoetida and turmeric and the remaining oil, bring to a boil, lower the heat and cook for 10 minutes.",
      "Take it off the heat and store in a clean airtight jar when cool.",
      "Gets softer when matured for 10-15 days. "
    ],
    "name": "South Indian Lemon Pickle"
  },
  {
    "cook_time": "45 minutes",
    "description": "A sweet and sour pickle made with gooseberries. Gooseberries are a great source of Vitamin C.",
    "ingredients": [
      "1 kg amla ",
      "350 gm salt ",
      "240 gm/1 cup sarson ka tel (mustard oil) ",
      "1 Tbsp sarson (mustard seeds) ",
      "1 Tbsp chilli powder ",
      "2 Tbsp heeng (asafoetida)"
    ],
    "prep_time": null,
    "method": [
      "Boil the amla till the skin looks tender (about 15 minutes). ",
      "Leave to drain in a colander till all the water drains out. ",
      "Heat some oil and add the mustard seeds, heeng and chilli powder. ",
      "Mix well and add the amla and salt.",
      "Stir fry till it's mixed well and the amlas are completely coated with masala.",
      "Cool and store in a clean jar."
    ],
    "name": "Amle ka Achaar (Gooseberry Relish)"
  },
  {
    "cook_time": "Overnight",
    "description": "Home-made ghee is pure, healthy and delicious. Use this easy recipe to master the art of making desi ghee. ",
    "ingredients": [
      "2 litres cow's milk"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Bring milk to boil, leave it to cool for 4-5 hours.",
      "This forms a thick layer of cream ",
      "over the top, remove this layer and keep aside. The milk can be then used as skimmed milk for any purpose.",
      "Keep collecting the layered cream for 5-6 days. Refrigerate the cream collected everyday.",
      "For extracting ghee take the cream collected over a period, add double the quantity of water, mix and whip till a froth floats on top.",
      "Separate the froth and heat it on low flame in a thick bottom saucepan till the fat separates into clarified ghee, strain and store for use."
    ],
    "name": "Desi Ghee"
  },
  {
    "cook_time": "25 Minutes",
    "description": "A chunky chutney recipe made with eggplants, mustard oil, vinegar, cinnamon, chillies and a hint of sugar.",
    "ingredients": [
      "1 kg brinjals/eggplants - cut into small cubes ",
      "1/4 cup mustard oil ",
      "1/2 cup onion - chopped fine ",
      "1 Tbsp ginger-garlic paste ",
      "1 cup sugar or to taste ",
      "2 Tbsp salt or to taste ",
      "2 tsp chilli powder ",
      "4 green cardamoms ",
      "4 cloves ",
      "1/8 tsp cinnamon - broken small ",
      "1/2 tsp cumin seeds ",
      "1/4 cup vinegar"
    ],
    "prep_time": null,
    "method": [
      "Grind the cardamoms, cloves, cinnamon and cumin seeds to a fine powder. ",
      "Heat the oil and brown the onions and ginger-garlic paste in it. ",
      "Add the brinjals and saute over high heat till brown. ",
      "Add\n sugar, salt, chilli powder and garam masala and cook to a thick \nconsistency, adding a little water to make it soft and mushy if \nnecessary. ",
      "Add the vinegar and simmer for about 5 minutes. ",
      "When cool, pack in a sterilised airtight jar and store."
    ],
    "name": "Baingan Chutney"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Hot and spicy Mexican barbeque sauce with an innovative addition of beer to it. Serve it along with your meals to jazz up the usual, regular affair.",
    "ingredients": [
      "1 Tbsp olive oil ",
      "1 medium onion, chopped ",
      "1 clove garlic, peeled and minced ",
      "1 fresh chili pepper-stemmed, seeded, chopped ",
      "1-1/2 tsp salt ",
      "2 large tomatoes, peeled and cut",
      "2 Tbsp chilli powder ",
      "2 Tbsp sugar ",
      "1/4 cup vinegar ",
      "1/3 cup olive oil ",
      "1/4 cup beer"
    ],
    "prep_time": null,
    "method": [
      "Heat oil in a sauce pan. ",
      "Saute onion until lightly browned. ",
      "Add garlic, chilli, salt and tomatoes.",
      "Let it simmer until the mixture thickens. ",
      "Add the remaining sauce ingredients.",
      "Cook for about ten minutes, keep stirring.",
      "Put out the heat, let it cool.",
      "Store as required and serve."
    ],
    "name": "Mexican Barbeque Sauce"
  },
  {
    "cook_time": "10 Minutes",
    "description": "A refreshing chutney made with coconut and coriander.",
    "ingredients": [
      "2 1/2 cups fresh coconut - grated ",
      "125 gm green coriander-chopped",
      "25 gm green chillies-chopped ",
      "1 tsp ginger-chopped ",
      "4 tsp rock salt ",
      "1 Tbsp sugar ",
      "2 Tbsp lemon juice"
    ],
    "prep_time": null,
    "method": [
      "Grind all the ingredients together to a fine paste.  ",
      "Can be stored in a dry jar and refrigerated for a few days."
    ],
    "name": "Hare Nariyal ki Chutney"
  },
  {
    "cook_time": "30 Minutes",
    "description": "A smooth and tangy spread made with grapefruits.",
    "ingredients": [
      "750 gm grapefruit    ",
      "100 gm lemons    ",
      "1 1/2 liter water    ",
      "1 1/2 kg sugar    ",
      "1/2 tsp butter"
    ],
    "prep_time": null,
    "method": [
      "Squeeze the juice of the grapefruit and lemons. ",
      "Cook the juice along with water over a moderate flame.   ",
      "Remove membrane, pips and pith from the fruit and tie securely inside a muslin bag. ",
      "Shred peel into strips and add to the juice along with the muslin bag. ",
      "Cook juice until the liquid has evaporated by 1/3.   ",
      "Add sugar and dissolve. ",
      "Boil rapidly until setting point is reached. ",
      "Drop in butter and skim out any impurities from the surface. ",
      "Store in a cool and dry jar.  ",
      "Scoop out a teaspoonful and spread it on a slice of toast."
    ],
    "name": "Grapefruit Marmalade"
  },
  {
    "cook_time": "10 minutes",
    "description": "A spoonful of this delightful mixture into a glass of plain milk and you'll have a healthier and much tastier drink.",
    "ingredients": [
      "100 gm almonds, shelled and coarsely powdered",
      "75 gm ",
      "pistachios, shelled and coarsely powdered",
      "20 cardamoms, shelled and coarsely powdered",
      "1 Tbsp ",
      "saffron, lightly roasted and crushed",
      "1/2 ",
      "nutmeg, grated"
    ],
    "prep_time": null,
    "method": [
      "Mix all the ingredients and store in an airtight jar.",
      " Use 1 tsp of the ",
      " for 1 cup of milk along with sugar to taste."
    ],
    "name": "Masala for Milk"
  },
  {
    "cook_time": "20 minutes",
    "description": "An easy recipe to make chicken stock at home.",
    "ingredients": [
      "250 gm bones of chicken (can be combination of bones and left-over chicken) ",
      "6 cups water   ",
      "1 cup onion-coarsely chopped   ",
      "4 Tbsp celery-chopped  ",
      "1 bay leaf  ",
      "2 cloves  ",
      "2 peppercorns ",
      "Salt"
    ],
    "prep_time": null,
    "method": [
      "Place all the ingredients in a pressure cooker and cook for about 15 minutes.    ",
      "Strain the soup and season according to taste, and use any flesh that is there for sandwiches or salads."
    ],
    "name": "Chicken Stock"
  },
  {
    "cook_time": "10 minutes",
    "description": "A creamy dipping sauce made with mayonnaise. Usually used with sea food, this dip is  loaded with flavor.",
    "ingredients": [
      "1 cup mayonnaise",
      "1 onion-chopped fine",
      "1 tomato-de-seeded and chopped fine",
      "2 Tbsp chopped celery"
    ],
    "prep_time": null,
    "method": [
      "Mix all the ingredients together and serve."
    ],
    "name": "Tartare Sauce"
  },
  {
    "cook_time": "1 hour ",
    "description": "A delectable pork broth made using the bones, it is flavoured with seaweed and a handful of vegetables and slow cooked for hours for the flavours to develop.",
    "ingredients": [
      "2kg pork bones from ribs",
      "2kg pork trotters",
      "2kg pork head (brain removed)",
      "650gm carrot",
      "500gm onion",
      "250gm leeks",
      "100gm garlic",
      "200gm ginger ",
      "1 stick kelp seaweed (konbu) ",
      "20ml soy sauce (light)",
      "15gm bonito flakes",
      "20 litres water"
    ],
    "prep_time": "24 Hours ",
    "method": [
      "Fill a large enough cooking pot with water and bring to boil.",
      "Switch off fire as soon as the water boils. Drop in the bones and let cool. This process will help you get rid of the blood and blood vessels easily.",
      "Drain the water off the bones in a large strainer and discard the water.",
      "Check and take off any blood or blood vessels from the bones and wash them under running water.",
      "Break all the bones in two with a hammer. Leave it to cool down for 30-40 minutes.",
      "Fill the pot again with clear water and place a wire mesh beneath and drop the bones inside. Bring to boil.",
      "Keep cooking over a strong fire and scoop out foam and unwanted matters coming up on the surface ",
      "As the bottom might get hotter than near the surface, stir with a large ladle from time to time.",
      "Continue to boil the broth for 24 hours, or until desired consistency and colour is reached, meat has completely separated and broken down in the broth. Add all vegetables one by one and further boil for 10 more hours. Optionally, you can stir every 1-2 hours just to check up on things and promote more churning. ",
      "Add water if the level gets too low. Once cooked to your liking, strain the broth, discarding the solids, and reserve broth by quickly chilling with ice.",
      "Retain the balance quantity by freezing it in food grade plastic bags and ones you wish to use again, simply cut open the plastic bag and dump the frozen stock lump in a cooking pot and place it over heat to melt/defrost .",
      "Flavour it with soy sauce and bonito flakes. "
    ],
    "name": "Cha Shu Broth"
  },
  {
    "cook_time": "15 Minutes",
    "description": "A simple and easy recipe to making the soft, white and creamy mayonnaise sauce. Use this sauce as a dressing for salads or in your sandwiches or burgers or as a dip.",
    "ingredients": [
      "1 egg                                                                     ",
      "2 Tbsp sirka (vinegar)                                                      ",
      "1/2 tsp or to taste salt                                                                         ",
      "1/8 tsp pissi kali mirch (powdered black pepper)       ",
      "1/2 mustard powder or Mustard oil                     ",
      "1/2 tsp sugar                                                                    ",
      "1 cup (240gm) refined oil                                                             "
    ],
    "prep_time": "05  Minutes",
    "method": [
      "Break egg into the jar of a blender (liquidizer/blender).  ",
      "Add the vinegar, salt, pepper, mustard or mustard oil and sugar.  ",
      "Switch on blender at full speed, and immediately add the oil in a thin stream, with the blender on, all the time, till the required consistency is reached. ",
      "This is like thick cream.  ",
      "As soon as it is thick enough, switch it off and your mayonnaise is ready.  ",
      "This makes about one cup of mayonnaise sauce.",
      "Note: In case it curdles, just empty the jar, break another egg into the jar, start the blender and immediately but slowly add the curdled mixture to the jar till well blended.",
      " "
    ],
    "name": "Mayonnaise Sauce (Blender)"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Beauty expert Suparna Trikha prepares an organic hair tonic that will strengthen your hair and keep it gleaming.",
    "ingredients": [
      "250 ml water",
      "4 bay leaves",
      "3 hibiscus flowers",
      "Handful hibiscus leaves",
      "Handful of basil leaves"
    ],
    "prep_time": null,
    "method": [
      "Take a pan and add water. Let it simmer.",
      "Now add all the other ingredients and bring it to a boil.",
      "Cover it and let it brew till it turns a pinking green hue. Allow it to rest.",
      "Strain it once it cools down."
    ],
    "name": "Hair Tonic"
  },
  {
    "cook_time": "30 Minutes",
    "description": "A BBQ sauce with a twist! This one has a strong cola flavor. Try out something different.",
    "ingredients": [
      "1 onion, diced",
      "1 tomato, diced",
      "1 green chilli",
      "1 tsp chilli flakes",
      "2 Tbsp tomato ketchup",
      "1 jalapeno",
      "1/2 tsp tobasco",
      "1 tsp soy sauce",
      "1/2 cup white wine vinegar",
      "1/2 cup sugar",
      "1/2 cup cola (You can use any black soft drink)"
    ],
    "prep_time": null,
    "method": [
      "In a food processor / ",
      " add onion, tomato, green chilli, chilli flakes, tomato ketchup, jalapeno chilli, Tabasco, soy sauce. Give it a mix. Keep aside.",
      "In a saucepan add white wine vinegar and sugar. Let it reduce by half. Then add the tomato-onion mix. Let it simmer.",
      "Add cola and let it cook for 10 minutes.",
      "BBQ cola sauce is ready!",
      "Apply it on sausages or prawns, char grill them. Serve!"
    ],
    "name": "Cola BBQ Sauce"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Beauty expert Suparna Trikha prepares makes a soft exfoliating scrub for your skin.",
    "ingredients": [
      "1 Tbsp breadcrumbs",
      "1 Tbsp cane sugar",
      "1 Tbsp honey",
      "2 Tbsp strawberries",
      "2 Tbsp multani mitti paste (fuller's earth)  ",
      "A sprinkle of camphor"
    ],
    "prep_time": null,
    "method": [
      "Take all the ingredients together in a small bowl and mulsh them together to form a paste. Store in the fridge to cool."
    ],
    "name": "Summer Exfoliating Scrub"
  },
  {
    "cook_time": "25 minutes + Drying time",
    "description": "Satisfyingly crisp and crunchy, make this much loved Indian snack at home. Aloo papads are popularly made during the festival of Holi.",
    "ingredients": [
      "500 gm Potatoes-boiled and mashed ",
      "2 Tbsp Oil ",
      "Salt and Chilli powder to taste ",
      "Oil to grease while rolling plastic sheet to help roll."
    ],
    "prep_time": null,
    "method": [
      "Mix in the mashed potatoes, oil, salt and chilli powder. ",
      "Knead like a dough till smooth and glossy. ",
      "Take small portions of this mixture and roll as thin as possible, on to the plastic sheet, greasing if it sticks. ",
      "Dry in the sun, store in airtight containers."
    ],
    "name": "Aloo ka Papad"
  },
  {
    "cook_time": "10 Minutes + Marination Time(overnight)",
    "description": "Chutney made with the goodness of plums infused with warm flavours of cinnamon, chillies and cloves.",
    "ingredients": [
      "1 kg plums-chopped ",
      "250 gm sugar",
      "2 Tbsp salt ",
      "1 tsp chilli powder ",
      "1/8 tsp cinnamon",
      " 4 cloves ",
      "2 Tbsp vinegar"
    ],
    "prep_time": "10-15 Minutes",
    "method": [
      "Place plums in a glass or steel vessel and cover with water. Leave overnight. ",
      "Next morning, rub the mixture and remove seeds. ",
      "Add sugar, salt, chilli powder cinnamon and cloves and heat over low heat, stirring all the time to dissolve the sugar. ",
      "Increase the heat and bring to a boil and let cook till thick. A drop dropped in cool water should set.",
      "Add the vinegar and simmer for about 5 minutes. ",
      "When cool, pack in an airtight clean jar and store."
    ],
    "name": "Plum Chutney "
  },
  {
    "cook_time": "10 Minutes",
    "description": "A super quick, super easy chutney recipe made with mint leaves, cumin seeds, onions and yogurt. Relish this perfect sidekick for your starters! ",
    "ingredients": [
      "100 gm fresh mint leaves and tender stalks ",
      "1 cup onions-coarsely chopped ",
      "1 tsp roasted cumin seeds ",
      "Salt to taste ",
      "2 Tbsp chopped green chillies ",
      "2 tsp sugar ",
      "1/4 cup yogurt-beaten smooth "
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Chop the tender stalks and the mint leaves roughly. ",
      "Grind all the ingredients together, except the yoghurt, to form a smooth paste. ",
      "Mix the yoghurt into the ",
      ". ",
      "And serve."
    ],
    "name": "Pudine ki Chutney "
  },
  {
    "cook_time": "10  Minutes",
    "description": "A popular dip from Middle East made with Chef Vicky Ratnani's inventive twist. This one is made with green peas, tahini paste, olives, mustard and lemon juice.",
    "ingredients": [
      "1 cup green peas ",
      "1/2 cup green olives\n",
      "1 1/2 tsp pistachios\n                         \n",
      "1 tsp garlic\n                            \n",
      "1 green chilli\n                    \n",
      "2 Tbsp tahini paste                  \n\n",
      "1/2 cup olive oil\n                       \n",
      "1 Tbsp lemon juice\n",
      "1 Tbsp mustard\n                                     \n",
      "Salt & pepper to taste"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Add a cup of green peas, green chillies, green olives, garlic, pistachios, salt & pepper, tahini paste, lemon juice, mustard and some olive oil. ",
      "Blend it well to a chunky paste.\n",
      "It tastes great on toast, crackers and with some raw veggie batons such as carrots & radishes."
    ],
    "name": "Spicy Green Pea & Olive Hummus"
  },
  {
    "cook_time": "35 Minutes + 3 Days Refrigeration Time",
    "description": "Ditch the mangoes and lemons that have traditionally been packed in pickle jars, here is a new kid on the block - drumsticks. Don't give this one a miss!",
    "ingredients": [
      "15 drumsticks",
      "1 tsp methi (fenugreek seeds)",
      "3 tsp mustard seeds",
      "20 dried red peppers",
      "1/4 tsp asafoetida",
      "1 Tbsp turmeric powder",
      "100 gm tamarind",
      "2 Tbsp vinegar",
      "3 pods of garlic, peeled",
      "3 Tbsp salt",
      "1 cup refined oil",
      "2 Tbsp sesame oil"
    ],
    "prep_time": null,
    "method": [
      "Scrape the drumsticks and cut as desired.",
      "Steam them for 5 minutes.",
      "Make a fine paste of methi, sarson, red chilies and tamarind.",
      "Heat oil and add garlic, ground ingredients, heeng, salt and haldi.",
      "Mix well and add drumsticks.",
      "Cook on low flame for 5 minutes. Take it off the stove and cool.",
      "Then add vinegar and sesame oil.",
      "Transfer into a clean jar. ",
      "Keep the preparation refrigerated for at least 3 days before serving."
    ],
    "name": "Drumstick Pickle"
  },
  {
    "cook_time": "45 Minutes",
    "description": "Ever thought of mutton being pickled? Here we have the tang, spice and acetous sourness of achaar playing well with juicy meat.",
    "ingredients": [
      "2 kg mutton, cut into curry style pieces",
      "60 gm garlic, peeled and pounded",
      "60 gm ginger, peeled and chopped",
      "60 gm garam masala",
      "60 gm mustard powder",
      "1 cup red chilli powder or as required",
      "1/3 cup salt",
      "3/4 cup vinegar",
      "1 cup mustard oil"
    ],
    "prep_time": null,
    "method": [
      "Place the oil to heat in a large kadahi or pan",
      "Keep the heat on high",
      "Add ginger and garlic",
      "Stir fry till light golden brown.",
      "Add meat and continue stirring over high heat",
      "Lower the heat and cook covered till the meat is tender.",
      "Uncover and cook over high heat till fat separates.",
      "Add the powdered spices, salt and mix well",
      "Cook again over high heat, then add vinegar.",
      "Let it come to a boil, then turn off the heat.",
      "Let it cool down completely.",
      "Transfer to a sterilized glass canning jar and store it in the refrigerator"
    ],
    "name": "Gosht Ka Achaar"
  },
  {
    "cook_time": "25 minutes",
    "description": "Fresh and juicy shrimps pickled in malt vinegar and a host of spices.",
    "ingredients": [
      "1 kg shrimps, shelled and de-veined",
      "2 Tbsp whole red chillies",
      "2 tsp ginger paste",
      "2 tsp garlic paste",
      "2 tsp Kashmiri chilli powder",
      "1/2 tsp turmeric powder",
      "2 Tbsp malt vinegar",
      "1 Tbsp achaar masala"
    ],
    "prep_time": null,
    "method": [
      "Mix oil and red chillies.",
      "Cook covered at high heat for 2 minutes.",
      "Mix in the ginger-garlic paste",
      "Cook uncovered at high heat for 3 minutes.",
      "Add shrimps. Mix and cook uncovered at high heat for 7 minutes, stir once.",
      "Mix in chilli powder, turmeric, salt, vinegar",
      "Cook covered at 70% for 7 minutes.",
      "Add achaar masala and mix well",
      "Cool and serve.",
      "Transfer into a clean, sterile airtight jar and refrigerate."
    ],
    "name": "Jhinga Achaar"
  },
  {
    "cook_time": "1 Hour + Overnight soaking",
    "description": "Indian gooseberries cooked in sugar syrup flavoured with cardamom. A sweet alternative to pickles.",
    "ingredients": [
      "1 kg amla",
      "2 tsp chemical lime",
      "1 1/2 kg sugar",
      "6 cups water",
      "1 Tbsp lemon juice"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Prick amla with a fork. Dissolve 1 tsp lime in water and soak amla overnight.",
      "Remove and wash well. Repeat once more.",
      "Drain and wash thoroughly.",
      "Squeeze and rinse to eliminate lime remains.",
      "Boil water then add amla.",
      "Cook till tender and transparent.",
      "Drain and keep aside.",
      "Make syrup with sugar, lemon juice and 6 cups of water.",
      "Maintain one thread consistency, skimming off any scum that keeps forming.",
      "Add amla, bring to a boil and simmer for 4-5 minutes.",
      "Let it cool, then store in a clean airtight jar.",
      "You can add elaichi or any other flavoring of your choice."
    ],
    "name": "Amla Murabba"
  },
  {
    "cook_time": "15 Minutes",
    "description": "An extremely simple and easy to make Turkish accompaniment to your main dish.",
    "ingredients": [
      "3 cups thick yogurt",
      "8-10 cloves ",
      "8-10 garlic- pounded ",
      "1 Tbsp dried mint powder",
      "1 cup water ",
      "Salt to taste"
    ],
    "prep_time": null,
    "method": [
      "Add all ingredients and whip well. ",
      "Yogurt mezze is ready to serve."
    ],
    "name": "Turkish Yogurt Mezze"
  },
  {
    "cook_time": "30 Minutes",
    "description": "This creamy sauce made from an emulsion of egg yolk is an absolute essential for Eggs Benedict. It also goes beautifully with fresh steamed asparagus or other spring vegetables.",
    "ingredients": [
      "2 Tbsp white-wine or tarragon vinegar  ",
      "Lemon juice ",
      "4 Tbsp boiling water ",
      "3 large egg yolks ",
      "1/2 cup unsalted butter ",
      "1/4 tsp cayenne ",
      "1/2 tsp salt"
    ],
    "prep_time": null,
    "method": [
      "Melt the butter and keep it warm. ",
      "Heat the vinegar or lemon juice until warm. ",
      "Meanwhile keep a small saucepan with boiling water and a measuring Tbsp ready. ",
      "Place the top of a double boiler over (not in) hot water. (This means the bottom of the top of the double boiler sound not make contact with the water heating in the bottom half of the double boiler.) ",
      "Place the egg yolks in the top of a double boiler and whisk until they begin to thicken. ",
      "Now add 1 Tbsp of the boiling water. ",
      "Continue to beat the sauce until it begins to thicken. ",
      "Repeat with the remaining water, one Tbsp at a time, beating the mixture after each addition. ",
      "Now add the warmed vinegar or lemon juice. Remove the double boiler from the heat. ",
      "Beat the sauce briskly with a wire whisk. Continue to beat the mixture as you slowly pour in the melted butter. ",
      "Add the salt and cayenne and beat the sauce until it is thick. Serve immediately."
    ],
    "name": "Hollandaise Sauce"
  },
  {
    "cook_time": "Overnight",
    "description": "This creamy Boursin -style spread is absolutely addictive and delicious on your favorite crackers or bread. It is also absolutely fantastic in a sandwich and great with crudities.",
    "ingredients": [
      "1 cup raw cashew nut (not roasted or salted)",
      "3-4 cloves garlic, finely minced",
      "Himalayan sea salt or other unrefined mineral salt, to taste",
      "Freshly ground black pepper, to taste",
      "Mixed Herbs (Fresh or dried)",
      "1-2 tsp lime juice",
      "Filtered water/ Soy milk if required"
    ],
    "prep_time": null,
    "method": [
      "Soak the raw cashews in warm filtered water (just enough to cover them) for at least  2 hours with a dash of sea salt. (4-6 hours of soaking in warm water or overnight is also okay.)",
      "Pour out the water from the cashews and rinse with fresh water.",
      "Add the cashews and other ingredients to a grinder/blender.",
      "Process until you get a thick but creamy spread.",
      "Add Water/Soya milk if needed.",
      "Put  into a glass container, cover, and keep in the fridge overnight for all the flavours to mingle.",
      "It should stay good for 5-6 days after that if refrigerated.",
      "Enjoy with crackers/bread as a dip accompanied by some raw veggies or right off the spoon.",
      "Omit herbs and garlic and use more pepper.",
      "Use shallots instead of garlic.",
      "To the basic mixture, add 1 teaspoon dried basil or any other favourite herb or use 1 tablespoon chopped fresh herbs.",
      "To the basic mixture, add 2 tablespoons chopped roasted red pepper or sun-dried tomato with onions.",
      "To the basic mixture,add de-seeded green chilli and coriander/parsley."
    ],
    "name": "Creamy Boursin-style Spread"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Who would have thought that hummus could be made without chickpeas? Reshma Khattar Bhagat shows you how to make a healthy zucchini hummus.",
    "ingredients": [
      "1 zucchini, peeled and chopped",
      "1/2 cup soaked almonds, peeled",
      "3 Tbsp lemon juice",
      "1 Tbsp onion powder",
      "2 Tbsp garlic, minced",
      "1 Tbsp cumin",
      "3-4 Tbsp tahini",
      "Rock salt, to taste",
      "Pepper, to taste",
      "3 Tbsp olive oil",
      "1/4 cup parsley"
    ],
    "prep_time": null,
    "method": [
      "Combine zucchini, almonds, lemon juice, garlic, onion powder, cumin, tahini, salt and pepper in the food processor till smooth.",
      "Add olive oil and pulse it again.",
      "Now add the parsley in the end and finish with a quick pulse.",
      "Garnish with some parsley.",
      "Serve with crackers."
    ],
    "name": "Zucchini Hummus"
  },
  {
    "cook_time": "30 minutes",
    "description": "The perfect accompaniment to a full fledged Punjabi meal. This Punjabi style mango pickle is made with whole spices and stored in mustard oil.",
    "ingredients": [
      "2 1/2 kg mango, chopped into desired size",
      "100 gm fenugreek seeds (methi dana)",
      "50 gm coarsely ground red pepper",
      "60 gm onion seeds (kalonji)",
      "100 gm fennel seeds (saunf)",
      "2 Tbsp black peppercorns",
      "50 gm turmeric powder",
      "300 gm salt",
      "1 1/2 liters mustard oil"
    ],
    "prep_time": "30 minutes",
    "method": [
      "Mix all the spices together and add half a cup of oil to the mix. Sprinkle a little of this mixture into the jar.",
      "Take some mangoes and rub them well in the spice mixture. Put one layer of the mangoes in the jar and sprinkle some more spice mixture on top.",
      "Keep repeating the layering process with a sprinkle of mixture till the mangoes are used up. Put all the remaining mixture on top of these layers.",
      "Add the rest of the oil to the jar until its contents are covered. Keep in the sun for a week then store. The contents will be very tender in a month.",
      "Serve with your favorite parantha!"
    ],
    "name": "Aam Ka Achaar"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Indulge in some culinary magic as Aditya Bal and Devanshi fuse traditional ingredients with western influences keeping in mind the health quotient. A Mexican salsa with corn, coriander and chat masala.",
    "ingredients": [
      "1 cup sweet corn",
      "1 finely chopped onion",
      "1 tsp jalapenos, chopped",
      "1 lemon, juice",
      "1/2 tsp chilly flakes",
      "1/2 tsp salt",
      "2 tsp coriander leaves",
      "1/2 tsp chaat masala",
      "A pinch of cumin powder"
    ],
    "prep_time": null,
    "method": [
      "In a bowl mix the sweet corn, onion and jalapenos.",
      "Squeeze the juice of a lemon.",
      "Add to that chilli flakes, salt and coriander.",
      "Now add the chaat masala, cumin powder.",
      "Mix well.",
      "Serve it with baked corn tortilla chips."
    ],
    "name": "Spicy Corn Salsa"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Whip up a quick yogurt side dish with some green chillies thrown in for that extra kick.",
    "ingredients": [
      "1 bowl yogurt or dahi",
      "2- 3 Tbsp green chillies, finely chopped",
      "A pinch of salt",
      "A pinch of red chillies",
      "A handful of fresh coriander leaves, chopped fine"
    ],
    "prep_time": null,
    "method": [
      "In a bowl mix the yogurt, salt, coriander leave and green chillies.",
      "Serve chilled."
    ],
    "name": "Green Chilly Raita"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Serve these sweet and tangy grilled pineapple rings with some grilled chicken and you're sorted. Perfect-o!",
    "ingredients": [
      "2 tins pineapple rings"
    ],
    "prep_time": null,
    "method": [
      "Slather the ",
      " well onto the pineapple rings.",
      "Grill for 10 minutes or till golden brown."
    ],
    "name": "Grilled Pineapples"
  },
  {
    "cook_time": "10 Minutes",
    "description": "An innovative dip made with grilled bell peppers, garbanzo beans, chillies and garlic. Serve with freshly cut vegetables, pita bread or crackers.",
    "ingredients": [
      "1 bell pepper (213gm)",
      "5 garlic cloves (22gm)",
      "7 Thai chillies (9gm)- Optional",
      "15 Oz. cooked garbanzo beans/ chickpeas (425gm)",
      "2 1/2 Tbsp lemon",
      "1 tsp salt",
      "1/4th cup olive oil"
    ],
    "prep_time": null,
    "method": [
      "Wash and grill the bell pepper.",
      "In a blender add all the ingredients together. Give it a whiz. Please note that the lemon, garlic, Thai chillies and salt may vary according to your taste.",
      "Dip or spread on pita bread, whole-wheat crackers, trader Joe's savory thin mini edamame crackers, celery, carrots and cucumbers."
    ],
    "name": "Bell Pepper and Bean Dip"
  },
  {
    "cook_time": "25 Minutes",
    "description": "A dip that is hearty and full of flavours. This dip recipe is simple and fast, use it as a starter or for a dip with salads.",
    "ingredients": [
      "1 onion finely chopped",
      "3 garlic cloves finely chopped",
      "1 green chili finely chopped",
      "Olive oil",
      "1 roasted aubergine",
      "1 tsp coriander seeds",
      "1 tsp chilli powder",
      "1 lemon",
      "Fresh coriander leaves chopped",
      "100 gm curd",
      "1 cucumber ",
      "Salt and pepper to taste"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Heat the pan and add 6 tsp of olive oil and add garlic, onion and green chilli. Then season it with salt.",
      "Take a roasted aubergine and scope out some of its flesh. Peel off the skin and chop the aubergine.",
      "Add the aubergine to the pan and season with salt and coriander seeds.",
      "Mash it with fork.",
      "Add chilli powder and let it cook for some time.",
      "Finish it off with juice of 1/2 lime and let the mixture cool down.",
      "Then in a bowl add some coriander leaves & curd and mix it.",
      "Add aubergine mixture to it and mix it all well.",
      "Cut 1 cucumber in halves and de-seed it.",
      "Fill the cucumber boat with aubergine dip."
    ],
    "name": "Roasted Aubergine Dip"
  },
  {
    "cook_time": "15 Minutes",
    "description": "A top favorite munch, oven toasted multi-grain bread lathered with a garlic and butter.",
    "ingredients": [
      "4 Tbsp butter",
      "5 garlic cloves",
      "1 multi grain bread",
      "1 tsp of chili flakes"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Pre-heat the pan.",
      "Chop 5 garlic cloves.",
      "Cut 3-4 thick slices of multi-grain bread.",
      "Add 4 Tbsp of butter into the hot pan.",
      "Add chopped garlic and 1 tsp chili flakes. Mix well.",
      "Turn off the heat and let it cool down. Transfer to a bowl.",
      "Spread the garlic butter on the bread slices and put in the oven at 150 degrees for 2 to 3 minutes till the bread turns golden brown."
    ],
    "name": "Multi-Grain Garlic Bread"
  },
  {
    "cook_time": "30 Minutes",
    "description": "A sidekick that is sweet and sour in one bite! Made with dry mango powder, jaggery and spices.",
    "ingredients": [
      "300 gm whole amchoor",
      "200 jaggery ",
      "Salt according to taste",
      "3 gm red chilli powder ",
      "Pinch of turmeric",
      "3 gm coriander powder ",
      "2 gm kalonji ",
      "2 gm cumin seeds oil "
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Boil the amchoor in water and leave aside.",
      "Heat oil in a handi and add the roasted cumin seeds, kalonji and the rest of the masalas and in the end the amchoor.",
      "Crush the jaggery into pieces and add to the mixture. Add a little water.",
      "Cook till the jaggery dissolves and the liquid thickens."
    ],
    "name": "Amchoor ki Launji"
  },
  {
    "cook_time": "20 minutes + 7 days (rest time)",
    "description": "This pickle is a perfect accompaniment with your meals during winters. Make it once and store it for weeks!",
    "ingredients": [
      "250 gm carrots ",
      "3 Tbsp powdered mustard seeds ",
      "1 Tbsp salt ",
      "1 Tbsp chilli powder ",
      "1/2 cup mustard oil"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Peel the carrots, and cut them into 7cm/3\" pieces, not too thin (about finger size, you can say). ",
      "Mix all ingredients together, and put the mixture into a clean jar with a tight lid.",
      "Leave in the sun for about a week and shake the bottle once a day to mix well."
    ],
    "name": "Gajar ka Achaar "
  },
  {
    "cook_time": "30 Minutes",
    "description": "A coconut based masala that is guaranteed to make an ordinary curry interesting.",
    "ingredients": [
      "4 cups coriander seeds  ",
      "1 cup dry coconut  ",
      "1/2 cup white ",
      "sesame seeds",
      "1/2 cup black ",
      "sesame seeds",
      "1/4 cup ",
      "cumin seeds",
      "4-5 tsp black cumin seeds  ",
      "2 teaspoon asafoetida (",
      ")  ",
      "1 Tbsp ",
      "cinnamon - broken into tiny pieces  ",
      "3-4 cloves",
      "1 ",
      "black cardamom - seeds only  ",
      "3 dry red chilies  ",
      "1 tsp turmeric powder   ",
      "Salt to taste   ",
      "1 Tbsp oil"
    ],
    "prep_time": null,
    "method": [
      "Roast all the ingredients except coconut and coriander seeds in oil. Keep aside.    ",
      "Roast coconut and coriander seeds separately without oil.     ",
      "Now ",
      "grind all these items together.     ",
      "Let it cool and store in an airtight container."
    ],
    "name": "Maharashtrian Goda Masala"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Khaboos is an Iranian or Arabic flat-bread made with maida. Goes well with stews, hummus or dips.",
    "ingredients": [
      "4 cups refined flour ",
      "1 1/4 cups yoghurt ",
      "1 tsp baking soda ",
      "1 tsp salt ",
      "onion seeds to garnish"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Sift the flour along with the salt and the soda, and knead it to a soft, smooth dough, with the yoghurt. ",
      "Cover with a damp cloth, and leave to rise in a warm, draught free place. ",
      "If in a hurry, place the dough container in a larger container of hot water, covered with a damp cloth, of course. Takes about 2 hours to rise. ",
      "Punch the dough and leave to rise again. ",
      "This time it will take much less time. ",
      "Knead the dough a little before breaking it up into walnut sized pieces. ",
      "Smoothen these into round balls, cover with a damp cloth and leave thus, for at least 15 minutes. ",
      "Roll the balls into flat oval or round shapes, stretching and pulling with your hands when required. ",
      "When all are rolled thus, dampen the surface with water or milk, and sprinkle the onion seeds over them. ",
      "Bake these in a preheated oven, on a greased baking tray for about 5 minutes. ",
      "Better still, is to grill them if your griller has elements both above and below. ",
      "Of course, if you have a clay oven tandoor, wet the lower surface with water and stick it to the walls of the tandoor. ",
      "To make the naan tastier, brush it with melted butter or 'ghee' as soon as it comes out of the oven."
    ],
    "name": "Khaboos "
  },
  {
    "cook_time": null,
    "description": "Citrus flavored butter makes a simple slice of bread delicious.",
    "ingredients": [
      "1 Tbsp softened butter  ",
      "Grated rind of 1 lime   ",
      "1 green chilli - deseeded and chopped   coarsely ",
      "Ground black pepper"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Beat the butter, lime, chilli and pepper  together."
    ],
    "name": "Spiced Butter"
  },
  {
    "cook_time": "5 Minutes",
    "description": "Re-constitute this mix of poppy seeds, almonds and rose petals. Mixed with milk for a refreshing summer cooler.",
    "ingredients": [
      "1/4 cup poppy seeds  ",
      "1/2 cup melon seeds-dried and peeled  ",
      "1/4 cup almonds  ",
      "2 Tbsp fennel seeds  ",
      "2 Tbsp dried red rose petals  ",
      "1.5 tsp peppercorns"
    ],
    "prep_time": null,
    "method": [
      "Grind all the ingredients together. ",
      "Mix with milk and serve chilled."
    ],
    "name": "Thandai / Sardai Mixture"
  },
  {
    "cook_time": "5 Minutes",
    "description": "Lemon and garlic flavoured oil dressing for salads.",
    "ingredients": [
      "4 Tbsp lemon juice ",
      "6 Tbsp oil ",
      "2 Tbsp vinegar ",
      "4 tsp salt ",
      "1 tsp pepper ",
      "1 tsp mustard powder ",
      "4 cloves crushed garlic"
    ],
    "prep_time": null,
    "method": [
      "Mix all the ingredients together and use. ",
      "French dressing can be made and kept in a screw-topped bottle for future use. ",
      "Always shake the bottle well before use."
    ],
    "name": "French Dressing"
  },
  {
    "cook_time": "45 minutes",
    "description": "Make homemade chicken stock to use in a variety of dishes. ",
    "ingredients": [
      "1/2 kilo of chicken bones",
      "1 1/2 litres of water",
      "1 large bay leaf",
      "1 onion quartered",
      "1 carrot, halved",
      "10 whole black peppercorns",
      "Salt "
    ],
    "prep_time": null,
    "method": [
      "Put in a pressure cooker till the chicken is cooked. ",
      "Then let it sit for at least half in hour. ",
      "Drain the chicken and all else, and you have fresh homemade stock."
    ],
    "name": "Fresh Chicken Stock"
  },
  {
    "cook_time": "45 Minutes",
    "description": "A savory jam that goes perfect on the side with meat or toasts.",
    "ingredients": [
      "1 kg onions",
      "4 Tbsp salad/olive oil",
      "100 gm sugar/jaggery",
      "300 ml vinegar",
      "4 cloves",
      "2 bay leaves",
      "2 tbsp tomato puree",
      "A pinch chilli powder",
      "Salt and pepper to taste"
    ],
    "prep_time": null,
    "method": [
      "Saute sliced onions in oil until soft.",
      "Add remaining ingredients and cook for an hour. Re-season.",
      "Cool and store in a clean and dry jar.",
      "Serve on toast / canapes or as an accompaniment with cold cuts."
    ],
    "name": "Onion Marmalade"
  },
  {
    "cook_time": "1 Hour",
    "description": "Khoya is used mainly for making Indian sweets like barfis and gulab jamun.",
    "ingredients": [
      "1 kg full cream milk",
      "A large "
    ],
    "prep_time": null,
    "method": [
      "Bring the milk to boil in the ",
      " and then simmer over low heat.",
      "Stir to avoid scorching till the milk thickens and collects together in a solid mass."
    ],
    "name": "Khoya"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Homemade mayonnaise is handy to use in sandwich fillings, salad dressings or sauce bases.",
    "ingredients": [
      "1 egg ",
      "2 Tbsp vinegar ",
      "1/2 tsp sugar ",
      "1/2 tsp salt ",
      "1/2 tsp mustard powder or mustard oil ",
      "1/4 tsp powdered black pepper ",
      "1 cup oil"
    ],
    "prep_time": null,
    "method": [
      "In a deep bowl, break the eggs. Add to it the vinegar, sugar, salt, mustard and pepper.  Beat these ingredients together, till fairly thick.  ",
      "Now add 1 tbsp of oil and continue beating till well blended and a little thickened.   ",
      "Add another tbsp and follow the same procedure, repeating till all the oil has been used up.  ",
      "At the end of using the whole cup of oil, the mayonnaise should reach the required thick and creamy consistency, leaving a light trail."
    ],
    "name": "Mayonnaise"
  },
  {
    "cook_time": "45 Minutes",
    "description": "Try your hand at making unsalted white butter (Safeed makhan) at home.",
    "ingredients": [
      "Cream or ",
      " (Malai is the fat obtained from milk)",
      "Ice cubes"
    ],
    "prep_time": null,
    "method": [
      "Take ",
      " in a small bowl at room temperature.",
      "Take a bigger bowl and add ice cubes to it. Place the small bowl with malai on top of these ice cubes.",
      "Beat well till the butter floats on top.",
      "Let it stand for 15-20 minutes. The butter will solidify.",
      "Skim the butter and leave the liquid.",
      "This butter is unsalted and usually white in color."
    ],
    "name": "White Butter"
  },
  {
    "cook_time": "10 Minutes + Time to set",
    "description": "Stop buying the packaged yogurt that are full of preservatives. Learn how to make smooth and creamy yogurt at home.",
    "ingredients": [
      "2 1/2 cups milk",
      "1 tsp yoghurt (as a starter)"
    ],
    "prep_time": null,
    "method": [
      "Boil the milk and transfer it into the container in which the yoghurt is to be set. A ceramic bowl is best.",
      "Cool the milk to a luke warm temperature-a drop of it on your wrist, should feel neither hot nor cold. The temperature of the milk is important.",
      "Beat the teaspoonful of yoghurt till smooth, add 2 Tbsp milk to it and mix well. Add this to the rest of the milk and stir with a spoon to mix well.",
      "Cover the container and keep in a draught-free place to set.",
      "Do not move the container while the yoghurt is setting.",
      "Once set, place the yoghurt in the refrigerator to chill before serving."
    ],
    "name": "Yogurt"
  },
  {
    "cook_time": "15 minutes",
    "description": "Learn how to make the age old garam masala at home. Roasted spices ground together to make a aromatic masala.",
    "ingredients": [
      "150 gm cumin seeds",
      "50 gm black cardamom seeds",
      "25 gm cinnamon",
      "25 gm cloves",
      "25 gm peppercorns",
      "4 bay leaves"
    ],
    "prep_time": null,
    "method": [
      "Sun all ingredients or place them over an oven to rid them of any moisture.",
      "Then grind them to a powder in a food processor.",
      "Store in an airtight jar."
    ],
    "name": "Garam Masala"
  },
  {
    "cook_time": "1 Hour",
    "description": "A basic recipe of how to make soft cottage cheese at home. Cube it, fry it, crumble it and enjoy in the dishes of your choice.",
    "ingredients": [
      "1 kg full cream milk",
      "2 Tbsp sour lime juice"
    ],
    "prep_time": null,
    "method": [
      "Boil the milk, lower heat and add lime juice, stirring till the milk begins to curdle.",
      "When the whey is clear, stop adding the solution, shut off the heat and leave for about 5 minutes.",
      "Drain curdled milk through a cloth and leave to set for an hour or so.",
      "They whey left behind is very nutritious and can be used for gravies, rice, lentils.",
      " In case you live in the West, or somewhere where the milk is very rich, use a less fatty milk, or else the ",
      " will not hold its shape"
    ],
    "name": "Paneer or Cottage Cheese"
  },
  {
    "cook_time": "45 minutes",
    "description": "Sprinkle this chaat masala on top of your tikki, bhalle, papri, bhelpuri and get an instant boost in the flavor of the chaat.",
    "ingredients": [
      "1 cup ",
      "coriander seeds",
      "1 1/4 cups cumin seeds",
      "1/2 cup thymol seeds/ ",
      "1/2 cup mango powder",
      "2 1/2 tsp ",
      "1 1/4 cups powdered black rock salt",
      "4 tsp powdered black pepper",
      "2 tsp (approx) citric acid",
      "1/2 cup dried and powdered mint leaves"
    ],
    "prep_time": null,
    "method": [
      "Roast the coriander, cumin and ajwain in a heavy-based pan till dark brown.",
      "Remove from pan and leave to cool.",
      "Put all the ingredients together and powder fine, in a processor.",
      "Store in an airtight jar."
    ],
    "name": "Chaat Masala"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Authentic yellow curry paste used in a wide variety of dishes. Store in an airtight container. ",
    "ingredients": [
      "1/2 stalk lemongrass - sliced   ",
      "2 dried yellow chillies  ",
      "1/2 cup chopped onion  ",
      "2 Tbsp chopped galangal or ginger  ",
      "1 Tbsp chopped garlic  ",
      "1 tsp powdered coriander   ",
      "1 tsp mustard seeds   ",
      "3 Tbsp fish sauce  ",
      "1/2 tsp turmeric powder   ",
      "1 tbsp brown sugar  ",
      "2 ",
      " lime leaves - snipped into small pieces with scissors   ",
      "1 Tbsp lemon juice   ",
      "1/4 cup coconut milk"
    ],
    "prep_time": null,
    "method": [
      "Place all ingredients in a blender and blend well to a paste. ",
      "Store in an airtight container in the refrigerator for up to two weeks (or longer). ",
      "To use right away, place paste in a wok with some vegetable oil. ",
      "Stir fry until fragrant (about one minute), then add some coconut milk plus some more lemongrass stalk. ",
      "Add meat, chicken or tofu or vegetables and cook till tender."
    ],
    "name": "Thai Yellow Curry Paste"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Thai red curry paste plays an indispensable part in several recipes.",
    "ingredients": [
      "10 dried red chillies, broken ",
      "6 cloves of garlic, peeled ",
      "1 onion, chopped  ",
      "3/4 piece of ginger, peeled  ",
      "1 cup chopped coriander ",
      "Rind of 1 lemon, grated ",
      "Juice of 1/2 lemon  ",
      "1 Tbsp ground coriander ",
      "2 Tbsp ground cumin ",
      "2 stalks of lemon grass  ",
      "1 tsp salt  ",
      "1/2 tsp pepper"
    ],
    "prep_time": null,
    "method": [
      "Grind all the ingredients in a mortar or a food processor using a little water.",
      "Store in an airtight container or in the refrigerator. ",
      "Alternatively, freeze for upto 3 months. Use as required."
    ],
    "name": "Thai Red Curry Paste"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Tandoori masala made quickly. Sprinkle it on top of prepared tandoori dishes or add it in the marinade to make the dish more aromatic.",
    "ingredients": [
      "1/4 cup dried, powdered ginger",
      "1/4 cup dried, powdered garlic",
      "2 Tbsp black pepper",
      "2 Tbsp ",
      "1/4 cup ",
      "1/4 cup powdered red pepper",
      "1/4 cup ",
      "3/4 cup salt",
      "1/4 cup dried, powdered onion",
      "1 tsp powdered red colour (optional)"
    ],
    "prep_time": null,
    "method": [
      "Mix all the ingredients, blend in a blender and  store in an air-tight jar."
    ],
    "name": "Tandoori Masala"
  },
  {
    "cook_time": "2 Hours",
    "description": "Let the aroma of freshly baked bread spread in your house. Soft and light, this bread recipe will not disappoint you.",
    "ingredients": [
      "Oven temp: 400 F - 200 C",
      "1 tsp (5 gm) sugar",
      "Lukewarm water to knead dough (too hot will kill yeast)",
      "1 tsp dry yeast or 10 gm compressed (Frozen) yeast",
      "2 cups (240 gm) flour (maida)",
      "Salt to taste",
      "1 tsp oil",
      "Greased loaf tin (about 20cm /8\" x 9cm/4\" x 9cm/4\")",
      "1 egg, slightly beaten with 1 Tbsp (15 g) milk and 1/4 tsp salt",
      "Note: In case you do not want to use egg, use 1/4 cup milk and salt mixture."
    ],
    "prep_time": "15 Minutes",
    "method": [
      "Dissolve sugar in 1/2 cup lukewarm water (should be body temperature, i.e. when put on the wrist, should not feel warm or cold).",
      "Sprinkle dry yeast over it or blend the frozen yeast into the water. Leave this solution in a draught-free place to froth. Should take about 10 minutes. In case it does not, it means that your yeast is ineffective, hence change your packet.",
      "Sieve the flour, add salt and rub in the oil. Make a well in the centre of the flour; pour the yeast mixture and some of the water into it. Start mixing the flour and liquid together, adding liquid little by little till smooth and soft.",
      "Knead the dough on a floured surface for at least 10 minutes--fold dough towards yourself, then push down and away with the heels of the palms. Continue till the dough feels firm and elastic and no longer sticky.",
      "Place dough in a deep vessel, well dusted with flour, and cover vessel with cling film or a thick damp cloth. Keep in a draught-free place to rise.",
      "When dough rises (about an hour in warm weather and 2-3 hours in cooler climate and about 45 minutes if using the warm water technique), punch it and knead a little before leaving it to rise again. The second rise will take a much shorter time. To test the dough, press lightly into the dough with a finger, and if the impression fills up soon, it is done.",
      "After the second rising, roll dough out flat, about 1/4 cm (1/8\") thick, and then roll it like a scroll. Fold the two ends of the roll towards each other, making them meet in the centre. Place the dough in the tin, folded side down. The dough should not fill more than half the tin.",
      "Brush with egg mixture and leave to rise once again. When the dough doubles (about 15 minutes), bake in a pre-heated oven, placing a bowl of hot water at the bottom (to humidify the baking atmosphere). Bake for about 30-40 minutes, or until brown and the loaf leaves the sides of the tin. Remove from the oven and place inverted on a wire rack to cool. If you want a soft top, place on a thick cloth like a folded towel instead of the rack. ",
      "    "
    ],
    "name": "Plain White Bread"
  },
  {
    "cook_time": "15 minutes",
    "description": "Give your tea a twist with this chai masala. Make it once and use it for months. Water, milk, sugar and this chai masala for a flavorsome tea.",
    "ingredients": [
      "Star anise (",
      ")",
      "Cinnamon (",
      ")",
      "Laung (cloves)",
      "Elaichi (cardamom)"
    ],
    "prep_time": null,
    "method": [
      "Grind and store in an airtight jar."
    ],
    "name": "Chai ka Masala (Spice Mixture for Tea)"
  },
  {
    "cook_time": "15 Minutes + Soaking time(1/2hr)",
    "description": "A dash of lemon keeps the rice grains from getting soggy. Steamed rice can be served with any gravy dish.",
    "ingredients": [
      "1 cup (180 gm) long grained rice  ",
      "Water  ",
      "Lemon juice"
    ],
    "prep_time": null,
    "method": [
      "Clean the rice and wash well till the water is clear.    ",
      "Soak the rice in 2 cups of water for at least 1/2 hour.    ",
      "In a heavy bottomed pan, put the rice and water over high heat and bring to a boil, adding the lemon juice also.    ",
      "Once it comes to a boil, cover, and let it simmer over low heat, till cooked through, and the water is absorbed. ",
      "Takes about 10 minutes. Serve hot."
    ],
    "name": "Steamed Rice"
  },
  {
    "cook_time": "20 minutes",
    "description": "Caramel is used as a flavoring agent in ice creams, puddings, cakes and candies.",
    "ingredients": [
      "1 cup sugar",
      "1/2 cup water"
    ],
    "prep_time": null,
    "method": [
      "Place 1 cup of sugar and 1/2 cup of water in a pan and heat over low heat.",
      "When the sugar melts, it will gradually get darker.",
      "When dark and almost bubbly, the caramel is ready."
    ],
    "name": "Caramel"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Apples stewed with a little water to make some baby food. Add a pinch of cinnamon and some brown sugar to turn it into a delicious dessert.",
    "ingredients": [
      "Apples",
      "Water"
    ],
    "prep_time": null,
    "method": [
      "Put peeled and chopped apples in a heavy-bottomed saucepan, with a little bit of water (to just about form a thin layer at the bottom of the pan), cover and cook over low heat till some of the juices are drawn, and the bottom becomes liquidy.",
      "Remove lid and let any excess liquid dry up, taking care not to let the apples burn.",
      "Apples can also be stewed in a pressure cooker."
    ],
    "name": "Stewed Apples"
  },
  {
    "cook_time": "15 minutes + Chilling Time",
    "description": "Dip made with the goodness of dried figs blended in the flavors of malt and white vinegar, chillies and garlic.",
    "ingredients": [
      "2 Tbsp sunflower or vegetable oil",
      "1 onion, finely chopped",
      "2-3 garlic cloves, roughly chopped",
      "500 gm dried figs, roughly chopped",
      "1 Tbsp sugar",
      "4 green chillies, roughly chopped",
      "4 Tbsp malt vinegar",
      "4 Tbsp white vinegar"
    ],
    "prep_time": null,
    "method": [
      "Heat the oil in a small frying pan. ",
      "Fry the onion and garlic in the oil until golden brown. Set aside. ",
      "Place the remaining ingredients in a blender with the fried onions and garlic and whiz to a smooth, thick paste. ",
      "Chill for at least 30 minutes before serving. ",
      "The chutney can be stored in an airtight, non-metallic container in the refrigerator for upto 1 month."
    ],
    "name": "Fig Chutney"
  },
  {
    "cook_time": "20 minutes",
    "description": "A creamy yogurt based dip with the crunchiness of onions and peanuts. Tempered with mustard seeds.",
    "ingredients": [
      "250 ml natural unsweetened yogurt",
      "1 onion, finely sliced or chopped",
      "1 tomato, chopped",
      "1 green chilli, finely chopped",
      "1/4 tsp salt",
      "1 Tbsp vegetable oil",
      "1/4 tsp brown mustard seeds",
      "10-12 unsalted peanuts (optional), skinned"
    ],
    "prep_time": null,
    "method": [
      "In a bowl, whip the yogurt until it is creamy.",
      "Fold in the onion, tomato, green chilli, and salt.",
      "Heat the oil in a small frying pan, then add the mustard seeds.",
      "Fry for a few seconds until you can smell the aroma, then tip in the peanuts, if using.",
      "Fry for a minute, making sure they don't burn.",
      "When the mixture has cooled gently add it to the yogurt.",
      "Serve chilled."
    ],
    "name": "Yogurt Dip"
  },
  {
    "cook_time": "1 Hour 20 Minutes",
    "description": "This adrak ka achaar is super easy and quick. Very popular during the festival of Navratras.",
    "ingredients": [
      "1/2 kg raw ginger, julienne (kachi adrak)",
      "Juice of 13-15 lemons",
      "2-3 tsp vinegar",
      "3-4 tsp salt or to taste"
    ],
    "prep_time": null,
    "method": [
      "Peel and julienne ginger.",
      "In a jar add ginger, salt, vinegar and lemon juice. Shake the jar vigorously.",
      "Let the achaar rest for an hour.",
      "When the ginger is a little pink, it means the pickle is ready to eat.",
      "It is perfect to consume this achaar during the festival of ",
      "."
    ],
    "name": "Adrak ka Achaar (Ginger Pickle)"
  },
  {
    "cook_time": "15 Minutes",
    "description": "A dip made with the refreshing and pleasing flavors of coriander, avocado, parsley, yogurt and lemon juice.",
    "ingredients": [
      "2-3 garlic cloves, peeled",
      "1 shallot, chopped",
      "1 avocado, chopped",
      "1 bunch chopped parsley",
      "125 gm bunch coriander, chopped",
      "75 ml olive oil",
      "2 Tbsp plain natural yogurt",
      "3 tsp lemon juice",
      "1 pinch fine sea salt and freshly ground black pepper"
    ],
    "prep_time": null,
    "method": [
      "Place the garlic, shallot, avocado, parsley, coriander, olive oil, yogurt and lemon juice in a blender or food processor and blend until smooth. ",
      "Season with sea salt and freshly ground pepper."
    ],
    "name": "Coriander Relish"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Pita bread served with three cool and refreshing dips: beetroot, yogurt and carrot. This middle eastern food is a light and healthy option for you.",
    "ingredients": [
      "100 gms boiled beetroot",
      "1/2 tsp grated garlic",
      "6 Tbsp curd",
      "1 tsp lemon juice",
      "4 Tbsp olive oil",
      "6-7 olives",
      "2 Tbsp chopped mint",
      "Salt ",
      "Pepper",
      ":",
      "2 cups yogurt",
      "2 tbsp chopped parsley",
      "2 Tbsp chopped mint",
      "1 Tbsp lemon juice ",
      "2 Tbsp extra virgin olive oil",
      "Salt",
      "Pepper",
      "1/2 tsp cumin powder",
      "2 Tbsp butter",
      "3 Tbsp extra virgin olive oil",
      "2 carrots (grated)",
      "2 Tbsp yogurt",
      "1 clove of garlic",
      "Salt",
      "Pepper"
    ],
    "prep_time": null,
    "method": [
      "Blend the boiled beetroots into a fine paste. ",
      "To the beetroot paste add curd, grated garlic, lemon juice, olive oil and mix them all together.",
      "Drizzle some olive oil and garnish with olives and chopped mint.",
      "Season to taste.",
      "In a salad bowl, take yogurt, lemon juice, olive oil, mint, parsley, salt, pepper and cumin powder.",
      "Mix all the ingredients together to make the labneh.",
      "Heat butter in a pan; add some olive oil and grated carrots.",
      "In a flat plate, take yogurt, add garlic, salt, pepper and olive oil then add cooked carrots to the yogurt mix. ",
      "Top with chopped parsley and olive oil.",
      " Serve Pita bread with the three refreshing dips."
    ],
    "name": "Pita Bread with Dips"
  },
  {
    "cook_time": "30 Minutes",
    "description": "A pineapple chutney, that's chunky, sweet and sour in one bite. You can alter the spice quotient in this pachadi by going easy on the chillies.\n",
    "ingredients": [
      "1 cup coconut",
      "2 cups ripe pineapple, chopped",
      "2 green chillies, slit (deseeded)",
      "2 inch piece of ginger",
      "Salt to taste",
      "1/2 cup water",
      "2 dry red chillies",
      "1 tsp mustard seeds, crushed",
      "1 cup yoghurt",
      "1 Tbsp oil",
      "1/2 tsp mustard seeds",
      "2 whole dry red chillies",
      "A bunch of curry leaves"
    ],
    "prep_time": null,
    "method": [
      "Cook pineapple with green chillies, ginger, salt and 1/2 cup water, till the pineapple is soft and mushy in texture. Take out the ginger at this stage.",
      "Grind the coconut and red chillies to a paste. Then add the crushed mustard seeds. Mix these with the cooked pineapple. Let it boil, then remove from the flame.",
      "Add beaten curd and mix well.",
      "Heat oil in a pan and splutter whole mustard seeds. Add red chillies and curry leaves. Pour this seasoning over the cooked pineapple. Mix well.",
      "Serve with appams and stew."
    ],
    "name": "Pineapple Pachadi"
  },
  {
    "cook_time": "25 Minutes + 4 days to ripen",
    "description": "Potli ka achaar is common in most Sindhi households. This recipe has been passed down for generations in my family. Goes perfect with some aloo ke tuk, Sindhi curry, papad and boiled rice.",
    "ingredients": [
      "5 kg raw mangoes (Ramkela variety)",
      "2 bulbs of garlic, peeled but whole",
      "1 Tbsp black kalongi/ onion seeds",
      "1 Tbsp (heaped) turmeric powder (haldi)",
      "1 Tbsp (heaped) red chilli powder",
      "1 Tbsp (heaped) salt",
      "1 cup mustard oil",
      "1/2 cup vinegar",
      "1 meter mulmul ka kapda/ muslin cloth cut into small squares of around 4x4 inches"
    ],
    "prep_time": null,
    "method": [
      "Grate the raw mangoes.",
      "Mix it well with salt, chillies, turmeric, kalongi, garlic and mustard oil.",
      "Cut the cloth into small squares.",
      "Put the achaar mix into it and tie it like a small potli. Make all the potlis like this.",
      "Put them in a nice clean jar and pour 1/2 cup vinegar over it.",
      "Keep it in indirect sunlight for 4-5 days and its ready to eat",
      "If you wish to preserve it for longer time then keep the jar in the fridge.",
      " Add the oil as it is, do not heat it or the color of the achaar would darken."
    ],
    "name": "Potli Ka Achaar"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Garma garam khaane ke saath thandi thandi chutney. This mooli ki chutney goes best with piping hot Kashmiri food.",
    "ingredients": [
      "1 radish (mooli), grated",
      "9-10 walnuts, chopped",
      "5 Tbsp hung curd (Hung curd is normal curd that has been removed of all the water content)",
      "1 green chilli, chopped finely",
      "1 tsp chopped coriander leaves",
      "Salt to taste"
    ],
    "prep_time": "2",
    "method": [
      "Grate the radish and squeeze it lightly to remove the excess water content.",
      "In a bowl mix all the ingredients together.",
      "Store it in the fridge. Serve the chutney chilled."
    ],
    "name": "Mooli Ki Chutney"
  },
  {
    "cook_time": "20 Minutes",
    "description": "A beautiful looking beetroot raita. With the crunch of cucumbers and onions, this pink colored raita is best served chilled with hot paranthas or pulao.",
    "ingredients": [
      "1 beetroot, boiled, peeled and pureed",
      "1/2 onion, chopped",
      "1/2 cucumber, chopped",
      "1 big bowl of ",
      " / curd",
      "Salt, to taste",
      "Coriander leaves, chopped"
    ],
    "prep_time": null,
    "method": [
      "In a blender add the curd and  beetroot puree. Mix. Strain in a bowl. Should be pink in color.",
      "Add the chopped onions, cucumbers and salt to the bowl. Mix.",
      "Garnish it with chopped coriander leaves."
    ],
    "name": "Beetroot Raita"
  },
  {
    "cook_time": "30 Minutes",
    "description": "A delectable pate with porcini, shitake and oyster mushrooms. Served with grilled pita bread or crackers. ",
    "ingredients": [
      "1 1/2 cups button mushrooms, sliced ",
      "3-4 Tbsp mushroom stock, from the re-hydrated mushrooms",
      "1 Tbsp of dried porcini mushrooms, re-hydrated in hot water",
      "1 Tbsp of dried shitake mushrooms, re-hydrated in hot water",
      "1 Tbsp of dried oyster mushrooms, re-hydrated in hot water",
      "3-4 Tbsp olive oil ",
      "1-2 Tbsp onion, finely chopped",
      "2 cloves of garlic, finely chopped ",
      "1/2 tsp cumin seeds ",
      "1/2 Tbsp of balsamic vinegar ",
      "A pinch of sea salt ",
      "A pinch of cracked black pepper ",
      "A pinch of white pepper",
      "2 Tbsp walnuts, toasted and skinned ",
      "1 Tbsp grain mustard ",
      "1-2 Tbsp Parmesan cheese, grated ",
      "1 1/2 tsp of rosemary, finely chopped ",
      "2 Tbsp of melted butter  "
    ],
    "prep_time": null,
    "method": [
      "In a pan, sweat the minced onions and garlic on a medium  flame in 1 tbsp of olive oil. ",
      "Add the sliced mushrooms and the hydrated mushrooms. Saute well. ",
      "Add the cumin seeds and a dash of the mushroom stock and fry for a few minutes till it is light brown and the juices have reduced.  ",
      "De-glaze with balsamic vinegar. ",
      "Season the mushrooms with salt, white and black pepper.",
      "Cook for another 2 to 3 minutes then set aside to cool. ",
      "In a food processor, add the walnuts, sauteed mushrooms, mustard, grated Parmesan cheese, rosemary, 2 tbsp of olive oil and melted butter and blend till it turns into a thick paste. ",
      "Garnish the pate with rosemary and a drizzle of olive oil. ",
      "Serve with crackers or grilled pita bread. "
    ],
    "name": "Mushroom Pate"
  },
  {
    "cook_time": "15 Minutes",
    "description": "A sour chutney with the goodness of amla, saunf and bhrami leaves.",
    "ingredients": [
      "1 Tbsp oil",
      "1 Tbsp ",
      "1 cup boiled ",
      "1 tsp ",
      "powder",
      "1 tsp red chilli powder",
      "1 Tbsp ",
      "1 tsp ",
      "leaves",
      "Salt to taste"
    ],
    "prep_time": "05  Minutes",
    "method": [
      "In a pan take some oil and add ",
      " in it.",
      "Add boiled pieces of ",
      ". Toss.",
      "Add ",
      " powder, red chilli powder and ",
      ". Cook for a minute. Now add",
      " and salt. Let it cool.",
      "Blend it in a mixer and serve."
    ],
    "name": "Amla Chutney"
  },
  {
    "cook_time": "30 Minutes (after preparation of vegetables)",
    "description": "Spice of winter. A spicy pickle of mixed vegetables, which is sweet and sour too. ",
    "ingredients": [
      "500 gm shalgam (turnips), scraped and sliced",
      "750 gm Gobi (cauliflower), cut into florets",
      "750 gm gajar (carrots), scraped and cut into pieces",
      "60 gm lassan (garlic), peeled, coarsely pounded ",
      "60 gm ginger, peeled and chopped, coarsely pounded ",
      "60 gm garam masala, powdered",
      "60 gm pissi rai (powdered mustard seeds) ",
      "20 gm chilli powder or to taste",
      "60 gm salt",
      "180 gm sirka (vinegar) ",
      "125 gm gur (jaggery) ",
      "250 gm sarson ka tel (mustard oil) "
    ],
    "prep_time": null,
    "method": [
      "Place the oil to heat in a large kadahi (or wok) and the vinegar and gur in a saucepan on another burner.",
      "Bring the vinegar to a boil and then simmer to dissolve the gur.",
      "When the oil is heated enough for a piece of vegetable thrown in to come up at once, keeping the heat on high, add the ginger and the garlic, and stir fry till a light brown.",
      "Add the shalgam, gobhi and gajar and continue stirring over high heat. This has to be stirred long enough to evaporate the water in the vegetables. ",
      "You will know it is done, when the liquid in the vegetables gets back the colour of the oil.",
      "Add the powdered spices and salt, mix well, again over high heat, and then add the vinegar solution. Let it come to a boil and shut off the heat. "
    ],
    "name": "Gobhi Shalgam ka Achaar"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Serve this yummy and easy to make peanut sauce with chicken satay.",
    "ingredients": [
      "3 Tbsp roasted peanuts with skin, crushed in a mortar and pestle",
      "1 cup coconut milk",
      "3/4 Tbsp palm sugar",
      "1 tsp red curry paste",
      "Salt, to taste"
    ],
    "prep_time": null,
    "method": [
      "Heat coconut milk.",
      "Add smashed peanuts and boil.",
      "Add palm sugar.",
      "Add curry paste and mix.",
      "Season with salt and taste.",
      "Sauce will thicken as it cools."
    ],
    "name": "Peanut Sauce"
  },
  {
    "cook_time": "20 Minutes",
    "description": "An easy to make yummy coriander ki chutney that goes best with kebabs and other Indian starters.",
    "ingredients": [
      "1 bunch fresh coriander, chopped",
      "10 cloves garlic",
      "3-4 green chillies, chopped",
      "Salt, to taste",
      "Juice of 2 lemons",
      "1/2 cup curd, whisked and sieved"
    ],
    "prep_time": "05  Minutes",
    "method": [
      "In a blender/ mixie add coriander leaves and blend till the leaves are crushed.",
      "Add garlic, chopped green chillies, salt and lemon. Blend till smooth. Add a little water in case the mixture is too thick.",
      "Put it in a bowl and mix with curd.",
      "Serve with some onion ringlets and kebabs."
    ],
    "name": "Dhaniye Ki Chutney"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Thousand Island Sauce is frequently used as a dressing for salads. It is made with mayonnaise, chilli powder and tomato ketchup. Egg and celery are added in this recipe to give some flavor.",
    "ingredients": [
      "1 cup mayonnaise sauce  ",
      "1 egg - full boiled  ",
      "1/4 cup tomato ketchup  ",
      "1/2 tsp chilli powder  ",
      "2 tbsp celery - chopped"
    ],
    "prep_time": null,
    "method": [
      "Place all the ingredients in the jar of a liquidizer and blend."
    ],
    "name": "Thousand Island Sauce"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Baba Ganoush is a Middle Eastern spread and dip similar to hummus but made with eggplant instead. Roasted eggplant, garlic and sesame seeds come together to make this delightful dip.",
    "ingredients": [
      "500 gm eggplant/aubergine  ",
      "1 Tbsp garlic - finely chopped  salt to taste  ",
      "2 Tbsp lemon juice   ",
      "1/4 cup onion - grated   ",
      "1/4 cup tomato - de-seeded and chopped fine  ",
      "1/4 tsp powdered black pepper   ",
      "2 Tbsp parsley or coriander",
      "2 Tbsp white sesame seeds",
      "Olive oil"
    ],
    "prep_time": null,
    "method": [
      "Cook the eggplant over a direct flame or under a grill till dark on the outside and cooked inside.  ",
      "Place in water and peel off the skin. ",
      "Chop fine or blend in a blender.  ",
      "Mix in the garlic, salt, lemon juice, onion, tomato, pepper, half each of the parsley, ",
      " and oil.  ",
      "Transfer to a serving dish, garnish with the rest of the parsley, til and oil."
    ],
    "name": "Baba Ganoush"
  },
  {
    "cook_time": "15 Minutes + Time to Set",
    "description": "Easy to make sour cream recipe. Sour cream can be used as a dip or as a spread for your toasts and bagels. ",
    "ingredients": [
      "2 cups cream",
      "2 Tbsp yogurt for starter"
    ],
    "prep_time": null,
    "method": [
      "Bring the cream to a boil.",
      "Transfer it into the container that you want to set the sour cream in.",
      "Let it cool to lukewarm, a drop of it on the wrist should feel neither warm nor cold.   In a small bowl, beat up the yogurt starter, till smooth.",
      "Add 2 tbsp of the cream to the yogurt, and mix well.",
      "Add this mixture to the rest of the cream and stir with a spoon to mix well.   Cover the container and place in a draught free place to set.",
      "Place it in the refrigerator for a couple of hours to set further."
    ],
    "name": "Sour Cream"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Tomatoes cooked with vinegar, salt, brown sugar and pepper.",
    "ingredients": [
      "3 Tbsp olive oil",
      "2 tomatoes, finely chopped",
      "1/4 tsp salt",
      "2 Tbsp vinegar",
      "1 red chilli, finely chopped",
      "2 tsp brown sugar"
    ],
    "prep_time": null,
    "method": [
      "Heat the oil in a frying pan on a medium to low heat and add the tomatoes, red chili, salt, vinegar and brown sugar.",
      "Give it a good mix and cook it for 5-10 minutes until the mixture reduces to a thick sauce."
    ],
    "name": "Tomato Relish"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Dip made with sour cream and onions. Served with cucumber sticks.",
    "ingredients": [
      "250 ml-soured cream",
      "1 onion, finely chopped",
      "3-4 garlic cloves, peeled and chopped",
      "1/4 tsp salt",
      "1/4 tsp pepper",
      "1 cucumber, peeled, de-seeded and sliced into long sticks"
    ],
    "prep_time": null,
    "method": [
      "Mix all the dip ingredients together to make a sour cream dip.",
      "Serve it with cucumber sticks.",
      "To be eaten with: ",
      " and "
    ],
    "name": "Sour Cream Dip"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Mint chutney with a twist of dal and coconut masala.",
    "ingredients": [
      "1 cup mint leaves, chopped",
      "1 small onion, chopped",
      "1 tsp garlic, crushed",
      "1 tsp ginger, sliced",
      "4-5 green chillies, chopped",
      "1 tsp coconut, shredded",
      "2-3 tsp lemon juice",
      "1 tsp cumin powder",
      "1 tsp urad dal",
      "1 tsp channa dal",
      "1 tsp olive oil",
      "Salt to taste"
    ],
    "prep_time": null,
    "method": [
      "Heat oil in a pan. Add onions, garlic, and ginger. Sauté till golden brown.",
      "Add green chillies, channa dal, urad dal, coconut. Cook till they are done. Set aside for 10 mins.",
      "In a food processor, grind mint leaves, lemon juice, cumin powder, cooked masala, salt and little water to a smooth paste."
    ],
    "name": "Coconut-Mint Chutney"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Spicy curd dip with roasted peanuts.",
    "ingredients": [
      "1 cup hung curd",
      "4 dry red chillies",
      "1/2 Tbsp coriander powder",
      "2 tsp fennel seeds",
      "1 tsp cumin seeds",
      "1/4 cup dry-roasted peanuts",
      "1 tsp minced garlic"
    ],
    "prep_time": null,
    "method": [
      "Take a pan, add cumin seeds, dry red chillies broken into two, fennel seeds, peanuts and roast for a while. When done, grind this into a masala in a food processor.",
      "Add minced garlic, coriander powder, ground peanut masala and stir. Add salt and pepper to taste.",
      "Set to chill for some time.",
      "Serve with blanched veggies (cucumber, beans, radish, carrot)."
    ],
    "name": "Spicy Dip"
  },
  {
    "cook_time": "25 Minutes",
    "description": "The tang of tomatoes beautifully spiced with mustard seeds, ginger, curry leaves and a pinch of sugar. You'll absolutely fall in love with its finger licking flavour!",
    "ingredients": [
      "10 tomatoes, chopped",
      "1/2 tsp mustard seeds",
      "1 tsp ginger, chopped",
      "2 garlic cloves, crushed",
      "1 tsp oil",
      "10-15 curry leaves",
      "1/2 tsp red chilli powder",
      "1 tsp vinegar",
      "1-2 tsp sugar",
      "Salt- to taste",
      "Pepper- to taste"
    ],
    "prep_time": null,
    "method": [
      "In a wok (kadhai) add oil. Add mustard seeds, curry leaves, ginger, garlic.",
      "Once cooked, add tomatoes. Let the tomatoes cook for 5 minutes.",
      "Now add sugar, salt, vinegar, red chilli powder and pepper.",
      "Cook this till the tomatoes are soft and squishy.",
      "Serve with idli, dosa and  vada."
    ],
    "name": "Tamatar ki Chutney"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Dip made with jalapenos, tomatoes and spring onions. Served with tortilla chips.",
    "ingredients": [
      "2 packets of tortilla chips",
      "3 tomatoes, diced & de-seeded",
      "2 cloves of garlic, finely chopped",
      "2 spring onions, finely chopped",
      "1 Tbsp jalapenos, finely chopped",
      "1-2 Tbsp of coriander leaves, finely chopped",
      "Salt & pepper to taste"
    ],
    "prep_time": null,
    "method": [
      "Grind or pound two tomatoes, the garlic and spring onions.",
      "Pour the mixture in a serving bowl with the remaining diced tomato.",
      "Add the salt & pepper, coriander and jalapenos.",
      "Mix well and serve with tortilla chips."
    ],
    "name": "Knight Rider Dip"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Chutney made from ambiya, mint and garlic.",
    "ingredients": [
      "1 raw mango (coarsely chopped)",
      "1 sprig of mint leaves",
      "4 green chillies",
      "4-5 cloves garlic",
      "1 tsp black salt",
      "1 piece ginger (coarsely chopped)",
      "2 tsp mango powder",
      "Salt for taste",
      "Water"
    ],
    "prep_time": null,
    "method": [
      "Blend all the ingredients to make a very fine paste.",
      "Refrigerate and serve cold."
    ],
    "name": "Mango Chutney with Mint"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Tangy and zesty! A savory accompaniment made with tomatoes and chillies.",
    "ingredients": [
      "1 onion, peeled and pierced with a fork",
      "6-7 cloves garlic",
      "4 tomatoes",
      "7 green chillies",
      "Salt",
      "Pepper",
      "Olive oil",
      "2-3 tinned chipotle chillies"
    ],
    "prep_time": null,
    "method": [
      "In a baking dish add onions, tomatoes, green chillies, garlic cloves, olive oil, pepper and salt.",
      "Bake for about 25-30 minutes at 180 degrees C.",
      "Blend it together with the chipotles.",
      "Serve with some crisp nachos."
    ],
    "name": "Roasted Tomato Chipotle Salsa"
  },
  {
    "cook_time": "20 Minutes + Overnight Soaking of Chickpeas",
    "description": "A middle eastern dip made with chickpeas, tahini and seasoned mildly. Usually served with pita bread and pickled vegetables.",
    "ingredients": [
      "2 cups of chick peas",
      "1 Tbsp chopped garlic",
      "1 Tbsp coriander",
      "1 tsp of tahini (sesame paste)",
      "3 tsp of lime juice",
      "2 Tbsp of olive oil",
      "Salt and pepper to taste",
      "Coriander leaves and olive oil, for garnish"
    ],
    "prep_time": null,
    "method": [
      "Soak the chick peas overnight, boil them and drain the water.",
      "Blend all the ingredients together into a thick paste.",
      "If required, add some of the drained chickpea water when blending.",
      "Pour in a serving bowl. Garnish and serve with pita bread."
    ],
    "name": "Hummus with Coriander"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Baked beans combined with spring onions and jalapenos. Served with tortilla chips.",
    "ingredients": [
      "2 packets of tortilla chips",
      "1 can of baked beans",
      "2 spring onion stems (greens), finely chopped",
      "1 Tbsp jalapenos, finely chopped",
      "2-3 Tbsp lime juice",
      "Salt & pepper to taste"
    ],
    "prep_time": null,
    "method": [
      "Pour the baked beans into a serving bowl.",
      "Add the spring onions, jalapenos and lime juice.",
      "Season with salt and pepper.",
      "Mix well and serve with tortilla chips."
    ],
    "name": "Daredevil Dip"
  },
  {
    "cook_time": "25 Minutes",
    "description": "Tangy and tantalizing mango chutney can be remarkably versatile, use it as a spread on sandwitches or with rice/chappatis or simply dip your snacks into it!",
    "ingredients": [
      "3 Tbsp groundnut or vegetable oil",
      "1 large ripe mango, peeled and roughly chopped ½ tsp chili powder",
      "2 Tbsp sugar",
      "1/2 tsp salt",
      "1 Tbsp malt vinegar",
      "2.5cm/1in piece root ginger, peeled and grated"
    ],
    "prep_time": null,
    "method": [
      "Heat the oil in a heavy-based pan over a low heat. ",
      "Add the mango, ginger, chili powder, sugar, salt, vinegar and ginger and cook, stirring occasionally, for 15 minutes, or until the mango is soft.",
      "Remove the pan from the heat and leave the chutney to cool completely.",
      "Transfer the cool chutney to an airtight container and refrigerate for up to 2 weeks."
    ],
    "name": "Mango Chutney"
  },
  {
    "cook_time": "10 Minutes",
    "description": "A sweet and tangy chutney with guavas, lemon, chillies and ginger.",
    "ingredients": [
      "250 gm guavas-chopped fine ",
      "1/2 tsp salt or to taste ",
      "1 Tbsp lemon juice ",
      "2 Tbsp green chillies-chopped ",
      "1 Tbsp ginger-chopped ",
      "1 tsp chilli powder ",
      "2 Tbsp chopped coriander leaves"
    ],
    "prep_time": null,
    "method": [
      "Blend all the ingredients to a paste and serve."
    ],
    "name": "Guava Chutney"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Lemony and garlicky Tahini sauce. The perfect accompaniment.",
    "ingredients": [
      "8 Tbsp tahini sauce",
      "4 cloves of garlic (chopped)",
      "1/2 cup water ",
      "Juice of 1 lemon ",
      "Salt to taste"
    ],
    "prep_time": null,
    "method": [
      "In a bowl add tahini paste, garlic, salt water and blend.",
      " Add lemon juice and blend it into a tahini sauce.",
      "Serve with ",
      ", ",
      " and ",
      "."
    ],
    "name": "Garlicky Tahini Sauce"
  },
  {
    "cook_time": "15 Minutes",
    "description": "A yummy walnut sauce with sesame and garlic. Too hard to resist!",
    "ingredients": [
      "100 gm roasted walnuts",
      "1 Tbsp garlic paste",
      "1 Tbsp chopped parsley",
      "15 ml sesame seed oil",
      "15 ml groundnut oil",
      "2 tsp lemon juice",
      "Roasted sesame seeds to garnish"
    ],
    "prep_time": null,
    "method": [
      "To prepare walnut sauce, grind walnuts, garlic and herbs together.",
      "Gradually pour in oils.",
      "Sharpen with lemon juice.",
      "Season well and serve with grilled vegetables."
    ],
    "name": "Walnut Sauce"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Spicy Chinese sauce that goes well with both fried rice and noodles.",
    "ingredients": [
      "1/4 cup sesame oil",
      "3-4 whole red peppers  ",
      "3/4 onions-chopped fine  ",
      "1 Tbsp garlic",
      "1 Tbsp ginger ",
      "1/2 tsp chilli powder",
      "2 Tbsp corn flour mixed in a cup of water  ",
      "1 Tbsp vinegar  ",
      "1 tsp soya sauce ",
      "1 tsp chilli sauce  ",
      "1 tsp salt"
    ],
    "prep_time": "05  Minutes",
    "method": [
      "Grind together the onions, garlic and ginger. ",
      "Heat the oil in a wok add the whole red peppers and saute over high heat till they darken a bit. ",
      "Add the onions, garlic and ginger and stir-fry over high heat till glossy. ",
      "Add the corn flour mixture and bring to a boil.   ",
      "Lower the heat and add the chilli powder, vinegar, soya sauce, chilli sauce and salt and mix well.  ",
      "Cook till well blended (1/2 minute) and use."
    ],
    "name": "Schezwan Sauce"
  },
  {
    "cook_time": "25 Minutes",
    "description": "We love to gorge on this tangy red onions in restaurants why not make them at home and stock up? ",
    "ingredients": [
      "250 gm small onion ",
      "1 cup vinegar ",
      "1 tsp sugar ",
      "1 tsp salt"
    ],
    "prep_time": null,
    "method": [
      "Peel the onions, wash and leave them in a colander to drain.  ",
      "Place the vinegar in a saucepan over high heat and bring to boil.  ",
      "Add the salt, sugar and the onions, and when the vinegar comes to a boil once again, shut off the heat.  ",
      "Store in a sterilized, airtight jar."
    ],
    "name": "Sirkewala Pyaaz "
  },
  {
    "cook_time": "20 Minutes",
    "description": "Serve it as a sandwich spread or use it as a dip, this easy carrot and cashew coleslaw recipe will please you every time.",
    "ingredients": [
      "1 large grated carrot ",
      "1 finely chopped onion  ",
      "2 chopped celery sticks  ",
      "250 gm grapes  ",
      "250 gm ",
      " - peeled and stoned  ",
      "1/2 cabbage - shredded  ",
      "1 Tbsp chopped parsley ",
      "4 Tbsp sesame oil ",
      "1/2 tsp poppy seeds ",
      "1/4 tsp yellow mustard seeds ",
      "1 Tbsp vinegar  ",
      "1 Tbsp apple juice ",
      "Salt and pepper ",
      "50 gm roasted cashew nuts  chopped ",
      "Herbs to garnish"
    ],
    "prep_time": "05  Minutes",
    "method": [
      "Combine fruit and vegetables. ",
      "Stir in parsley.   Heat oil. ",
      "Add poppy and mustard seeds. Cool.   ",
      "Add vinegar and apple juice to oil.   Mix and pour over coleslaw.   ",
      "Garnish with nuts and herbs.   Serve cold."
    ],
    "name": "Carrot and Cashew Coleslaw"
  },
  {
    "cook_time": "35 Minutes",
    "description": "Figs poached in delicate syrup of sugar and orange juice, and spiked with cinnamon and rum. The perfect sauce for desserts!",
    "ingredients": [
      "150 gm grain sugar  ",
      "300 ml water ",
      "2 cinnamon sticks  ",
      "4 cloves nutmeg ",
      "Pared rind of 2 oranges  ",
      "100 ml rum  ",
      "50 ml orange juice",
      "250 gm whole dried figs ",
      "25 gm blanched, shredded browned nuts"
    ],
    "prep_time": null,
    "method": [
      "Place the sugar, water, spice, and rind into a saucepan. ",
      "Dissolve the sugar in the water and boil for 5 minutes. ",
      "Add the figs and rum to the pan.   ",
      "Cover and allow the figs to simmer for 20 - 30 minutes, or until soft. ",
      "Cool. ",
      "Add the juice. ",
      "Chill well and serve scattered with nuts."
    ],
    "name": "Fig Compote"
  },
  {
    "cook_time": "5 minutes, plus fermentation time",
    "description": "Add some tang to your meals with this pickled cabbage recipe. It's perfect to add to your burgers and sandwiches.",
    "ingredients": [
      "1/2 kg cabbage     ",
      "225 ml vinegar     ",
      "100 gm sugar     ",
      "1 Tbsp salt     ",
      "2 Tbsp oil     ",
      "1 Tbsp chopped garlic cloves",
      "300 gm mushrooms ",
      "100 gm spring onions - cut into 1\" lengths     ",
      "1 1/2 tsp sugar     salt and pepper"
    ],
    "prep_time": null,
    "method": [
      "ut cabbage into 2\" square pieces. Allow it to wilt for 24 hours.  ",
      "Boil vinegar with sugar and salt for 3 minutes. Cool. Pour over the cabbage. ",
      "Seal in a jar and set aside for 3 days.     ",
      "Heat oil, fry garlic until golden. ",
      "Add remaining ingredients and pickled cabbage.   ",
      "Stir fry for 1 minute and serve."
    ],
    "name": "Pickled Cabbage"
  },
  {
    "cook_time": "20 Minutes",
    "description": "A sumptuous and easy to make filling for tacos or tortillas.",
    "ingredients": [
      "2 Tbsp oil  ",
      "1 cup onion - chopped  ",
      "2/3 cup red kidney beans - cooked  ",
      "1 tsp coriander powder  ",
      "1 tsp chilli powder  salt ",
      "1 tsp cumin powder  ",
      "1 tsp dried oregano"
    ],
    "prep_time": null,
    "method": [
      "Heat the oil and add the onions and brown lightly.   ",
      "Add the beans, coriander, chilli powder, salt, cumin and oregano and stir-fry.   ",
      "Add about 1 cup water and cook till beans are very tender. ",
      "Take them off the heat and mash with a fork."
    ],
    "name": "Beans for Tortillas/Tacos"
  },
  {
    "cook_time": "30 Minutes",
    "description": "This beautiful looking black currant chutney with raisins is a delight to eat.",
    "ingredients": [
      "100 gm dried black currants",
      "50 gm raisins",
      "20 gm ",
      "cinnamon powder",
      "5 gm cardamom powder",
      "5 gm ginger powder",
      "20 gm fennel powder",
      "Salt to taste"
    ],
    "prep_time": null,
    "method": [
      "Blend all ingredients together with sufficient water to bring it to the correct consistency."
    ],
    "name": "Zerish (Black Currant Chutney)"
  },
  {
    "cook_time": "15 Minutes",
    "description": "The sweetness of dried apricots mingles with the tang of lemon juice and chillies in this Apricot Relish Recipe.",
    "ingredients": [
      "300 gm dried apricots, chopped",
      "6 Tbsp fresh lemon juice",
      "2 red chillies, chopped",
      "2 Tbsp brown sugar",
      "2 Tbsp coriander seeds, crushed",
      "1/4 tsp salt"
    ],
    "prep_time": null,
    "method": [
      "Mix all the ingredients together or grind in a food processor.  ",
      "Cover and chill."
    ],
    "name": "Apricot Relish"
  },
  {
    "cook_time": "5 Minutes",
    "description": "An easy cheesy spread that you can use with breads, bruschetta or as a dip.",
    "ingredients": [
      "1/4 cup cream cheese",
      "1/4 cup Parmesan cheese",
      "7-8 olives, sliced",
      "1-2 tsp olive oil",
      "Salt and pepper"
    ],
    "prep_time": null,
    "method": [
      "Put all ingredients in a blender, give it a good mix and your dip is ready."
    ],
    "name": "Parmesan Cheese Spread"
  },
  {
    "cook_time": "10 Minutes",
    "description": "A nice and tangy side dish that can be relished with rice.",
    "ingredients": [
      "1/2 cup of mangoes (raw) cut into small pieces\n",
      "1 cup grated coconut  ",
      "4 Smoked red chillies (roasted on direct fire)\n",
      "1 tsp cumin seeds ",
      "Salt to taste\n",
      "Coconut oil"
    ],
    "prep_time": null,
    "method": [
      "Grind all the ingredients except oil to a coarse paste. ",
      "While grinding mangoes should be added last.   ",
      "Add coconut oil and can be used as side dish for rice."
    ],
    "name": "Mango-coconut chutney"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Imagine a mayonnaise without a drop of oil! Without any eggs. Totally vegan. Made with tofu.\n",
    "ingredients": [
      "1 package (firm) silken tofu (12.3 ounce package)",
      "1/2 cup cashew paste",
      "1 tsp lemon juice",
      "1 tsp mustard powder",
      "Sea salt, to taste",
      "Black pepper, to taste",
      "1 tsp sugar",
      "1/4 tsp wasabi paste",
      "1 tsp olive oil",
      "2 tsp garlic",
      "1/4 cup baby corn",
      "1/4 cup mushrooms",
      "1/4 cup red peppers",
      "1/4 cup yellow peppers",
      "3-4 cherry tomatoes",
      "Thyme, a few sprigs",
      "4-5 basil leaves, to garnish"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Drain water from tofu and place it in the blender with cashew paste, lemon juice, mustard powder, salt and pepper.",
      "Blend at highest speed until light and creamy.",
      "Now add sugar and wasabi paste.",
      "Blend again and keep aside.",
      "You can serve it with some crackers or apply in sandwiches.",
      "Take a pan and in a little olive oil, saute garlic, mushrooms, babycorn, bell peppers till they get translucent. Add a few sprigs of thyme.",
      "Once done, mix the mayonnaise into this potpourri.",
      "You can serve this with crackers or pour it into ready made tart cases.",
      "Garnish with cherry tomatoes and basil leaves."
    ],
    "name": "Tofu and Cashew Mayonnaise"
  },
  {
    "cook_time": "10 Minutes",
    "description": "A zingy coconut chutney with tamarind, ginger and chillies.",
    "ingredients": [
      "1 cup grated coconut ",
      "2 inch piece ginger skinned and washed",
      "3 green chillies",
      "Tamarind  size of a small lemon\n",
      "Salt to taste",
      "1 tsp coconut oil "
    ],
    "prep_time": null,
    "method": [
      "Grind all the ingredients except oil to a coarse paste. ",
      "Add coconut oil and can be used as side dish for rice."
    ],
    "name": "Coconut-Ginger Chutney "
  },
  {
    "cook_time": "15 Minutes",
    "description": "A tangy side dish to go with Falafels. Yogurt whisked with green apples, plums, pomegranate seeds and orange juice.",
    "ingredients": [
      "1/2 a green apple, thinly sliced    ",
      "2-3 plums, diced ",
      "1 Tbsp of rose water",
      "100 gm hung yoghurt",
      "A pinch of cardamom powder",
      "Salt and pepper to taste",
      "Juice of 1/2 an orange",
      "30 gm pomegranate"
    ],
    "prep_time": null,
    "method": [
      "Add the hung yogurt to a large mixing bowl.",
      "Slice the green apples into thin slivers and dice the plums and add to the bowl.",
      "Add the pomegranate seeds, rose water, orange juice, cardamom powder, salt and mix well."
    ],
    "name": "Plum and Green Apple Yogurt"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Made out of creamy yogurt, eggplant, olive oil, herbs and seasoning, burnt eggplant dip can be served with chips, lavache or breadsticks.",
    "ingredients": [
      "1 eggplant roasted, peeled and sliced",
      "1 Tbsp olive oil",
      "1 clove of garlic",
      "1 Tbsp tahini / sesame paste",
      "2 Tbsp yoghurt",
      "1 big pinch roasted cumin powder ",
      "1 small pinch cinnamon powder",
      "Few mint leaves ",
      "Juice of 1 lemon",
      "1/2 tsp grated lemon zest",
      "1 small bunch coriander leaves"
    ],
    "prep_time": null,
    "method": [
      "In a mixer put the sliced eggplant, yoghurt, mint, garlic, cumin, cinnamon, tahini paste, lime juice and lemon zest and olive oil give it a nice blend.",
      "Check the consistency and you can add some more olive oil and yogurt. ",
      "Blend to a smooth paste.",
      "Serve with chips, lavash or breadsticks."
    ],
    "name": "Burnt Eggplant Dip"
  },
  {
    "cook_time": "10  Minutes",
    "description": "A fresh accompaniment without which the an Indian meal seems incomplete! \n",
    "ingredients": [
      "1/2 onion chopped",
      "    ",
      "1/2 cucumber chopped",
      "    ",
      "Salt to flavor",
      "    ",
      "A bowl of curd",
      "    ",
      "1/2 tsp red chilli powder",
      "    ",
      "1 lemon",
      "    ",
      "Handful coriander leaves chopped"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Take the curd and add onion, cucumber and lemon juice.",
      "And season it with salt, red chilli powder and coriander leaves.",
      "Mix it all."
    ],
    "name": "Kheere ka Raita"
  },
  {
    "cook_time": "10 Minutes",
    "description": "The most popular dip from Middle East can now be made at home. ",
    "ingredients": [
      "1 cup chickpeas",
      "Salt to season",
      "2 1/2 Tbsp olive oil",
      "2 cloves garlic",
      "Juice of 2 lemons",
      "2 1/2 Tbsp tahini paste (sesame paste)",
      "Sumac powder for garnish"
    ],
    "prep_time": null,
    "method": [
      "In a blender add the chickpeas, olive oil, garlic, lime juice, tahini paste and salt. ",
      "Give it a good blend till it reaches a good thick velvety consistency.",
      "Garnish with a sprinkle of sumac powder."
    ],
    "name": "Vicky's Hummus"
  },
  {
    "cook_time": "25 Minutes",
    "description": "Zesty bell pepper chutney that can be paired with a range of dishes. ",
    "ingredients": [
      "1/2 chopped red bell pepper",
      "1 tsp light olive oil",
      "1 chopped peach",
      "1 clove",
      "1 big pinch fennel seeds",
      "1 tsp cumin seeds",
      "Few black peppercorns",
      "1/2 cinnamon stick",
      "1 star anise",
      "1/2 a dried red chilly",
      "1/2 chopped onion",
      "1/2 tsp minced ginger",
      "Juice of 1/2 an orange",
      "1 big pinch orange zest",
      "1 Tbsp jaggery",
      "1 Tbsp rice wine vinegar",
      "Salt and pepper to taste",
      "6 mint leaves",
      "1/2 cup chopped coriander leaves"
    ],
    "prep_time": null,
    "method": [
      "In a big pan, add a little olive oil and fry a clove, fennel seeds, black peppercorns, cinnamon stick, cumin powder, star anise, black peppercorns and ½ a dried red chilli.",
      "Add the chopped onions, minced ginger, bell peppers and the peach along with a big pinch of orange zest.",
      "Add the jaggery and rice wine vinegar.",
      "Reduce till the vinegar has reduced. ",
      "Cook for 10 minutes until the onions and peppers are soft but not mushy. ",
      "Add the juice of half an orange.",
      "Season to taste with salt and pepper.",
      "Add chopped mint and coriander leaves."
    ],
    "name": "Peach and Bell Pepper Chutney"
  },
  {
    "cook_time": "35 Minutes",
    "description": "Classic salsa recipe with juicy tomatoes and a smoky onion flavour. ",
    "ingredients": [
      "4 moderately ripe tomatoes, chopped",
      "6 -8 sprigs of coriander, finely chopped",
      "1/2 onion, charred and chopped",
      "2 green chillies, finely chopped",
      "Juice of 1/2 a lemon",
      "Salt",
      "Ground black pepper"
    ],
    "prep_time": null,
    "method": [
      "Char the onions on a gasflame. After the skin blisters, let it rest for 15 minutes and then peel.",
      "Mix all the ingredients and let them sit for 10 minutes before serving. ",
      ":",
      "Place the onions or garlic on a very hot griddle and turn them around till all the skin is blistered and black. Then leave them to cool (some prefer to keep them in a plastic bag) and then peel. It gives a lovely smoky flavour and a juicy texture to the onions."
    ],
    "name": "Tomato Salsa"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Subhalaxmi Khan, a professional dancer prepares tangy pickle made from olives, spices and honey. This one is an Assamese delicacy.  Most people think olives are from Spain but they also grow wild in the interiors of Assam and are therefore used extensively in their cuisine.",
    "ingredients": [
      "4-5 Tbsp mustard oil",
      "1 bowl of crushed olives",
      "50 gms gur",
      "Salt to taste",
      "2 tsp of paanch phoron",
      "1 tsp chilli powder",
      "2 tsp roasted jeera",
      "2 Tbsp honey"
    ],
    "prep_time": null,
    "method": [
      "Heat some mustard oil into the pan.",
      "Add gur and mix it well on medium heat",
      "Add olive and mix. ",
      "Then add salt, paanch phoron, chilli powder, roasted jeera and cook for a few minutes",
      "Finsh it off by adding some honey."
    ],
    "name": "Olive Gur Chutney"
  },
  {
    "cook_time": "5 Minutes",
    "description": "Made with jalapenos, tabasco, capsicums and creamy yoghurt. This Mexican dip goes with a range of finger foods. ",
    "ingredients": [
      "2 cans of yogurt, hung",
      "2 Tbsp of jalapenos, shredded",
      "Few dashes of Tabasco",
      "1/2  green capsicum, grated",
      "1/2  red capsicum, grated",
      "1/2  yellow capsicum, grated",
      "Rock salt"
    ],
    "prep_time": null,
    "method": [
      "Mix all the ingredients to make a dip. ",
      "Use as substitute for sour cream with ",
      " and "
    ],
    "name": "Mexican Yogurt Dip"
  },
  {
    "cook_time": "25 Minutes",
    "description": "Radish, cabbage, pears and bell peppers tossed and coated with a freshly made tangy dressing.",
    "ingredients": [
      "1/2 radish",
      "1 pear, sliced",
      "1/3 cabbage",
      "10 gm green bell pepper, sliced",
      "10 gm yellow bell pepper, sliced",
      "Juice of one lemon",
      "1 Tbsp sweet chilli sauce",
      "1 Tbsp rice vinegar",
      "1 tsp ginger",
      "2-3 mint leaves",
      "Pinch of salt and pepper",
      "1 Tbsp egg less mayonnaise",
      "One and a half tsp vegetable oil",
      "1 Tbsp chopped chives",
      "1 Tbsp chopped parsley",
      "Pepper to season"
    ],
    "prep_time": null,
    "method": [
      "Slice the radish and shred the cabbage into fine strips, put in a bowl of water with lemon juice, to avoid discoloration.",
      "Slice the pear and the bell peppers and put it in the same bowl.",
      "In another bowl make a dressing with sweet chili sauce, rice wine vinegar, ginger, mint leaves, egg less mayonnaise and vegetable oil and whisk together.",
      "Drain out the water from the vegetables and pat dry.",
      "Add these vegetables to the dressing and mix well.",
      "Once all the vegetables are coated in the dressing your slaw is ready."
    ],
    "name": "Radish Slaw"
  },
  {
    "cook_time": "10 Minutes",
    "description": "An innovative and tangy dip made with pomegranates, tamarind and crushed rose petals. ",
    "ingredients": [
      "1 1/2 cup fresh pomegranate",
      "2 green chillies-slit and deseeded",
      "1 tsp powdered sugar",
      "1 tsp crushed rose petals",
      "2 tsp tamarind pulp",
      "1 tsp ",
      "Poppy seeds powder, to garnish"
    ],
    "prep_time": null,
    "method": [
      "Grind all the ingredients together.",
      "Garnish with poppy seeds powder and serve."
    ],
    "name": "Pomegranate Chutney"
  },
  {
    "cook_time": "20 Minutes",
    "description": "A zesty red bell pepper salsa served with pickled vegetables and a dry melba toast. Perfect start to your brunch party.",
    "ingredients": [
      "4-6 Tbsp oil",
      "50 gm chopped red bell peppers, ground",
      "1 Tbsp sweet chilli sauce",
      "3-4 Tbsp lemon juice",
      "1 Tbsp grated jaggery",
      "Assorted vegetables",
      "Melba toast (Melba toast is a dry, crisp and thinly sliced toast)"
    ],
    "prep_time": null,
    "method": [
      "Heat oil. Add bell pepper paste and chilli sauce. Simmer for 15 minutes with the lid on.",
      "Remove lid and continue cooking the capsicum until the oil separates. Cool.",
      "Blend paste in a food processor. Sharpen with lemon juice and sprinkle in sugar to taste.",
      "Serve with the accompaniments.",
      ":",
      "Cut the crusts off fresh slices of bread.",
      "Roll them out thin and fine with a rolling pin.",
      "Slice them down and brown in a moderate oven until crisp.",
      "Serve with the dip and assorted pickled vegetables."
    ],
    "name": "Red Capsicum Salsa with Melba Toast"
  },
  {
    "cook_time": "20 Minutes",
    "description": "An interesting zucchini chutney with neem leaves. ",
    "ingredients": [
      "3/4 cup diced zucchini",
      "2 tsp chopped ginger",
      "2 green chillies-slit and deseeded",
      "4 to 5 fresh curry leaves",
      "2 to 3 ",
      " leaves",
      "1/2 tsp dry ginger powder",
      "3 tsp powdered sugar",
      "Salt to taste",
      "Oil to shallow fry"
    ],
    "prep_time": null,
    "method": [
      "Heat oil in a pan.",
      "Add all the ingredients and saute.",
      "Cool and grind.",
      "Serve."
    ],
    "name": "Zucchini Chutney"
  },
  {
    "cook_time": "24 Hours",
    "description": "Cabbage soaked in the flavors of garlic, ginger, soya sauce, vinegar and chilli flakes. Here's for you Kimchi Salad recipe, a Korean favorite. ",
    "ingredients": [
      "1 kg cabbage ",
      "1 Tbsp salt ",
      "2 Tbsp spring onions-chopped fine ",
      "1 Tbsp garlic-chopped fine ",
      "1 Tbsp ginger-chopped fine ",
      "1 cup soya sauce ",
      "1 1/2 tsp sugar ",
      "1 cup white vinegar ",
      "1 Tbsp chilli flakes ",
      "Sesame (",
      ") oil"
    ],
    "prep_time": "15",
    "method": [
      "Chop cabbage, place in a glass or steel bowl and sprinkle salt over it, and mix well. ",
      "Leave thus for 3-4 hours, till a little wilted. ",
      "Squeeze a few times till cabbage has softened.   ",
      "Mix in the rest of the ingredients except the oil and transfer into sterilized jars. ",
      "Seal and leave for 24 hours, before using.   ",
      "To serve garnish with some sesame oil."
    ],
    "name": "Kimchi "
  },
  {
    "cook_time": "10 Minutes",
    "description": "Yoghurt, coriander and chillies make a delicious dip in a jiffy.",
    "ingredients": [
      "3 cups hung curd  ",
      "1 tsp salt or to taste  ",
      "1/8 tsp powdered black pepper  ",
      "1 Tbsp chopped coriander leaves  ",
      "Chopped green chilles to taste"
    ],
    "prep_time": null,
    "method": [
      "Mix all the ingredients together. ",
      "Using this base you can add or change the spices and seasonings according to taste."
    ],
    "name": "Curd Dip"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Chutney made from bhaang seeds, mint leaves and green chillies.",
    "ingredients": [
      "50 gm ",
      "2 green chillies",
      "3 Tbsp lemon juice",
      "2 Tbsp mint leaves-chopped",
      "3 Tbsp water",
      "1/2 tsp salt"
    ],
    "prep_time": null,
    "method": [
      "Roast the bhang seeds and then grind them in a mixie.",
      "Add the green chillies, lemon juice, mint leaves, water and salt and grind to a paste in a mixie.",
      "The ",
      " is ready."
    ],
    "name": "Bhaang ki Chutney"
  },
  {
    "cook_time": "20 Minutes + Soaking time(overnight)",
    "description": "This Middle Eastern staple can be an appetizer or an accompaniment to a main course of grilled chicken.",
    "ingredients": [
      "1 cup chick peas (",
      ") ",
      "6-7 cloves garlic   ",
      "6-7 tsp lemon juice   ",
      "3-4 tsp sesame seeds - roasted   ",
      "5-6 tsp olive oil   ",
      "Salt - to taste   ",
      "Ground pepper   - a pinch",
      "Paprika -  a pinch"
    ],
    "prep_time": null,
    "method": [
      "Soak the chick peas overnight and boil with little salt. ",
      "Drain and keep some liquid for ",
      "blending.",
      "Add all the ingredients in a mixie except the paprika and blend to form a smooth paste, adding olive oil gradually.    ",
      "Garnish with some more olive oil and paprika. ",
      "Serve with pita bread and sauteed vegetables."
    ],
    "name": "Hummus "
  },
  {
    "cook_time": "10 Minutes",
    "description": "The sweet yet savoury flavour of the raita gives an unexpected twist to the main course.",
    "ingredients": [
      "2 cups chopped pineapple  ",
      "2 cups yogurt  ",
      "2 tsp salt  ",
      "1/4 tsp powdered black pepper  ",
      "2 tsp roasted and powdered cumin seeds   ",
      "1/4 tsp powdered red pepper  ",
      "2 Tbsp chopped coriander leaves."
    ],
    "prep_time": null,
    "method": [
      "Beat the yogurt till smooth.    ",
      "Add the salt, black pepper, 1 tsp of the cumin seed powder, 1 tbsp coriander leaves and mix well.    ",
      "Squeeze out the pineapple, in case there is excess liquid and add to the yogurt mixture.    ",
      "Transfer on to a serving bowl and garnish with the rest of the cumin powder, red pepper and coriander leaves, and serve chilled."
    ],
    "name": "Pineapple Raita"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Guaranteed to start any party instantly!",
    "ingredients": [
      "3 red peppers   ",
      "3 tsp lemon juice   ",
      "2 Tbsp fresh parsley   ",
      "1 Tbsp olive oil   ",
      "Salt - to taste  ",
      "Carrots ",
      "Cucumbers ",
      "Radishes"
    ],
    "prep_time": null,
    "method": [
      "First, cut and de-seed the red peppers.    ",
      "Bake them in the oven on a low temperature for 20-25 minutes and remove the skin.    ",
      "Then grind all the ingredients together to make the dip.    ",
      "Serve with carrots, cucumber and radishes or any other crudites."
    ],
    "name": "Pepper Dip with Crudites"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Easy to make Apple Sauce recipe. The apple sauce can be used in desserts or as an accompaniment to roast meat.",
    "ingredients": [
      "1 kg apples - peeled, cored, sliced   ",
      "1 cup water  ",
      "1 Tbsp lemon juice  ",
      "1/4 cup sugar  ",
      "1 tsp ground cinnamon (",
      ")"
    ],
    "prep_time": null,
    "method": [
      "Put peeled and chopped apples in a heavy-bottomed saucepan, with the water.    ",
      "Cover and cook over low heat till some of the juices are drawn, and the bottom becomes liquidy.     ",
      "Remove lid and let any excess liquid dry up, taking care not to let the apples burn.     ",
      "Mash them a bit to make them pulpy. ",
      "Apples can also be stewed in a pressure cooker. ",
      "Add the sugar and cinnamon and cook a little more."
    ],
    "name": "Apple Sauce "
  },
  {
    "cook_time": "15 Minutes",
    "description": "Beaten curd bulked up with pieces of boiled potato and flavoured with cumin seeds, pepper and coriander leaves.",
    "ingredients": [
      "2 cups potatoes - boiled peeled and diced ",
      "2 cups yogurt  ",
      "2 tsp salt  ",
      "1/4 tsp black pepper powder  ",
      "2 tsp cumin seeds - roasted and powdered  ",
      "1/4 tsp red pepper powder  ",
      "2 Tbsp coriander leaves - chopped"
    ],
    "prep_time": null,
    "method": [
      "Beat the yogurt till smooth. ",
      "Add salt, black pepper powder, cumin seed powder, coriander leaves and mix well with the potatoes.    ",
      "Transfer onto a serving bowl and garnish with the rest of the cumin powder, red pepper and coriander leaves.    ",
      "Serve the Aloo ka Raita chilled."
    ],
    "name": "Aloo ka Raita"
  },
  {
    "cook_time": "2 Hours 30 Minutes",
    "description": "Green chillies with mustard oil, tamarind and spices will add a kick to the simplest Indian meal.",
    "ingredients": [
      "1 kg green chillies - chopped   ",
      "1 cup salt   ",
      "1/2 kg mustard oil   ",
      "1 Tbsp red chilli powder   ",
      "1 Tbsp turmeric powder  ",
      "200 gm ginger - finely ground   ",
      "250 gm garlic - finely ground   ",
      "100 gm cumin seeds - roasted and ground   ",
      "200 gm large mustard seeds - roasted and ground   ",
      "1 cup sugar   ",
      "200 gm ",
      " (tamarind)  ",
      "3 cups of white vinegar"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Marinate the chillies in salt for at least two hours.    ",
      "Soak the ",
      " in the vinegar for at least two hours and extract the pulp.    ",
      "In a large vessel heat the mustard oil and add red chilli powder and turmeric powder.    ",
      "Add the ginger and garlic and mix well. ",
      "Continue stirring for some time.     ",
      "Mix in the cumin powder and mustard powder.    ",
      "Pour the imli-vinegar pulp and mix well.      ",
      "Add sugar and cook on low heat for some time.    ",
      "Now add the chillies and cook for 10-15 minutes on low heat till the oil separates.    Serve."
    ],
    "name": "Green Chilli Pickle "
  },
  {
    "cook_time": "10 Minutes",
    "description": "An easy to make onion relish that will liven up any meal.",
    "ingredients": [
      "3 cups onions - roughly chopped  ",
      "2-3 whole red chillies",
      "2 Tbsp vinegar - soaked together  ",
      "1 tsp salt  ",
      "1 Tbsp garlic - chopped"
    ],
    "prep_time": null,
    "method": [
      "Blend all ingredients together into a paste and serve."
    ],
    "name": "Onion Chutney"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Pickled chicken pieces add flavour to a simple meal of rice and dal.",
    "ingredients": [
      "2 kg chicken - cut into 16 pieces each ",
      "60 gm garlic - peeled, coarsely pounded  ",
      "60 gm ginger - peeled and chopped, coarsely pounded  ",
      "60 gm ",
      " powder  ",
      "60 gm mustard seeds powdered  ",
      "1 cup chilli powder  ",
      "1/3 cup salt  ",
      "3/4 cup vinegar ",
      "1 cup mustard oil"
    ],
    "prep_time": null,
    "method": [
      "Heat oil in a ",
      " and add the ginger and the garlic and stir fry till they turn light brown in colour.  ",
      "Add the chicken and continue stirring over high heat till chicken pieces are opaque. ",
      "Lower the heat to medium and let cook, till tender. ",
      "When the chicken is tender, increase the heat and cook over high heat till the oil separates.   ",
      "Add the powdered spices and salt, mix well, again over high heat, and then add the vinegar. ",
      "Let it come to a boil and switch off the heat."
    ],
    "name": "Murgh ka Achaar "
  },
  {
    "cook_time": "5 Hours 30 Minutes",
    "description": "Leave these lentil bites to dry after shaping them and store them for additional crunch and flavor to any vegetable dish.",
    "ingredients": [
      "6 cups (1 kg) split Green Gram (",
      ") - soaked overnight ",
      "1 1/2 tsp "
    ],
    "prep_time": null,
    "method": [
      "Rub the ",
      " and wash off the skin. ",
      "Grind it to a fine paste on a grinding stone or a food processor. ",
      "Leave to rest, covered for 4-5 hours.  ",
      "Soak the ",
      " in a little water to dissolve. ",
      "Beat the ground lentils till fluffy, and add the ",
      " to it.  ",
      "Make the ",
      " drop equivalent to about 1 Tbsp of batter on to the cloth till all the batter is used.  ",
      "These have to be left to dry out in the sun. When the top seems quite dry, try to pullout a ",
      ". If it comes clean off the cloth, turn the cloth over, so that the bottom is exposed for drying.  ",
      "When dry, pull all the ",
      " off the cloth, pack them in polythene bags, seal and store."
    ],
    "name": "Mangauri or Moong Dal Badi"
  },
  {
    "cook_time": "35 Minutes",
    "description": "Chili red pepper sauce, serves as the perfect accompaniment for a host of dishes.",
    "ingredients": [
      "Red peppers ",
      "1 Tbsp almond- blanched   ",
      "2 cloves of garlic  ",
      "1/2 tsp red chilli paste    ",
      "1 1/2 Tbsp olive oil",
      "Pinch of salt   ",
      "Pinch of pepper    "
    ],
    "prep_time": null,
    "method": [
      "Roast red bell peppers on a grill (toss the red bell peppers in olive oil and salt) grill until charred  put in a bowl and cover with cling film. ",
      "Let them wrinkle, then peel, deseed and slice.",
      "Season with some salt and pepper.",
      "In a blender, add all the ingredients and blend while pouring the olive oil in a steady stream to emulsify to a thick rich sauce."
    ],
    "name": "Hot Romesco"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Sweet and spicy relish of pineapple, vinegar and cinnamon.",
    "ingredients": [
      "1/2 cup vinegar",
      "1/2 cup sugar",
      "150 gm pineapple, finely diced",
      "1 tsp ginger",
      "1/2 tsp garlic (Optional)",
      "Juice of half lime",
      "2 kafir lime leaves",
      "1 stalk lemon grass",
      "1 cinnamon stick",
      "1 star anise",
      "2-3 peppercorns",
      "1 tsp chopped coriander, to garnish",
      "2 tsp chopped spring onions, to garnish"
    ],
    "prep_time": null,
    "method": [
      "In a pan mix together vinegar and sugar. Let it reduce.",
      "Add lemongrass, star anise, cinnamon, kafir lime leaves, lime juice, peppercorns, garlic, ginger and mix well.",
      "Once the mixture starts to thicken add the pineapple pieces. Cook for 1 more minute.",
      "Finish with the chopped spring onions and chopped coriander.",
      "Serve with ",
      "."
    ],
    "name": "Pineapple Chutney "
  },
  {
    "cook_time": "30 minutes",
    "description": "A Southern chutney of gongura leaves, tamarind, onion and spices.",
    "ingredients": [
      "2 cups ",
      " leaves ",
      "1 tsp tamarind juice ",
      "1 tsp salt  ",
      "1/4 tsp sugar  ",
      "1 tsp oil ",
      "12 small onions - peeled ",
      "1/2 cup onion - chopped fine ",
      "20 dry red chillies   ",
      ":",
      "20 red chillies ",
      "1 tsp ",
      " - whole ",
      "2 Tbsp ",
      "1 Tbsp ",
      "1/2 Tbsp "
    ],
    "prep_time": null,
    "method": [
      "Wash ",
      " leaves, fry in a pan with little oil. Close the pan with a lid, cook for a while. ",
      "Add the tamarind juice. Using a pestle, pound the cooked leaves.  ",
      "Add salt, 1/4 Tbsp sugar, all powdered ingredients till every thing blends well.  ",
      "Season with mustard and add onions.  ",
      "Mix with 1 cup of boiled water. Serve"
    ],
    "name": "Gongura Pachadi "
  },
  {
    "cook_time": "20 Minutes",
    "description": "Easy to make mint sauce goes well with roast or baked meat.",
    "ingredients": [
      "1/2 cup vinegar ",
      "1/2 cup finely chopped mint leaves ",
      "1 Tbsp sugar ",
      "1/2 tsp salt"
    ],
    "prep_time": null,
    "method": [
      "Heat the vinegar and sugar in a saucepan over low heat, stirring all the time. ",
      "Heat till the sugar is dissolved, then bring it to a boil and add the mint leaves and immediately shut off the heat and add the salt.  ",
      "Your mint sauce is ready. This sauce keeps well if you pack it in a sterilised, screw top bottle while it is still quite hot."
    ],
    "name": "Mint Sauce"
  },
  {
    "cook_time": "1 Hour 30 Minutes",
    "description": "Spicy sauce that will add punch to snack time.",
    "ingredients": [
      ":",
      "1 kg green chillies - washed and chopped   ",
      "2 cups White vinegar (450 ml)  ",
      "250 gm salt  ",
      "2 Tbsp oil  ",
      "1 tsp sodium benzoate - dissolved in 2 Tbsp of boiled water"
    ],
    "prep_time": "10",
    "method": [
      "Dissolve the salt in the vinegar and marinate the green chillies in it for 1 hour at least.    ",
      "Heat the mixture and bring to a boil. ",
      "Cook over high heat till it thickens a bit.     ",
      "Take it off the heat and mix in the sodium benzoate mixture.    ",
      "Store in an airtight clean bottle."
    ],
    "name": "Green Chilli Sauce"
  },
  {
    "cook_time": "40 Minutes",
    "description": "The usage flexibility of this sauce makes it a keeper in your kitchen. ",
    "ingredients": [
      "1 kg tomatoes-chopped roughly ",
      "2 tsp chopped garlic ",
      "2 Tbsp sugar ",
      "2 tsp salt or to taste ",
      "1 tsp ",
      "1 Tbsp chilli powder ",
      "1/4 cup vinegar ",
      "1/4 tsp sodium benzoate-mixed with water ",
      "Boiled water"
    ],
    "prep_time": null,
    "method": [
      "Cook the tomatoes and garlic together till soft.  ",
      "Strain through a soup strainer, or blend in a blender and then pass through a sieve.   ",
      "Put it back over high heat, add sugar, salt, ",
      ", chilli powder and vinegar and cook till thick. ",
      "The mixture begins to spurt only in the centre, when ready.   ",
      "Take off the heat; add the sodium benzoate solution (a preservative) and store in airtight sterilised jars."
    ],
    "name": "Hot and Sour Sauce"
  },
  {
    "cook_time": "10 Minutes",
    "description": "Mexico's all time favorite creamy avocado dip.",
    "ingredients": [
      "1 avocado",
      "1 tomato",
      "1/2 onion",
      "1 green chilli",
      "A small bunch of coriander, chopped",
      "1 Tbsp olive oil",
      "Salt (to taste)",
      "Juice of 2 limes"
    ],
    "prep_time": null,
    "method": [
      "Lightly mash the avocado.",
      "Add the chopped tomatoes, onions, green chilli and chopped coriander.",
      "Add salt and lime juice.",
      "Mix and serve."
    ],
    "name": "Guacamole "
  },
  {
    "cook_time": "5 Minutes",
    "description": "Asian black bean sauce is full of flavour and uses black beans, peanuts and rice wine. ",
    "ingredients": [
      "2 Tbsp peanut oil ",
      "2 Tbsp fermented black beans - rinsed and drained ",
      "1 tbsp garlic - minced ",
      "1/2 chicken broth ",
      "1 Tbsp soy sauce ",
      "2 Tbsp rice wine ",
      "1 tsp sugar ",
      "1 1/2 tsp cornstarch"
    ],
    "prep_time": null,
    "method": [
      "Heat a wok or heavy skillet over medium-high heat. ",
      "Add the oil, the black beans and garlic. Stir-fry about 12 seconds.   ",
      "Add the rest of the ingredients and stir-fry about 1 minute or until sauce thickens.  ",
      "Makes about 3/4 cup sauce."
    ],
    "name": "Asian Black Bean Sauce"
  },
  {
    "cook_time": "10 Minutes",
    "description": "The ideal Thai paste which can be stored up to three months. ",
    "ingredients": [
      "10 green chillies - chopped  ",
      "6 cloves garlic - peeled   ",
      "1 onion - chopped   ",
      "3/4 piece of ginger - peeled   ",
      "1 cup coriander leaves - chopped   ",
      "Rind of 1 lemon - grated   ",
      "Juice of 1/2 lemon   ",
      "1 Tbsp coriander powder  ",
      "2 Tbsp cumin powder  ",
      "2 stalks lemon grass   ",
      "1 tsp salt or to taste  ",
      "1/2 tsp pepper powder"
    ],
    "prep_time": null,
    "method": [
      "Grind all the ingredients in a mortar or a food processor using a little water. ",
      "Store in an airtight container or in the refrigerator. ",
      "Alternatively, freeze for up to three months. Use as required."
    ],
    "name": "Thai Green Curry Paste "
  },
  {
    "cook_time": "5 Minutes ",
    "description": "Tomato based zingy goodness.",
    "ingredients": [
      "4 tomatoes - peeled, seeded and chopped   ",
      "1 Tbsp tomato ketchup   ",
      "1 tsp soya sauce  ",
      "1 tsp sesame oil ",
      "1/2 tsp roasted sesame seeds  ",
      "1 Tbsp chopped spring onions   ",
      "1 tsp chopped garlic  ",
      "1 Tbsp vinegar  ",
      "1 Tbsp chopped coriander"
    ],
    "prep_time": null,
    "method": [
      "To prepare the sauce, combine all ingredients and serve.  ",
      "Tip: It goes well with chicken in lettuce parcels."
    ],
    "name": "Oriental Sauce "
  },
  {
    "cook_time": "5 Minutes",
    "description": "Tingly, zesty and fresh. ",
    "ingredients": [
      "4-5 red chillies - seeded and chopped   ",
      "1 chopped onion   ",
      "1 1/2 tsp garlic paste   ",
      "3/4 tsp ginger paste   ",
      "2 Tbsp sugar   ",
      "1/4 tsp salt   ",
      "3 Tbsp vinegar"
    ],
    "prep_time": null,
    "method": [
      "Combine all the ingredients together. It goes well with noodles."
    ],
    "name": "Sweet and Sour Ginger Dip"
  },
  {
    "cook_time": "10 Minutes",
    "description": "The all important momo side kick.",
    "ingredients": [
      "100 gm garlic - peeled ",
      "25 gm dried whole red chillies - cut up and soaked in some vinegar ",
      "1/2 cup oil ",
      "Salt to taste"
    ],
    "prep_time": null,
    "method": [
      "Grind all the ingredients together to a smooth paste."
    ],
    "name": "Chilli Sauce for Momos"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Straightforward and effortless, hot garlic sauce can be used extensively for a wide range of delicacies.",
    "ingredients": [
      "2 Tbsp oil ",
      "1/2 cup onions-chopped fine ",
      "3 tbsp garlic-chopped fine ",
      "3 whole red peppers  ",
      "2 Tbsp cornflour ",
      "1/2 cup water ",
      "blend the water and cornflour together ",
      "1 1/2 tsp salt  ",
      "1/2 cup vinegar ",
      "1 tsp soya sauce ",
      "1 Tbsp sugar"
    ],
    "prep_time": null,
    "method": [
      "Grind onions, garlic & red pepper together.  ",
      "Mix together, the cornflour, water, vinegar, soya sauce and sugar, and keep aside.   ",
      "Heat oil in a wok and add the onion mixture, stir over high heat till fat separates.  ",
      "Add the cornflour mixture and stir over low heat till cooked (becomes translucent and a little darker)"
    ],
    "name": "Hot Garlic Sauce"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Great to pair with a variety of dishes for a subtle enhancement.",
    "ingredients": [
      "1 Tbsp sesame oil  ",
      "3 Tbsp spring onions cut into 1\"lengths  ",
      "2 chopped garlic  ",
      "1 dried red chilli  ",
      "1 capsicum  ",
      "3 Tbsp vinegar  ",
      "2 tbsp sugar  ",
      "2 Tbsp tomato ketchup  ",
      "1 Tbsp soya sauce  ",
      "250 ml chicken stock  ",
      "2 tsp corn flour dissolved in 1 tbsp water  ",
      "3 Tbsp chunked pineapple  ",
      "3 Tbsp peeled, grated cucumber"
    ],
    "prep_time": null,
    "method": [
      "Heat sesame oil. Stir-fry spring onions, garlic and chilli for 1 minute.  ",
      "Add capsicum and cook for 1/2 a minute.   Stir in vinegar, sugar, sauces and stock. ",
      "Season and thicken with a little corn flour. Cook for 2 minutes.   ",
      "Add pineapple to the sauce.   Serve garnished with grated cucumber."
    ],
    "name": "Sweet and Sour Sauce"
  },
  {
    "cook_time": null,
    "description": "Peanut butter, chicken stock and coconut cream lend their distinctive flavours to this sauce.",
    "ingredients": [
      "4 Tbsp sweet chilli sauce ",
      "3 Tbsp peanut butter     ",
      "250 ml chicken stock     ",
      "60 ml coconut cream     ",
      "1 Tbsp lemon juice     ",
      "2 Tbsp chopped coriander"
    ],
    "prep_time": "15 Minutes",
    "method": [
      "Combine the ingredients in a pan. Bring to a simmer while whisking until thickened. Stir in coriander. ",
      "Season and serve."
    ],
    "name": "Satay Sauce"
  },
  {
    "cook_time": "25 Minutes",
    "description": "Cucumber slices are stirred in a syrupy paste of black peppercorns, fennel seeds and chili, sprinkled with a mixture of crunchy peanut crumble. ",
    "ingredients": [
      "1/2 malabar cucumber",
      "1/2 a cup peanuts (freshly toasted)",
      "1 Tbsp oil",
      "2 Tbsp brown sugar",
      "2 Tbsp white wine vinegar",
      "1/2 Tbsp chilli paste",
      "Pinch of salt",
      "1 cinnamon stick",
      "2-3 black peppercorns",
      "1 pinch jeera (cumin) seeds",
      "1/2 tsp fennel seeds",
      "Juice of 1/2 a lime",
      "1/2 tsp lime zest",
      "2 green chilies",
      "1 bunch coriander leaves"
    ],
    "prep_time": null,
    "method": [
      "In a pan add equal parts of sugar and vinegar. ",
      "Add the black peppercorns, fennel seeds and chili paste.",
      "Add fresh lime juice and lime zest to this brine.",
      "Heat & stir until it begins to look syrupy.",
      "Slice the cucumber into thin slices. ",
      "Add the sliced cucumber into the pan with the brine.",
      "Transfer into a bowl & cool. ",
      "In a blender add green chillies, coriander leaves, salt, freshly toasted peanuts and blitz until it resembles bread crumbs.",
      "Garnish the pickled cucumber with this peanut crumble and fresh coriander."
    ],
    "name": "Malabar Cucumber Relish with Peanuts"
  },
  {
    "cook_time": "2 Hours",
    "description": "Gajar ka murabba is carrots preserved in a sugar syrup. Consumed commonly during winters.",
    "ingredients": [
      "1/2 kg carrots",
      "1/2 kg sugar",
      "1/2 cup of water"
    ],
    "prep_time": null,
    "method": [
      "Clean and de-core the carrots. Steam the carrots.   After the first steam, cook it on low flame for about 5 minutes. Remove from fire.",
      "Spread sugar on the carrots. Cover the pan and keep aside for 1 hour. Now boil the carrots and the sugar syrup.   After the first boil, reduce flame and cook for about 10 minutes.",
      "To preserve it for a longer period cook the syrup till it turns thick.",
      " is ready to eat. Serve with fresh cream."
    ],
    "name": "Gajar Ka Murraba"
  },
  {
    "cook_time": "10 Minutes",
    "description": "An unusual chutney made with curry leaves, onions and tamarind pulp.",
    "ingredients": [
      "1 tsp mustard seeds",
      "2 tsp curry leaves",
      "1/4 cup chopped onions",
      "2 tsp crushed garlic",
      "1 tsp chopped green chillies",
      "2 tsp tamarind pulp",
      "1 tsp powdered sugar"
    ],
    "prep_time": null,
    "method": [
      "Grind the ingredients to a fine paste and serve."
    ],
    "name": "Curry Leaves Chutney"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Classic pesto recipe with basil, pine nuts, garlic, cheese and olive oil. The refreshing flavour can turn around any dish. ",
    "ingredients": [
      "3 bunches of small-leafed basil",
      "1 clove garlic (or more, according to taste)",
      "1 Tbsp pine nuts",
      "1 Tbsp freshly grated Pecorino cheese",
      "1 tbsp freshly grated Parmesan cheese",
      "5 bsp extra-virgin olive oil",
      "A pinch of salt"
    ],
    "prep_time": null,
    "method": [
      "Wash the basil and dry it carefully with a paper towel.",
      "Remove the stalks and start to crush in the mortar along with the garlic, pine nuts and salt.",
      "Once you get a thick paste gradually grind in the cheese.",
      "Finally whisk in the oil until you have reached your desired consistency"
    ],
    "name": "Pesto Sauce"
  },
  {
    "cook_time": "30 Minutes",
    "description": "A crisp side for your meals -  papads made with rice. Rice papads are usually prepared and served during the festival of Holi.",
    "ingredients": [
      "250 gm rice ",
      "1/2 tsp asafoetida (heeng)",
      "2 small lime ",
      "Raw salt to taste",
      "4 Tbsp oil"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Take about a litre of water and bring it to a boil. ",
      "Now add the rice and cook for five minutes.",
      "Drain water from rice completely. Pour this hot rice on absorbent towels.  Spread and let dry. ",
      "Heat a tablespoon of oil in a thick skillet. Add a fistful of rice at a time to this hot oil and stir continuously.",
      "The rice will starts to puff up. When all the rice starts to puff, remove from skillet onto a tray.",
      "Repeat. Let this rice cool and then make into a very fine powder. ",
      "Sift once or twice to see that it is very fine uniformly. ",
      "Mix the asafoetida, lime juice and salt in 1/4 cup of water.  Pass through a strainer so that only the liquid is retained. ",
      "Make a well in the center of the rice flour and pour the liquid and mix well. ",
      "Now, oil your palms and knead for about half an hour.  Use up all the oil. ",
      "Divide the dough into super sized olives and roll into thin papads.",
      "Dry in the sun and store. Deep fry in hot oil, to serve."
    ],
    "name": "Rice Papads"
  },
  {
    "cook_time": "25 Minutes",
    "description": "Here is a simple recipe of pachadi with raw mangoes and jaggery. Tempered with red chillies and mustard seeds.",
    "ingredients": [
      "2 raw mangoes",
      "2 green chillies",
      "3-4 Tbsp grated jaggery",
      "Salt to taste",
      "1 Tbsp oil",
      "2 dry red chillies",
      "1/2 tsp mustard seeds",
      ":",
      "4 Tbsp garlic cloves",
      "200 gm roasted peanuts - skinned and removed",
      "6-8 fresh red chillies",
      "100 ml oil",
      "Salt"
    ],
    "prep_time": null,
    "method": [
      "Peel and slice mangoes with seeds.",
      "Split green chillies in half.",
      "Pour over water to cover fruit and chillies.",
      "Simmer till well cooked.",
      "Add jaggery to pan.",
      "Heat oil in a pan - toss in dry red chillies and mustard  seeds.",
      "Pour over ",
      " and serve.",
      ":",
      "Grind everything together, gradually adding oil."
    ],
    "name": "Mango Pachadi"
  },
  {
    "cook_time": "3-4 Days",
    "description": "Not loved by all, but this achaar of karelas loaded with spices might just do the trick.",
    "ingredients": [
      "1 kg ",
      " (bitter gourd) of a uniform size ",
      "2 Tbsp salt ",
      ":",
      "3/4 cup salt ",
      "1 Tbsp ",
      " (turmeric) ",
      "1 Tbsp ",
      " (dried and powdered ginger) ",
      "1/4 cup chilli powder ",
      "1/4 cup roasted and powdered ",
      " (carrom / thymol)",
      "2 Tbsp ",
      "(fennel seeds) roasted and pounded coarsely ",
      "2 cups lemon juice ",
      "A sterilised jar"
    ],
    "prep_time": null,
    "method": [
      "Scrape off the rough surface of the bitter gourd, slit lengthwise on one side, rub all over with salt and keep aside for 3-4 hours.  ",
      "Squeeze the ",
      "to get rid of the discarded juices, scoop out the seeds and wash and squeeze again. ",
      "Mix a little bit of the lemon juice into the ",
      " to dampen it, then stuff the filling firmly into the ",
      " and tie each one to secure the filling.   ",
      "Place the filled ",
      " neatly into the sterilized jar and pour enough lemon juice to cover.  ",
      "Sun for 3-4 days and eat after a week.",
      "Once ready, you could cut and serve small pieces."
    ],
    "name": "Karele ka Achaar "
  },
  {
    "cook_time": "3 days",
    "description": "A recipe from the safe haven of homeliness, Himachal Pradesh. Chef Mansingh of Woodville Palace Hotel shows how to make a crisp Himachali style papad. ",
    "ingredients": [
      "2 Tbsp refined flour",
      "1/2 tsp salt",
      "Water",
      "Oil to fry"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Add the salt and water to the refined flour and mix to a thick consistency.",
      "Pour a large ladle of the mixture onto a steel plate and spread it out evenly. Steam the plate so that the dough can come off easily.",
      "Remove the dough when dry and keep it on a clean cloth in the sun for 3 days.",
      "Deep fry the shakuli in refined oil and serve with any meal."
    ],
    "name": "Shakuli (Himachali Papad)"
  },
  {
    "cook_time": "40 Minutes",
    "description": "Chutney made with variety of lentils, roasted dhania, cumin seeds, chillies, onions and curry leaves. A perfect accompaniment that will give your bland meals a new twist!",
    "ingredients": [
      "2 Tbsp arhar daal(pigeon pea)-roasted ",
      "2 Tbsp urad daal-roasted ",
      "2 Tbsp channa daal-roasted ",
      "2 Tbsp moong dhuli daal-roasted ",
      "2 Tbsp sabut dhania-roasted ",
      "2 tsp cumin seeds ",
      "2-3 sabut lal mirch ",
      "1/4 tsp heeng ",
      "1 imli-seeds removed ",
      "1 tsp salt or to taste ",
      "1 Tbsp oil ",
      "1 tsp sarson ",
      "1/2 cup onions-chopped fine ",
      "10-12 curry leaves-for tempering"
    ],
    "prep_time": "15-20 Minutes",
    "method": [
      "Grind the roasted ingredients and imli together, with the help of water as required. ",
      "Mix in the salt. ",
      "Heat the oil, add the sarson, onions and kadhi patta. ",
      "Saute till onions are brown, and mix into the chutney. ",
      ": You can mix in some yogurt if you so desire."
    ],
    "name": "Dal ki Chutney "
  },
  {
    "cook_time": "Overnight",
    "description": "Delicate and aromatic. This rose syrup recipe is perfect to add in your desserts.",
    "ingredients": [
      "1 cup red rose petals - tightly packed",
      "3 cups water",
      "4 cups sugar"
    ],
    "prep_time": null,
    "method": [
      "In a wide and deep pan, put the rose petals and cover with water. Leave this overnight.",
      "Add sugar to the rose petal and water mixture and stir over low heat, till sugar is dissolved.",
      "When dissolved, increase the heat and let it come to a boil and cook till thickened--one thread consistency. That is take a drop of the mixture and press between your thumb and forefinger, a thread should form when you separate the fingers.",
      "Strain through a muslin cloth and store in a clean, airtight bottle."
    ],
    "name": "Rose Syrup"
  },
  {
    "cook_time": "20 Minutes",
    "description": "A decadent chocolate icing for your cakes.",
    "ingredients": [
      "1 1/2 cups icing sugar",
      "1/2 cup butter",
      "1/2 cup cocoa powder",
      "1 tsp vanilla",
      "Milk as required (approx. 1/2 cup)"
    ],
    "prep_time": null,
    "method": [
      "Mix the icing sugar, butter and vanilla in a bowl and beat together to cream it, adding milk when required for smooth movement. ",
      "Continue to add milk till a spreading consistency is reached. ",
      "Spread over the cake."
    ],
    "name": "Chocolate Icing"
  },
  {
    "cook_time": "20 Minutes",
    "description": "The basic recipe for most North Indian gravies, tamatar pyaaz ka masala.",
    "ingredients": [
      "2 cups chopped onions",
      "1 tsp chopped cloves of garlic",
      "1 tsp chopped ginger",
      "1/2 cup tomato-grated OR  1/4 cup puree",
      "1/4 cup oil",
      "2 tsp ",
      "cumin seeds",
      "2 ",
      "bay leaves",
      "1/2 tsp ",
      "turmeric",
      "1 tbsp salt or to taste",
      "1/2 tsp ",
      "1/2 tsp powdered red pepper",
      "1 Tbsp powdered coriander seeds"
    ],
    "prep_time": null,
    "method": [
      "Grind onions, garlic and ginger to a paste. ",
      "Heat oil and add cumin seeds and bay leaves.",
      "When the seeds begin to splutter, add the onion paste and saute till brown and fat separates.",
      "Add tomatoes or puree, turmeric, salt, ",
      ", red pepper and the coriander powder, and stir fry till the fat separates."
    ],
    "name": "Tamatar Pyaaz ka Masala"
  },
  {
    "cook_time": "15 minutes",
    "description": "Spicy and garlicky, this chutney is absolutely lip smacking.",
    "ingredients": [
      "100 gm garlic-peeled",
      "25 gm dried whole red chillies-cut up and soaked in some vinegar",
      "Salt to taste"
    ],
    "prep_time": null,
    "method": [
      "Grind all the ingredients together to a smooth paste, avoiding, water."
    ],
    "name": "Garlic Chutney"
  },
  {
    "cook_time": "1 Hour",
    "description": "Smother your toasted bread with some homemade mixed fruit jam.",
    "ingredients": [
      "1 kg mixed fruit-peeled and chopped",
      "1 kg sugar",
      "1/4 cup lemon juice or to taste"
    ],
    "prep_time": null,
    "method": [
      "Put the fruit in a steel or glass container, cover with water and keep overnight.",
      "Transfer to a heavy based sauce pan, bring to a boil and cook till soft.",
      "Strain through a soup strainer or blend and strain.",
      "Put back onto the stove and bring to a boil again and cook, stirring to avoid scorching.",
      "When slightly thinner than jam consistency, add the sugar and lemon juice.",
      "Lower the heat and keep stirring till sugar is dissolved (not letting it coming to a boil before that).   When sugar is dissolved, bring to a boil and cook, stirring all the time (else it will caramelise at the bottom and change flavor).",
      "When a drop placed over a cold surface sets, the jam is ready.",
      "Store in sterilized airtight jars."
    ],
    "name": "Mixed Fruit Jam"
  },
  {
    "cook_time": "30 Minutes",
    "description": "A nice and tangy side-dish made with mangoes, peppercorns, bay leaf, asafoetida  and cloves. Savour it with rice or spread it over sandwiches/rotis or simply use it as a dip for snacks, this will come handy in most of your dishes. ",
    "ingredients": [
      "1 kg raw mangoes-peeled and grated ",
      "4 cups sugar ",
      "3/4 cup salt ",
      "1/4 cup chilli powder ",
      "1 Tbsp peppercorns powder ",
      "2 bay leaves ",
      "1 tsp asafoetida ",
      "1 Tbsp cloves",
      "An airtight sterilised jar "
    ],
    "prep_time": "7-8 Minutes",
    "method": [
      "In a steel or a glass bowl, mix in the grated mango and sugar. ",
      "Tie with a piece of muslin and keep in the sun, stirring twice a day for about 4 days. ",
      "Mix in the salt, chilli powder, peppercorns and powdered garam masala and continue sunning till the sugar dissolves. ",
      "Transfer into a sterilized jar and store."
    ],
    "name": "Aam ki Chutney"
  },
  {
    "cook_time": "Overnight",
    "description": "A tasty homemade strawberry jam without any preservatives. Spreads smoothly on your toast, this jam is worth trying.",
    "ingredients": [
      "2 kg firm but ripe strawberries",
      "1 1/2 kg sugar",
      "1/4 cup lemon juice",
      "1 tsp butter"
    ],
    "prep_time": null,
    "method": [
      "Wash the strawberries and hull them. Leave them for water to drain out completely.",
      " In a stainless steel sauce pan layer the strawberries in the pan and sprinkle them with the sugar as you go.",
      "Leave thus overnight, (for sugar to draw out the juices, firm the fruit and they will stay more whole in the jam).",
      "When you make the jam place the pan over low heat to melt the rest of the sugar, (do not let it come to a boil till sugar is dissolved) shake the pan now and then, don't stir too much.",
      "When the sugar is dissolved add the lemon juice and turn up the heat, when the jam bubbles start timing, begin with 8 minutes and then remove from the heat.",
      "Spoon a little jam on a plate, let cool, then push with your finger, if you get a crinkly skin it is set.   If not, boil it up again for another 3-5 minutes and do the test again, if necessary do more repeats.",
      "When ready remove from the heat, stir in the butter to dissolve the scum and let the jam settle for 15 to 20 minutes.",
      "Pour the jam in dry clean jars, which are heated in the oven for 5 minutes (325F) Cover with waxed discs and seal with lids or cellophane."
    ],
    "name": "Strawberry Jam"
  },
  {
    "cook_time": "1 Hour",
    "description": "Oranges and lemons, fresh on the table. A delicious citrus marmalade to perk up your breakfast.",
    "ingredients": [
      "750 gm oranges",
      "100 gm lemons",
      "1 1/2 liter water",
      "1 1/2 kg sugar",
      "1 tsp butter"
    ],
    "prep_time": null,
    "method": [
      "Squeeze the juice of the oranges and lemons. Cook the juice along with water over a moderate flame.",
      "Remove membrane, pips and pith from the fruit and tie securely inside a muslin bag.",
      "Shred peel into strips and add to the juice along with the muslin bag.",
      "Cook juice until the liquid has evaporated by 1/3.   Add sugar and dissolve. Boil rapidly until setting point is reached.",
      "Drop in butter and skim out any impurities from the surface.",
      "Store in a cool and dry jar.",
      " The pips tied in the bag, help produce pectin so you do not need to add any."
    ],
    "name": "Orange Marmalade"
  },
  {
    "cook_time": "25 Minutes",
    "description": "A sweet, sticky and sensual syrup bursting with the addictive aroma of cinnamon.",
    "ingredients": [
      "3 cups water ",
      "4 cups sugar ",
      "1 tsp powdered cinnamon"
    ],
    "prep_time": null,
    "method": [
      "Mix sugar and water and stir over low heat, till sugar is dissolved.   ",
      "When dissolved, add the cinnamon and increase the heat and let it come to a boil and cook till thickened (one thread consistency).     ",
      "That is take a drop of the mixture and press between your thumb and forefinger, a thread should form when you separate the fingers.   ",
      "Strain through a muslin cloth and store in a clean, airtight bottle."
    ],
    "name": "Cinnamon Syrup"
  },
  {
    "cook_time": "15 Minutes + 48 Hours (to stand)",
    "description": "The classic pungent tasting mustard sauce, now made at home.",
    "ingredients": [
      "2 Tbsp yellow mustard seeds",
      "2 Tbsp black mustard seeds",
      "1/8  tsp cinnamon - broken",
      "1 Tbsp honey",
      "1 tsp salt  ",
      "Vinegar - to cover the above ingredients"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Place yellow mustard, mustard, honey, cinnamon and salt in a glass or stainless steel vessel and cover with vinegar to come up about 1/2\" above the mixture.",
      "Leave it for 48 hours.   Blend to a fine paste and use."
    ],
    "name": "Mustard Sauce"
  },
  {
    "cook_time": "20 Minutes",
    "description": "A tangy mixture used in the preparation of the popular South Indian Sambhar.",
    "ingredients": [
      "2 cups whole red pepper ",
      "1 1/2 cups coriander seeds (",
      ") ",
      "2 Tbsp mustard seeds (",
      ") ",
      "3 Tbsp cumin seeds (",
      ") ",
      "4 tsp pepper corns (",
      ") ",
      "2 Tbsp fenugreek seeds (",
      ") ",
      "2 Tbsp husked split black gram (",
      ") ",
      "2 Tbsp bengal gram (",
      ") ",
      "2 Tbsp yellow lentils (",
      ")",
      "2 Tbsp rice ",
      "2 Tbsp asafoetida (",
      ") ",
      "2 Tbsp turmeric powder (",
      ") ",
      "1/4 cup dried curry leaves (",
      ")"
    ],
    "prep_time": "05  Minutes",
    "method": [
      "Roast all the ingredients, except the turmeric powder, till very slightly colored. ",
      "Remove from the heat and cool, and grind to a powder and mix in the turmeric powder.   ",
      "Store this ",
      " in an airtight jar."
    ],
    "name": "Sambar Masala"
  },
  {
    "cook_time": "40 Minutes",
    "description": "A chewy, fudgy, sticky treat made with fresh guavas. Guava cheese is a popular Goan delicacy. It has a long shelf life.",
    "ingredients": [
      "1 kg guava ",
      "2 Tbsp lemon juice ",
      "Sugar (depends on the proportion of pulp as mentioned in the recipe)"
    ],
    "prep_time": "20",
    "method": [
      "Cut ends of guavas, cut into 4 and slice off the seeds. ",
      "Cut into small pieces (with skin on).   ",
      "Place chopped guava in a pan and add water to cover. ",
      "Cook until soft and strain through a cloth, squeezing and keeping the pulp for the cheese.",
      "Make jam with the pulp, using proportion of 4 cups pulp to 3 cups sugar and 2 Tbsp lemon juice.   Weigh the pulp and mix with equal weight of sugar and 2 Tbsp. lemon juice.   ",
      "Cook the mixture over medium heat, stirring to avoid scorching, till it leaves the sides of the pan and forms a ball.   ",
      "Spread on to a greased plate to set. Cut into squares and store in an airtight jar.",
      "Guava cheese can be eaten simply as a dessert or with sandwiches, toasts, etc."
    ],
    "name": "Guava Cheese"
  },
  {
    "cook_time": "30 minutes",
    "description": "This decadent chocolate cream smothered over a cake or tarts can change the whole flavor.",
    "ingredients": [
      "450 ml milk",
      "6 egg yolks",
      "100 gm castor sugar",
      "50 gm flour",
      "150 gm chopped chocolate",
      "100 ml whipped cream"
    ],
    "prep_time": null,
    "method": [
      "For chocolate cream scald milk.",
      "Beat in yolks and sugar together for five minutes.",
      "Stir in flour.     Pour on hot milk.",
      "Return to pan, stirring continuously.",
      "Stir in chocolate and allow it to melt.",
      "Cool. Fold in whipped cream."
    ],
    "name": "Chocolate Cream"
  },
  {
    "cook_time": "20 minutes",
    "description": "Its an easy recipe to make your ordinary tasting cake extra ordinary. This butter icing slathered on your cake is a treat.",
    "ingredients": [
      "1 1/4 cups icing sugar",
      "1/2 cup butter",
      "1/2 cup powdered milk",
      "1 tsp vanilla",
      "milk as required"
    ],
    "prep_time": null,
    "method": [
      "Mix all the ingredients together and beat with an electric beater till stiff peaks are formed.   ",
      "Remember; add the milk gradually so that you don't add too much.",
      "Spread over the cake."
    ],
    "name": "Butter Icing"
  },
  {
    "cook_time": "1 Hour",
    "description": "Who doesn't love a freshly made jam on the dining table? A fruity delight that smoothly spreads on the toasted bread. This apple jam is easy to make and preservative free.",
    "ingredients": [
      "1 kg apples - cored and chopped",
      "1 kg sugar",
      "1/4 cup lemon juice or to taste",
      "1/4 tsp cinnamon - powdered (optional)"
    ],
    "prep_time": null,
    "method": [
      "Put the apples in a steel or glass container, cover with water and keep overnight.",
      "Transfer to a heavy-based sauce pan, bring to a boil and cook till soft.",
      "Strain through a soup strainer or blend and strain.",
      "Put back onto the stove and bring to a boil again and cook, stirring to avoid scorching.",
      "When slightly thinner than jam consistency, add the sugar, lemon juice and ",
      ".",
      "Lower the heat and keep stirring till sugar is dissolved (not letting it coming to a boil before that).",
      "When sugar is dissolved, bring to a boil and cook, stirring all the time (else it will caramelize at the bottom and change flavour).",
      "When a drop placed over a cold surface sets, the jam is ready.",
      "Store in sterilized, airtight jars."
    ],
    "name": "Apple Jam"
  },
  {
    "cook_time": "25 minutes",
    "description": "Its easy. Its tasty. Its going to make your desserts a little more yummy. Make this caramel sauce at home.",
    "ingredients": [
      "125 gm sugar",
      "250 ml cream",
      "25 gm butter"
    ],
    "prep_time": null,
    "method": [
      "Melt sugar in a heavy pan and heat till a rich golden brown. ",
      "Gradually pour in warmed cream.",
      "Dissolve over a gentle flame.",
      "Add butter in small pieces.",
      "Set aside"
    ],
    "name": "Caramel Sauce"
  },
  {
    "cook_time": "1 Hour",
    "description": "Tomato ketchup made at home. The solution to a bland sandwich, a non-juicy burger or with a plate of pakoras. Pair it up and get the tang in the dish.",
    "ingredients": [
      "1kg tomatoes-chopped roughly",
      "2 tsp chopped garlic",
      "2 Tbsp sugar",
      "2 tsp salt or to taste",
      "1 tsp ",
      "1 tsp chilli powder",
      "2 Tbsp vinegar",
      "1/4 tsp sodium benzoate-mixed with water",
      "Boiled water"
    ],
    "prep_time": null,
    "method": [
      "Cook the tomatoes and garlic together till soft.",
      "Strain through a soup strainer, or blend in a blend and then pass through a sieve.",
      "Put it back over high heat, add sugar, salt, ",
      ", chilli powder and vinegar and cook till thick.",
      "The mixture begins to spurt only in the center, when ready.",
      "Take off the heat, add the sodium benzoate (a preservative) solution and store in airtight sterilized jars."
    ],
    "name": "Tomato Ketchup"
  },
  {
    "cook_time": "10 Minutes",
    "description": "An aromatic biryani ka masala made in the microwave.",
    "ingredients": [
      "60 corns all spice",
      "4 whole star anise",
      "16 green cardamoms",
      "4 whole flowers of mace",
      "1 whole nutmeg"
    ],
    "prep_time": null,
    "method": [
      "Dry roast all the ingredients.",
      "Cool and powder.",
      "Store in an airtight jar."
    ],
    "name": "Biryani Masala"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Fafda is a popular Gujarati snack made with gram flour, turmeric and carom seeds. It is fried crisp and served with chutney.",
    "ingredients": [
      "2 cups ",
      " (chick-pea flour) ",
      "1/4 tsp baking soda ",
      "1/4 tsp ",
      " (thymol) ",
      "1/4 tsp ",
      " (turmeric) ",
      "1 Tbsp oil ",
      "1/2 tsp salt tsp or to taste ",
      "Oil to deep-fry"
    ],
    "prep_time": "05  Minutes",
    "method": [
      "Mix the ",
      ", soda, ",
      ", 1 tbsp oil and salt together. ",
      "Add water and knead into a soft dough. ",
      "Take a portion of the dough and place it on a greased surface.   ",
      "With base of your palm, drag the dough in a straight line, holding the dough at the starting point with the other hand. ",
      "This will form a strip. ",
      "Fry these strips over medium heat till crisp.   ",
      "\n This is a difficult thing till you are practiced enough. You can also \nroll into thin rounds between two sheets of greased polythene."
    ],
    "name": "Fafda "
  },
  {
    "cook_time": "30 minutes",
    "description": "Kachri is a wild variety of cucumber that resembles a brown yellow small melon. When mixed with garlic, salt, red chilli powder, turmeric and coriander, it makes a spicy and delicious Rajasthani chutney.\nA delicious and spicy chutney from the house of Rajasthan\n",
    "ingredients": [
      "50 gm kachri ",
      "100 gm garlic paste ",
      "A pinch of turmeric powder ",
      "10 gm red chilli powder ",
      "10 gm coriander powder ",
      "Salt to taste ",
      "2 gm cumin seeds ",
      "A pinch of asafoetida ",
      "Oil"
    ],
    "prep_time": "2 Minutes",
    "method": [
      "Soak the kachri for 5-6 hours and grind it to a fine paste. ",
      "Then mix well the kachri paste, garlic, salt, red chilli powder, turmeric, coriander powder. ",
      "Take oil in a pan. ",
      "Add the cumin seeds and let them crackle. ",
      "Add the asafoetida as well as the kachri mixture to it. ",
      "Add around 60 ml of lukewarm water. ",
      "Let it simmer for 4-5 minutes and remove from fire. ",
      " Instead of pre packed red chilli powder, freshly ground red chillies give a far better flavour."
    ],
    "name": "Kachri Ki Chutney"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Enjoy freshly made tacos at home with this easy recipe. Fill in your favorites and dig in.",
    "ingredients": [
      "2 cups cornmeal flour (",
      ")-sifted ",
      "1 cup ",
      "1 tsp baking powder",
      "1 1/2 tsp salt ",
      "1 Tbsp shortening ",
      "3 cup warm water",
      "Oil to deep fry"
    ],
    "prep_time": null,
    "method": [
      "Mix the ",
      ", baking powder, salt, shortening and warm water and knead into a soft dough.   ",
      "Roll out thin ",
      " and cook over griddle (",
      "), on both sides.   ",
      "When cool, deep fry the ",
      " to a light brown and bend them gently to form a half folded round."
    ],
    "name": "Taco Cups"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Cooking Chinese delicacies made easier with this basic Manchurian sauce recipe.",
    "ingredients": [
      "3 Tbsp corn flour-blended with 1/2 cup water  ",
      "2 Tbsp vinegar  ",
      "2 tsp salt ",
      "2 tsp soya sauce ",
      "1/2 cup tomato puree  ",
      "2 Tbsp chopped celery or 1/4 tsp celery salt  ",
      "1/4 tsp ajino moto, optional ",
      "2 cups water"
    ],
    "prep_time": null,
    "method": [
      "Mix all the ingredients, bring to a boil and simmer for 1/2 a minute."
    ],
    "name": "Manchurian Sauce "
  },
  {
    "cook_time": "20 Minutes",
    "description": "A masala that you can make today to simplify your cooking later.",
    "ingredients": [
      "25 gm green cardamoms",
      "25 gm whole black peppercorns",
      "25 gm ",
      "25 gm ",
      "25 gm ",
      "25 gm ",
      "25 gm ",
      "20 gm cloves",
      "100 gm fennel seeds",
      "25 gm cinnamon",
      "90 gm split husked Bengal gram",
      "100 gm turmeric -whole",
      "100 gm husked sesame seeds",
      "500 gm dried coconut-chopped fine",
      "1/2 a nutmeg",
      "100 gm cumin seeds",
      "250 gm refined ground-nut oil"
    ],
    "prep_time": null,
    "method": [
      "Saute all the ingredients in the oil over low heat, till very slightly colored.",
      "Cool and then grind to a powder.",
      "Store in an air-tight jar."
    ],
    "name": "Paav Bhaji Masala"
  },
  {
    "cook_time": "30 Minutes + Fermentation(6-7days)",
    "description": "This sensational condiment has made its way to every Indian home and is a true testament to how much Indians love their spices. A mix of fresh vegetables and fabulous mangoes, this mixed achaar will send your taste buds on a joy ride.",
    "ingredients": [
      "8 carrots-scraped and cut into desired sized pieces ",
      "2 cups mango-cut into small pieces ",
      "2 cups cauliflower flowerets ",
      "3 cucumbers-cut to match other vegetables (unpeeled) ",
      "1 cup shelled peas ",
      "1 cup salt ",
      "3 tbsp chilli powder ",
      "1 tbsp powdered mustard seeds ",
      "1/4 cups vinegar ",
      "1 tsp fenugreek seeds powder ",
      "1 tsp turmeric powder ",
      "1 cup mustard oil"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Mix carrots, mangoes, cauliflower, cucumbers, peas and salt and leave for 3-4 hours. ",
      "Drain the vegetables well and discard the liquid. ",
      "Mix\n the vegetables, chilli, mustard, vinegar, fenugreek, turmeric and oil. Transfer to a jar and leave to mature, stirring once or twice a day. ",
      "The pickle will be ready to eat in 6-7 days. ",
      "You can add permissible red color if you want it to look brighter."
    ],
    "name": "Aam ka Pachranga Achaar"
  },
  {
    "cook_time": "10 minutes",
    "description": "A sweet and sour chutney that goes well with all those crisp tea-time treats.",
    "ingredients": [
      "1/2 cup tamarind-tightly packed ",
      "3/4 cup jaggery - broken up ",
      "2 tsp rock salt ",
      "1 tsp black rock salt-powdered ",
      "1 tsp powdered ginger ",
      "1/4 tsp black pepper powder ",
      "1/4 tsp chilli powder ",
      "1 tsp chaat masala"
    ],
    "prep_time": "2 Minutes",
    "method": [
      "Soak the tamarind in water till soft and pulpy. ",
      "Strain and add enough water to have a thin pouring consistency. ",
      "Add remaining ingredients and bring to a boil, then simmer over low flame, till it thickens a little. ",
      "Cool and serve."
    ],
    "name": "Sonth ki Chutney"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Serve up a luscious red chutney that's not only easy to make but goes with almost anything on the dinner table.",
    "ingredients": [
      "1 kg tomatoes, blanched and chopped",
      "1 cup onions, chopped",
      "2 tsp ginger-garlic paste",
      "500 gm sugar or to taste",
      "1 tsp salt or to taste",
      "1 tsp chilli powder",
      "1 tsp garam masala",
      "2 Tbsp vinegar",
      "2 Tbsp oil"
    ],
    "prep_time": "3 Minutes",
    "method": [
      "Heat some oil, add brown onions and ginger-garlic paste to it and cook till they brown. ",
      "Add tomatoes, sugar, salt, chilli powder and garam masala and cook to a thick consistency. ",
      "Add vinegar and simmer for about 5 minutes. When cool, pack in an airtight clean jar and store."
    ],
    "name": "Tomato Chutney"
  },
  {
    "cook_time": "20 Minutes",
    "description": " A fine blend of coconut, curd and pineapple combined with fiery chillies and spices.",
    "ingredients": [
      "1/4 cup curd ",
      "1/2 tsp mustard seeds ",
      "3 to 4 whole red chillies ",
      "1 tsp green\n chillies ",
      "4 to 5 curry leaves ",
      "1/2 tsp chopped ginger ",
      "1 cup diced \npineapple ",
      "2 Tbsp coconut paste mixed with spices and mustard oil"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Heat oil in a pan and splutter some mustard.",
      "Add green chillies, red \nchillies, curry leaves and ginger.  ",
      "Now add pineapple and coconut \npaste.",
      "Cook for few minutes.",
      "Finally add curd. ",
      "Mix well and \nserve."
    ],
    "name": "Pachadi"
  },
  {
    "cook_time": "15 Minutes",
    "description": "A sweet and sour date chutney that goes brilliantly with pani puri, alo chaat and all kinds of crispy snacks.",
    "ingredients": [
      "250 gm dates-soaked in water that covers the dates. Leave it soaked for about 2-3 hours.",
      "1 tsp dried ginger, powdered",
      "20 gm tamarind, pulp removed ",
      "1/2 tsp chilli powder ",
      "2 tsp salt or to taste"
    ],
    "prep_time": null,
    "method": [
      "De-seed the dates and blend them smooth in a blender. Keep adding water to make ensure it's of pouring consistency. ",
      "Add the ginger powder, tamarind pulp, chilli powder, salt and boil. Lower the heat and simmer for about 5 minutes."
    ],
    "name": "Sweet Date Chutney (Khajoor ki Chutney)"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Whip up a bowlful of this comforting raita with onions, cumin, chillies and coriander to enhance the flavour.",
    "ingredients": [
      "300 gm yoghurt ",
      "50 ml cream ",
      "Salt to taste ",
      "5 gm roasted cumin, crushed ",
      "50 gm sliced onions ",
      "10 gm green chillies ",
      "10 gm coriander leaves ",
      "Garnish chilli powder roasted cumin crushed"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Whisk the yoghurt along with the cream and salt. ",
      "Mix in the cumin powder, sliced onions, chopped green chillies and coriander leaves.",
      "Serve garnished with cumin and chilli powder."
    ],
    "name": "Pyaaz ka Raita"
  },
  {
    "cook_time": "1 Hour 20 Minutes",
    "description": "Here is a recipe to make the base of a pizza with flour, yeast and olive oil.",
    "ingredients": [
      "500 gm flour",
      "Salt",
      "300 ml tepid water (",
      "7 gm dried yeast",
      "1/2  tsp sugar",
      "30 ml olive oil for dough",
      "Extra Virgin Olive oil"
    ],
    "prep_time": null,
    "method": [
      "Sieve flour with salt.",
      "\nAdd yeast to tepid water and stir in sugar and leave aside for 6 to 8 minutes.",
      "\nIn a mixing bowl, create a well in the middle of the flour mixture and add 100ml of yeast mixture and 15ml olive oil.",
      "\nAdd in the rest of yeast mixture and remaining olive oil.",
      "\nFlour the kneading surface so that the dough does not stick.",
      "\nMix together with your fingers till you have a dough. Knead for 10 minutes till you have an elastic, even product. ",
      "Proving the Dough:",
      "\nPlace the dough in a bowl and drizzle generously with extra virgin olive oil.",
      "\nCover bowl with cling film and place in a warm area to prove for 50 minutes.",
      "\nAfter the dough is proved, bash the air out and cut into small pieces for individual pizzas.",
      "  ",
      "\nDust the work surface and rolling pin with some flour before rolling out the dough."
    ],
    "name": "Dough For Pizza"
  },
  {
    "cook_time": "1 Hour",
    "description": "Back to basics. Enjoy a freshly made pizza base with this recipe.",
    "ingredients": [
      "2 cups refined flour  ",
      "1 tsp dry yeast   ",
      "1/2 tsp sugar ",
      "1/2 tsp salt ",
      "1 tsp ",
      "Oil  ",
      "Water to mix the dough ",
      "2, 10\" or 3, 8\" round baking tins"
    ],
    "prep_time": null,
    "method": [
      "Dissolve sugar in 1/2 cup lukewarm water. ",
      "Sprinkle yeast over the water and leave in a draught-free place to froth.   ",
      "Sieve the refined flour with salt and rub the oil into it. ",
      "Add yeast solution and knead into a smooth, but not stiff dough, using water as required. ",
      "Place in a greased bowl and cover with a thick, damp cloth or cling foil. ",
      "Place in a warm draught-free place to rise.   ",
      "When the dough has doubled, punch it in the center, smoothen it and leave to rise once again. ",
      "To test, press into the dough lightly and the impression should fill up gradually when your dough is ready."
    ],
    "name": "Pizza Dough"
  },
  {
    "cook_time": "20 Minutes",
    "description": "A quick and delicious recipe for making pizza sauce from tomatoes and a tangy seasoning.",
    "ingredients": [
      "1 can whole tomatoes",
      "Olive Oil",
      "2 bulbs of roasted garlic",
      "Worcestershire Sauce",
      "1 tsp sugar",
      "Salt and pepper"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Pour some olive oil in a pan and add in tomatoes.",
      "Chop the bulbs of garlic and add them into the pan, drizzle a few drops of Worcestershire Sauce and add in sugar.",
      "Season with salt and pepper.",
      "Mash the tomatoes to achieve an even consistency and bring the mixture to a simmer.",
      "Strain the mixture into a bowl and transfer the sauce the same pan and simmer for another 5 to 7 minutes."
    ],
    "name": "Pizza Sauce"
  },
  {
    "cook_time": "40 Minutes",
    "description": "A very easy to make crisp pie crust.",
    "ingredients": [
      "1 cup flour / ",
      "1/2 cup butter, softened not melted",
      "Salt, a pinch",
      "2-3 tsp cold water"
    ],
    "prep_time": null,
    "method": [
      "In a plate/ deep dish sieve the flour and salt together. Make sure there are no lumps.",
      "Add the softened butter and mix it together with hands to make a crumbly mixture.",
      "With the help of some cold water combine the whole mixture together. ",
      " Do not knead the dough, it is supposed to be gently combined together. Store in the fridge for 10 minutes.",
      "Once this is done, roll out the dough (1 cm thick) on a flat and clean surface. Make sure the dough is rolled in forward direction, do not roll haphazardly.",
      "According to the size of your pie tin, cut out the dough and place it carefully in the tin.",
      "Place a small piece of butter paper on the pie tin. Place 6-7 dry ",
      " on it (This procedure is called bake blind. It is important to bake blind so that the pie doesn't rise.)",
      "Bake for 5 minutes at 180 degrees.",
      "Remove the paper and ",
      " and bake it till golden and crisp. Remove from oven.",
      "Let it cool and fill the crisp pie shells with a filling of your choice."
    ],
    "name": "Pie Crust"
  },
  {
    "cook_time": "15 Minutes",
    "description": "These pickled cucumbers are an ideal blend of sweet and sour. They pair up not only with evening snacks but are also a great way to brighten up any bland meal. ",
    "ingredients": [
      "20 tendlis (kundru or small cucumbers) ",
      "1 large carrot ",
      "1/2 cup salt ",
      "3 cups vinegar ",
      "2 cups sugar ",
      "1/2 tsp powdered black pepper"
    ],
    "prep_time": null,
    "method": [
      "Wash and prick the tendlis.",
      "Scrape and slice the carrot into thin rounds.",
      "Place both the vegetables in a glass or stainless steel jar and sprinkle the salt over it.",
      "Cover with water and let them stand overnight.",
      "Next morning, drain the water, add vinegar, sugar and black pepper and bring to a boil.",
      "Simmer for 3 - 4 minutes, remove from heat and store in an airtight sterilised jar. "
    ],
    "name": "Pickled Cucumbers (Kundru ka Achaar)"
  },
  {
    "cook_time": "15 Minutes",
    "description": "The classic mayo dip made without eggs, with milk, oil and vinegar. Use in sandwiches or solo as a dip.",
    "ingredients": [
      "2 Tbsp flour",
      "1 Tbsp oil",
      "1 cup milk",
      "3 Tbsp vinegar",
      "1 tsp sugar",
      "1 tsp salt",
      "1/4 tsp powdered black pepper",
      "1/2 tsp mustard powder"
    ],
    "prep_time": "05  Minutes",
    "method": [
      "Make white sauce with the flour, fat and milk. ",
      "When cold, add the rest of the ingredients and mix well.",
      "Chill it, and your mayonnaise is ready. ",
      "Keep this in an airtight bottle in the fridge for 5-6 days."
    ],
    "name": "Eggless Mayonnaise"
  },
  {
    "cook_time": "15 Minutes + Rest Time (3-4 days)",
    "description": "This palatable pickle of green chillies is stuffed with a spice mix and generous squeeze of lime. ",
    "ingredients": [
      "1 kg large green peppers-washed and wiped dry ",
      "4 cups lemon juice ",
      "3/4 cup\n salt ",
      "3/4 cup fennel seeds-powdered coarsely ",
      "3/4 cup powdered mustard \nseeds ",
      "1/2 cup turmeric ",
      "2 Tbsp onion seeds ",
      "1/4 cup fenugreek \nseeds - roasted and powdered fine ",
      "1 Tbsp asafoetida - roasted and powdered \nfine  ",
      "1 cup vegetable oil"
    ],
    "prep_time": null,
    "method": [
      "Slit the peppers lengthwise. ",
      "Mix together 3/4 cup salt, fennel seeds, \nmustard seeds, turmeric, onion seeds, fenugreek seeds and asafoetida. \n",
      "Mix in 1/4 cup each of the lemon juice and the oil too. ",
      "Fill the peppers\n with the spice mixture and pack them into a clean jar. ",
      "Pour the rest of\n the lemon juice over the peppers and leave thus for 3-4 days.  ",
      "Heat the\n rest of the oil, cool it to room temperature and pour into the jar \nafter 3-4 days.   ",
      "Keep it covered with oil, to prevent it from spoiling."
    ],
    "name": "Hari Mirch Ka Achaar"
  },
  {
    "cook_time": "1 hour",
    "description": "This basic tomato and basil sauce with onions, chilli flakes , balsamic vinegar and pepper smothered over some silky pasta is delicious.",
    "ingredients": [
      "3 Tbsp extra virgin olive oil",
      "1 large onion, chopped",
      "2-4 garlic cloves, crushed",
      "3 (400 g) tins of chopped tomatoes",
      "1/2 tsp crushed chili flakes",
      "2 tsp balsamic vinegar",
      "2 tsp sugar",
      "Bunch of basil leaves, torn into small pieces",
      "1/4 tsp salt",
      "1/4 tsp freshly ground black pepper"
    ],
    "prep_time": null,
    "method": [
      "Heat the oil in a saucepan and gently cook the onion and garlic until softened.",
      "Stir in the tomatoes, chili flakes, vinegar and sugar.",
      "Bring to a simmer and cook slowly for 45 minutes to 1 hour.",
      "Stir in the basil and season with salt and pepper.",
      "This sauce can be left chunky or blended in a food processor for a smooth sauce. Serve spooned over cooked pasta."
    ],
    "name": "Tomato and Basil Sauce"
  },
  {
    "cook_time": "10 Minutes + Rest Time(30 days)",
    "description": "Sour limes flavored with aromatic spices. An all time favorite accompaniment across the country, this simple yet impressive lemon pickle is a hit in every Indian household. ",
    "ingredients": [
      "1 kg sour limes-washed and wiped dry, cut into 4 pieces each ",
      "1 1/4 \ncup salt  ",
      "1 cup whole red peppers  ",
      "1 tsp asafoetida   ",
      "1/4 cup powdered \nsugar-optional"
    ],
    "prep_time": "5 minutes",
    "method": [
      "Mix all the ingredients together.  ",
      "Transfer into the jar.",
      "Keep it under the sun for about a month.",
      "You can also  add some sliced ginger to it if you desire."
    ],
    "name": "Nimbu ka Saada Achaar"
  },
  {
    "cook_time": "45 Minutes",
    "description": "Role the dough into desired shapes and sizes cannelloni, ravioli, thin noodles etc and enjoy a fresh and homemade pasta.",
    "ingredients": [
      "1 cup flour",
      "1 egg or 1/4 cup milk",
      "1 Tbsp oil",
      "Water as required"
    ],
    "prep_time": null,
    "method": [
      "Add salt to the flour, rub oil in and mix in the egg.",
      "Add water, a little at a time, to knead into a stiff dough.",
      "Rest the dough, covered, for half an hour or so.",
      "Roll as thin as possible, and cut into desired size and shapes -- thin noodles, tagiatelle (flat broader noodles), lasagne, cannelloni etc."
    ],
    "name": "Pasta Dough"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Spicy, savoury and super easy to make, this traditional ginger pickle will entice your taste buds. ",
    "ingredients": [
      "2 cups ginger-finely shredded",
      "1/2 cup sugar ",
      "2 Tbsp salt to taste ",
      "1/4 cup lemon juice ",
      "1 Tbsp chilli powder or to taste ",
      "1 tsp asafoetida powder"
    ],
    "prep_time": null,
    "method": [
      "Mix all the ingredients and cook over high heat. ",
      "When it comes to a boil, lower the heat and simmer for a couple of minutes.",
      "Store in a clean jar."
    ],
    "name": "Adrak ka Achaar - Andhra Style"
  },
  {
    "cook_time": "15 minutes + Rest Time(30 days)",
    "description": "Niru Gupta brings you a staple accompaniment in every Indian household. A handful of ingredients, spices to flavour and a few simple steps will get you to this classic achaar.",
    "ingredients": [
      "1 kg ",
      " (sour limes)- washed and wiped dry, and cut into 4 \npieces each ",
      "1 1/4 cup salt ",
      "1 cup sliced ginger ",
      "1 Tbsp. chilli powder or \nto taste ",
      "1 tsp "
    ],
    "prep_time": "10 minutes",
    "method": [
      "Mix all the ingredients together.",
      "Rub the ingredients well into the cut limes.  ",
      "Transfer into the jar and keep under the sun for about a month."
    ],
    "name": "Nimbu Adrak ka Achaar"
  },
  {
    "cook_time": "25 Minutes",
    "description": "Pickled onions with distinctive flavours of garlic, mustard oil and fennel seeds (saunf).",
    "ingredients": [
      "1 kg small onions-peeled, blanched ",
      "250 gm garlic-peeled, cloves separated ",
      "3 cups mustard oil ",
      "6 Tbsp methi dana (fenugreek seeds) ",
      "5 Tbsp chilli powder ",
      "5 Tbsp kalonji (onion seeds) ",
      "1/2 cup saunf (fennel seeds) ",
      "5 Tbsp turmeric ",
      "10 Tbsp salt (125 gm) ",
      "1 cup vinegar"
    ],
    "prep_time": "5 minutes",
    "method": [
      "Heat oil and add the methi, chilli powder, kalonji and turmeric. ",
      "Saute a little and add the onions and garlic. ",
      "Stir fry over high heat, till well mixed and onions and garlic are coated with oil. ",
      "Add the salt and vinegar, bring to a boil and shut off the heat. ",
      "When cool, store in an airtight jar."
    ],
    "name": "Onion-Garlic Pickle"
  },
  {
    "cook_time": "35 Minutes",
    "description": "Jackfruit marinated in oil and loaded with red chilly gives you one of the spiciest Indian pickles.",
    "ingredients": [
      "3 kg ",
      "(jackfruit)-peeled and cut into chunks ",
      "1 1/4 cup salt + 1/4 cup for the water ",
      "1 cup ",
      " (turmeric) ",
      "2 1/2 cups ",
      "(powdered mustard seeds) ",
      "1 cup ",
      "(coarsely ground red pepper) ",
      "2 Tbsp ",
      "(onion seeds) ",
      "2 Tbsp ",
      "(asafoetida) ",
      "2 kg ",
      "(mustard oil)"
    ],
    "prep_time": "Marination Time (4 Days) + Rest Time( 3 Days)",
    "method": [
      "Boil ",
      "with 1/4 cup salt in it.",
      "Drain out the water and leave ",
      "to dry up. You might have to pat it dry. ",
      "When cool and dry, mix in salt, ",
      "Mix well.",
      "Keep this covered and marinated  for 4 days, stir once a day.",
      "Pack this tightly into a sterilized jar. ",
      "Heat the oil till the aroma is very strong.",
      "Cool to room temperature and pour over the ",
      "The oil should come above the ",
      "mixture. ",
      "Let the pickle mature for another 2-3 days before you consume it. ",
      "Like all pickles, ensure that it stays covered with oil, so it stays good throughout the year."
    ],
    "name": "Kathal Ka Achaar"
  },
  {
    "cook_time": "30 Minutes",
    "description": "This pickle is made with a combination of sweet and spicy flavours of green chillies, vinegar, jaggery, whole spices and sesame oil. ",
    "ingredients": [
      "250 gm long, green chillies ",
      "1/4 cup refined groundnut or sesame oil ",
      "1/4 cup powdered cumin seeds ",
      "1/4 cup powdered coriander seeds ",
      "1/4 cup salt ",
      "1/2 cup vinegar ",
      "1/2 cup gur"
    ],
    "prep_time": "10 minutes",
    "method": [
      "Wash the chillies and let the water dry out, then chop them into twos and threes. ",
      "Mix the vinegar and the gur and cook together till dissolved into a syrup. ",
      "Heat the oil in a pan, and when heated, put in the chillies and saute over high heat till they look a little glossy. ",
      "Add the cumin, coriander and salt, and turn around till well mixed and the chillies are coated with the spices. ",
      "Now add the syrup and let the mixture come to a boil, then shut off the heat. When cool, store in a sterilised air tight jar."
    ],
    "name": "Hari Mirch ka Khatta Meetha Achaar"
  },
  {
    "cook_time": "10 mins",
    "description": "A do-it-yourself taco seasoning recipe that can be stored for weeks. ",
    "ingredients": [
      "1 tablespoon chili powder",
      "1 1/2 teaspoon cumin",
      "1 1/2 teaspoon paprika",
      "1 teaspoon oregano",
      "1 teaspoon salt",
      "1/2 teaspoon garlic powder",
      "1/2 teaspoon onion powder",
      "1/4 teaspoon cayenne pepper"
    ],
    "prep_time": null,
    "method": [
      "Mix together all the spices and store in an airtight container.",
      "To make tacos using this seasoning, "
    ],
    "name": "Taco Seasoning"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Frost those lovely little cupcakes with a thick coffee cream cheese frosting.",
    "ingredients": [
      "1/2 packet cream cheese, softened",
      "1 Tbsp coffee granules dissolved in 2-3 tsp water",
      "1 cup powdered sugar/ icing sugar",
      "1/2 tsp vanilla essence",
      "4 Tbsp butter, softened"
    ],
    "prep_time": null,
    "method": [
      "In a bowl add cream cheese and butter. Mix well.",
      "Add sugar gradually and keep whipping till mixed well.",
      "Add the coffee and vanilla essence.",
      "Whip the frosting to combine everything.",
      "Stuff it in a piping bag. Let it chill in the fridge for 5-10 minutes. Decorate the cupcakes.",
      "Don't have a piping bag? You can just smother the cupcakes using a flat knife or spatula.",
      " You can exclude the coffee in case you want a plain cream cheese frosting."
    ],
    "name": "Coffee Cream Cheese Frosting"
  },
  {
    "cook_time": "20 minutes",
    "description": "This simple and easy-to-make Gujarati chilli pickle has a peppy taste that can spice up any boring meal.",
    "ingredients": [
      "100 gm green chillis, chopped",
      "2 Tbsp salt or to taste ",
      "1 Tbsp ",
      " (mustard seeds) ",
      "1/4 Tbsp ",
      " (turmeric) ",
      "1 Tbsp oil"
    ],
    "prep_time": "15 minutes",
    "method": [
      "Heat some oil and add mustard seeds to it. ",
      "When the seeds splutter, add the rest of the ingredients and saute over high heat till they look glossy and slightly limp. ",
      "Cover and store in a cool place."
    ],
    "name": "Leela Marcha nu Athaaanu (Green Chilli Pickle)"
  },
  {
    "cook_time": "5 Minutes + Time to freeze",
    "description": "Frozen cubes of watermelon juice, basil and camphor which acts as a toner. So the next time you come from outdoors just rub a frozen cube on your face and feel the freshness.",
    "ingredients": [
      "1/2 glass watermelon juice",
      "4-5 basil leaves",
      "A pinch of camphor"
    ],
    "prep_time": null,
    "method": [
      "Mix all ingredients together and pour it in an ice tray.",
      "Place it in the refrigerator to freeze. Use a cube as and when required."
    ],
    "name": "Natural Watermelon Toner"
  },
  {
    "cook_time": "2 Minutes",
    "description": "Peanut butter made at home in just two minutes.",
    "ingredients": [
      "1 cup peanuts, roasted",
      "3 Tbsp vegetable oil (you can add more in case the butter mixture is too thick)",
      "Salt, a pinch",
      "2 Tbsp sugar (increase/decrease according to taste)"
    ],
    "prep_time": null,
    "method": [
      "Combine all the ingredients together and blend it in a mixer.",
      "Spread on a toast and eat."
    ],
    "name": "Two Minute Peanut Butter"
  },
  {
    "cook_time": "2 Hours",
    "description": "Crunchy bread sticks made freshly at home. Serve with some butter and a hot bowl of soup.",
    "ingredients": [
      "Oven temp: 450 F-230C",
      "1 tsp sugar",
      "Lukewarm water to knead dough (too hot will kill yeast)",
      "1 tsp dry yeast or 10 gm compressed (Frozen) yeast",
      "2 cups / 240 gm flour (",
      ")",
      "1 tsp salt to taste",
      "1 tsp oil",
      "A baking tray",
      "1 egg, slightly beaten with 1 Tbsp milk and 1/4 tsp salt",
      " In case you do not want to use egg, use 1/4 cup milk and salt mixture."
    ],
    "prep_time": null,
    "method": [
      "Follow the method for ",
      " till ready to shape.",
      "After the second rising break dough into 6-7 lumps.",
      "Roll one long and thin like a rope.",
      "Cut into desired sized lengths. Repeat with the rest of the dough.",
      "Place these on a greased baking tray about ½\" apart. brush with egg mixture (or milk mixture) and leave them to double in size (10-15 minutes).",
      "Bake in the pre-heated oven for 15-20 minutes or till brown.",
      "Note: if you want to make the dough richer, knead in milk, instead of water, or add and egg if you like."
    ],
    "name": "Bread Sticks"
  },
  {
    "cook_time": "Few days to mature",
    "description": "A peppy pickle with asafoetida (heeng) as a game-changing ingredient.",
    "ingredients": [
      "1 kg raw mangoes-peeled and chopped ",
      "3 cups salt ",
      "1/3 cup chilli powder or to taste ",
      "2 tsp heeng powder (adjust according to strength)"
    ],
    "prep_time": "20 minutes",
    "method": [
      "Mix all together and place into a jar and sun for a few days, or let it mature for a few days."
    ],
    "name": "Aam ka Achaar Heeng-Lal Mirch Wala"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Despite what the name suggests, Bombay Duck is actually a kind of fish native to the waters between Mumbai and Kutch. And yes, you can pickle that too.",
    "ingredients": [
      "100 units of Bombay Ducks, dried ",
      "250 gm Kashmiri chillis ",
      "1/4 cup garlic, chopped ",
      "2 Tbsp ginger, chopped",
      "1 kg cooking oil ",
      "1 bunch curry leaves- clean and remove stems ",
      "2 pods (whole) garlic ",
      "1 ginger, chopped in pieces of 1 inch each",
      "2 Tbsp salt or to taste ",
      "1 Tbsp ",
      ", turmeric powder  ",
      "3-4 sprigs curry leaves, clean and remove stems ",
      "2 cups vinegar"
    ],
    "prep_time": "15 minutes",
    "method": [
      "Wash the Bombay Ducks in vinegar and drain well. ",
      "Grind the chillis, garlic, ginger, salt and turmeric to a paste. ",
      "Heat the oil and fry the fish over high heat till brown. ",
      "Drain it off the oil and keep it aside. ",
      "Fry the curry leaves in the same oil, until they turn dark brown. ",
      "Take them out of the oil and keep aside. ",
      "In the remaining oil, add the ground paste and stir fry till the fat separates. ",
      "Add the fried Bombay Ducks and cook them for 15 minutes over slow fire. ",
      "Finally add the fried curry leaves mix well and shut off the heat. Store in an airtight jar."
    ],
    "name": "Bombay Duck Pickle"
  },
  {
    "cook_time": "15 Minutes",
    "description": "One of the most desirable ice cream toppings made at home in a matter of minutes. Finger licking delicious, this salted caramel sauce recipe cannot go wrong!",
    "ingredients": [
      "1 cup granulated sugar",
      "3 Tbsp butter",
      "1/2 cup cream",
      "A pinch of salt (fleur de sel)"
    ],
    "prep_time": null,
    "method": [
      "In a heavy bottomed pan add 1 cup sugar. Start stirring with a whisk, keeping the flame on medium.",
      "Keep stirring for about 7-10 minutes or till the sugar has completely changed from solid granules to a thick syrup. Let it change color from light golden to dark honey-amber color.",
      "Now turn off the heat and add butter, stir continuously till the butter melts completely.",
      "Add the cream, stir continuously till it has blended nicely and thickens.",
      "Add a pinch of fleur de se or in case you are using normal table salt, add atleast 2 pinches",
      "Mix well. Let it cool for 2-3 minutes.",
      "Pour in a container and store.",
      "Pour over ice creams, custards and cakes as a topping."
    ],
    "name": "Salted Caramel Sauce"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Give your bland meals a tangy twist with homemade tomato puree. This will come handy in all your dishes!",
    "ingredients": [
      "1 kg tomatoes ",
      "1 tsp salt",
      "1 tsp sugar ",
      "Hot water enough to submerge the tomatoes"
    ],
    "prep_time": "2 Minutes",
    "method": [
      "Make a cross sign with a light cut, on the base of the tomatoes(not on the stalk side). ",
      "Place the tomatoes in a bowl, boil some water and pour over the tomatoes to cover. ",
      "When cool enough to handle, peel the tomatoes (the cross sign will make this easier). Chop the tomatoes roughly and blend in a blender and strain. ",
      "Cook over high heat first, add salt and sugar and cook till it is as thick as you would like-cook till it spurts in the center. ",
      "You can now freeze it as it is in convenient sized packs. ",
      "Alternatively, add 1 tsp sodium benzoate in 2 Tbsp boiled water and add to the puree. Pack it in sterilized air tight packs.",
      "Now in cold weather it can be stored at room temperature, and in the refrigerator in summer."
    ],
    "name": "Tomato Puree "
  },
  {
    "cook_time": "30 Minutes",
    "description": "A sweet and spicy treat, candied ginger is used in a variety of desserts and can be made easily at home.",
    "ingredients": [
      "2 cups ginger-scraped and sliced into broad slices",
      "350 gm sugar"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Place ginger and sugar in a pan over low heat, stirring continuously so it does not get brown.",
      "When the liquid dries out, and the ginger gets a transparent look, shut off the heat.",
      "Spread to dry before storing."
    ],
    "name": "Candied Ginger"
  },
  {
    "cook_time": "15 Minutes",
    "description": "The classic mayo dip is enhanced with tangy tomato puree, garlic and fresh herbs. Use it as a sandwich spread or for a dip with salads.  ",
    "ingredients": [
      "125 ml mayonnaise   ",
      "1 Tbsp cream   ",
      "1 Tbsp thick tomato puree   ",
      "1/2 tsp garlic paste ",
      " 1 Tbsp chopped garden herbs (basil, thyme and parlsey)"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "In a bowl take some mayonnaise.",
      "Then add a Tbsp of cream and tomato puree. ",
      "Add garlic paste and freshly chopped herbs.",
      "Combine all the ingredients and mix it well.",
      "Use it as a dip, sandwich spread or serve with appetizers. "
    ],
    "name": "Tomato Mayonnaise"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Wondering what to do with the surplus seasonal fruits? Here's a trick, try this simple recipe, wrapped in mouth-watering flavors. A tangy dessert made of mango pulp - easy and healthy!",
    "ingredients": [
      "Mango pulp ",
      "Sugar ",
      "Pinch of salt"
    ],
    "prep_time": "5-10 Minutes",
    "method": [
      "Take the pulp out of the mangoes and blend in a blender with sugar to taste and a little bit of salt. ",
      "Now take a plastic sheet and spread the pulp on to it. ",
      "Keep this on a chatai (mat) and dry it out in the sun. ",
      "When the top is dried, turn and dry some more till no moisture is left. ",
      "Your aam papad is ready. ",
      "You can do the same if you want a spicy one, by adding kala namak (rock salt) and spices to your liking."
    ],
    "name": "Aam Papad"
  },
  {
    "cook_time": "10 minutes",
    "description": "Here is an authentic Bengali condiment made of five different spices. Add this aromatic concoction to brighten up the flavour of your preparations.",
    "ingredients": [
      "25 gm cumin seeds ",
      "25 gm mustard seeds ",
      "25 gm fenugreek seeds ",
      "25 gm fennel seeds ",
      "25 gm onion seeds "
    ],
    "prep_time": null,
    "method": [
      "Mix the ingredients together and store in an airtight container."
    ],
    "name": "Panch Phoron"
  },
  {
    "cook_time": "45 minutes",
    "description": "This aromatic soup is the perfect dish to help you fight off mid-week blues. The smoked flavour gives the classic pumpkin soup a whole new twist. ",
    "ingredients": [
      "1 kg yellow pumpkin",
      "Salt to taste",
      "20gm sugar",
      "20ml oil",
      "10gm smoke chips",
      "10gm butter (optional)",
      "20gm garlic (chopped)",
      "10gm pepper powder",
      "20gm roasted pumpkin seeds",
      "A few sprigs water cress"
    ],
    "prep_time": null,
    "method": [
      "Peel and slice the pumpkin after washing it. Remove the seeds, and cut into cubes of even sizes. ",
      "Mix oil and garlic, and toss the pumpkin pieces in it to coat them well.",
      "In an oven tray, arrange the pumpkin pieces. Sprinkle the sugar and a little salt on top.",
      "Preheat the oven and bake the pumpkin at 160 degree Celsius till they are tender (depends on the size of the pumpkin, normally takes 10-15 minutes).",
      "Remove the tray from the oven and cool the pumpkin.",
      "For smoking the pumpkin ,arrange it in an inclosable chamber (may be a vessel  with loose fitting lid so that air can pass slightly).",
      "In a small metal bowl or dish, fire up some smoke chips. Put it in the above vessel and cover it with the lid. Leave it for 10 minutes so that the pumpkin can absorb the aroma.",
      "Remove the pumpkin pieces and puree them in a blender (add a bit of water if needed).",
      "Pour the pureed pumpkin in a pan and heat it on medium flame. Add butter and pepper powder. Adjust seasoning if required.",
      "Serve hot in individual soup bowl garnished with cress and pumpkin seeds."
    ],
    "name": "Smoked Pumpkin Soup"
  },
  {
    "cook_time": "20 Minutes",
    "description": "These banana chips fried in coconut oil are perfect to snack on while watching the rains. They are best stored in an air tight container and can last for days.",
    "ingredients": [
      "4 green (unripe) plantains, peeled, sliced into thin rounds and washed",
      "2 cup coconut oil",
      "3 cups water",
      "1 teaspoon turmeric",
      "1 tablespoon chili powder",
      "Salt to taste"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Put the slices of banana into a solution of water, salt and turmeric and let sit for 5 minutes.",
      "Give it a good mix and transfer to a colander to drain completely.",
      "In a medium sized ",
      " on high heat, heat the oil.",
      "When it starts smoking, add the slices in small batches.",
      "Fry until golden and transfer onto a paper napkin.",
      "Repeat with the rest of the slices.",
      "Sprinkle with salt and chilli powder and let it cool.",
      "Store in an air-tight container for up to a week. "
    ],
    "name": "Banana Chips"
  },
  {
    "cook_time": "30 Minutes",
    "description": "This is an Italian meat sauce known as ragù alla bolognese in Italy.  It's origin dates back to the 18th century in Bologna, Italy. ",
    "ingredients": [
      "500 gm keema (minced mutton)",
      "1/2 cup grated onion",
      "1/2 tsp garlic paste                            ",
      "2 cups tomato puree",
      "Salt and sugar to taste",
      "1 tsp chilli powder or to taste",
      "1 tsp oregano and basil",
      "2 Tbsp olive oil"
    ],
    "prep_time": "5-10 Minutes",
    "method": [
      "Heat olive oil and saute garlic, onion and keema till cooked through.",
      "Add the tomato puree, salt, sugar, chilli powder, oregano, basil and simmer for a couple of minutes."
    ],
    "name": "Bolognese Sauce"
  },
  {
    "cook_time": "30 minutes",
    "description": "Devilled eggs, also known as picnic eggs, egg mimosa and Russian eggs, are stuffed with a creamy filling that can be spruced up in numerous ways using spices, herbs and sauces. It's ridiculously easy and hard to resist!",
    "ingredients": [
      "6 eggs",
      "¼ cup mayonnaise",
      "1 tsp mustard sauce or kasundi",
      "Salt and pepper to taste",
      "1/4 cup chopped parsley"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Neatly slice the eggs in halves, and then scoop out the yolks.",
      "In a mixing bowl, add the yolks, mayonnaise and mustard sauce and mix well. Add salt and pepper accordingly to your taste.",
      "Take a piping bag fit with a nozzle, and fill in up with the egg mixture.",
      "Carefully fill up the egg whites with the egg mixture, making neat swirls. Serve immediately.",
      "Additions: You can top the eggs with chopped herbs such as parsley or coriander, or even oregano and chilli flakes."
    ],
    "name": "Devilled Eggs"
  },
  {
    "cook_time": "30 minutes",
    "description": "The all-time favourite Caesar Salad gets more wholesome with penne pasta being tossed it. It makes for a quick and easy lunch meal. Top it with Parmesan and enjoy.",
    "ingredients": [
      "2 chicken breasts, skinless",
      "1 cup penne, boiled",
      "20 lettuce leaves ",
      "½ cup cherry tomatoes, halved",
      "2 Tbsp olive oil",
      "3 bread slices or ½ cup croutons",
      "½ tsp chopped garlic",
      "¼ cup Parmesan shavings",
      "1 garlic clove",
      "½ cup mayonnaise",
      "Salt to taste",
      "1 Tbsp vinegar"
    ],
    "prep_time": "10 Minutes ",
    "method": [
      "Clean the lettuce leaves and roughly tear them into small pieces. Keep aside.",
      "Rub the chicken breasts with olive oil, garlic and seasonings. Pan-fry for 10 minutes, making sure that you turn sides. Remove from flame, let it cool for 10 minutes and then chop into cubes.",
      "Pre-heat the oven to 150 degree C. Tear the bread slices into small croutons, and spread them out in a baking tray. Toss them with olive oil and season. Bake in the oven for 15 minutes until golden. ",
      "For the dressing, in a mixing bowl, whisk mayonnaise, garlic, vinegar, and salt. ",
      "In a large salad bowl, toss the pasta, chicken slices, lettuce, and cherry tomatoes. Add the dressing and toss well. Check seasoning.",
      "Tip in the roasted bread croutons and finish with Parmesan shavings on top."
    ],
    "name": "Chicken Caesar Pasta Salad"
  },
  {
    "cook_time": "15 minutes",
    "description": "A simple yet satisfying recipe with the goodness of black olives and cherry tomatoes, tossed up with fusilli and feta, and dressed in balsamic vinaigrette.",
    "ingredients": [
      "1 cup fusilli, boiled",
      "½ cup black olives, slices",
      "½ cup feta, cubed",
      "½ cup cherry tomatoes, cubed",
      "¼ cup spring onions, chopped",
      "1 Tbsp olive oil",
      "1 Tbsp balsamic vinegar",
      "Salt and pepper to taste"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "For the dressing, in a mixing bowl, whisk olive oil and vinegar until they emulsify. Add the seasonings and whisk again.",
      "In a large salad bowl, toss together pasta, olives, cherry tomatoes, spring onions and feta. Add the dressing. Check seasoning and serve."
    ],
    "name": "Fusilli, Black Olive and Feta Pasta Salad"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Here's how to extract fresh coconut milk at home. ",
    "ingredients": [
      "Coconut"
    ],
    "prep_time": null,
    "method": [
      "Break a coconut and scrape out the white portion with a scraper. ",
      "Cut the coconut into small pieces. ",
      "Place the coconut in a blender and cover with water. ",
      "Blend and then strain. ",
      "This is the thicker extract, also called the first extract. ",
      "Put the leftover coconut back into the blender, add water, just enough to cover it and repeat the process for the second time. ",
      "This is the thinner extract."
    ],
    "name": "Coconut Milk"
  },
  {
    "cook_time": "30 Minutes",
    "description": "Home-made vegetable stock to add freshness to your recipes.",
    "ingredients": [
      "1 kg mixed vegetables ",
      "2 tbsp oil ",
      "6 cups water ",
      "1 large onion-chopped roughly ",
      "4 tbsp chopped celery ",
      "1 bay leaf ",
      "2 cloves ",
      "2 peppercorns ",
      "1 tsp salt."
    ],
    "prep_time": null,
    "method": [
      "Cook all the ingredients together in a pressure cooker for about 5 minutes. ",
      "If not using a pressure cooker, bring to a boil and then simmer in a covered pan for 15-20 minutes. ",
      "Strain the soup and season according to taste."
    ],
    "name": "Vegetarian Stock"
  },
  {
    "cook_time": "20 minutes",
    "description": "The popular Italian condiment gets an Indian makeover with curry leaves and cashews blending together to create a relishing treat. Toss your pastas with it for a desi twist.",
    "ingredients": [
      "50 gm curry leaves",
      "2 garlic cloves   ",
      "                                                                  ",
      "1 Tbsp cashew nut",
      "150 ml olive oil",
      "2 Tbsp Parmigiano Reggiano ",
      "2 Tbsp Pecorino cheese     ",
      "           ",
      "1 tsp sea salt"
    ],
    "prep_time": null,
    "method": [
      "Start by pounding the garlic and salt in the mortar with a wooden pestle, until you get a smooth paste.",
      "Add the curry leaves, a handful at a time, and keep grinding using a circular motion until each batch of the leaves is incorporated. Make sure you are not too rough with the curry leaves; it's important to preserve the essential oils.",
      "Add the cashew nut and grind some more.",
      "Add the cheeses and mix well.",
      "Add the oil, little by little, until the pesto has the right consistency. Try this with spaghetti, linguine or fusilli."
    ],
    "name": "Cashew Pesto"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Hung curd is nothing but yogurt drained of all its water. Here's how to make it at home.",
    "ingredients": [
      "Curd"
    ],
    "prep_time": null,
    "method": [
      "Place a colander/sieve over a container; line it with a thin muslin (if it is nylon sieve which has a very fine mesh, you need not line it). ",
      "Now place the curd in it and let it drain till all the extra liquid had drained out and just a thick mass of curd remains."
    ],
    "name": "Hung Curd"
  },
  {
    "cook_time": "15 Minutes ",
    "description": "Get back to the basics to arrive at the newest and the sweetest way to make your cake more delicious!",
    "ingredients": [
      "200 gm icing sugar",
      "4-5 Tbsp hot water",
      "2 tsp cream     ",
      "Few drops of peppermint essence."
    ],
    "prep_time": null,
    "method": [
      "Mix all the ingredients together to form a smooth paste. ",
      "Spread over the cake."
    ],
    "name": "Peppermint Icing"
  },
  {
    "cook_time": "20 Minutes",
    "description": "Kick-start your day with a nutritious punch! Milk delicately flavored with the goodness of almonds and cardamom. ",
    "ingredients": [
      "1 cup chilled milk ",
      "1/4 cup condendsed milk ",
      "1/4 cup almonds ",
      "Pinch of elaichi powder ",
      "1/4 cup ice-crushed"
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Place the almonds in a bowl and pour boiling water over. Leave for half \nan hour. ",
      "Chop half the almonds fine and place the other half in a \nblender. ",
      "Place the milk, condensed milk, ",
      " powder and ice in the blender too. ",
      "Blend till well mixed and serve garnished with the chopped almonds."
    ],
    "name": "Badaam Milk"
  },
  {
    "cook_time": "30 minutes",
    "description": "Cashew is an integral part of Sri Lankan cuisine. This delectable curry is made with sweet green peas, mild spices and creamy cashew paste.",
    "ingredients": [
      "2 Tbsp cooking oil or ghee",
      "I medium-sized onion, finely chopped",
      "150 gm cashews",
      "A few sprigs pandanus leaves, optional",
      "1 cinnamon stick ",
      "1 cup green peas",
      "A few sprigs curry leaves",
      "½ tsp turmeric powder",
      "1 tsp curry powder",
      "1 tsp chilli powder",
      "Salt to taste",
      "½ tsp mustard seeds"
    ],
    "prep_time": null,
    "method": [
      "Soak the cashews for an hour. You can boil them for a few minutes in case you forget to soak them.  ",
      "Fry the onions and add the curry leaves and the spices. Once the onions start to brown, add the cashew and 2 cups of water; cook for about 10 minutes.",
      "Add green peas and the coconut milk; keep stirring on a medium to high flame until the sauce has thickened.",
      "Try this with steamed rice or string hoppers (idiyappam). "
    ],
    "name": "Sri Lankan Cashew and Green Peas Curry (Kaju Maluwa)"
  },
  {
    "cook_time": "15 Minutes",
    "description": "An easy to make condiment that will add a distinct flavor to your everyday cooking. This one is a must have for your kitchen.",
    "ingredients": [
      "3/4 cup coriander leaves- chopped ",
      "2-3 green chillies- chopped ",
      "2 tsp ginger- chopped ",
      "6 peppercorn ",
      "6 cloves ",
      "1/4 cinnamon- powdered ",
      "1 Tbsp rock salt ",
      "2 Tbsp lemon juice "
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Grind together all the ingredients and refrigerate it. ",
      "Use it to marinate boiled potatoes or ",
      ", after which they can be either grilled or fried.",
      "You can also cook the ",
      " over low flame, with a little water and grated coconut added to it."
    ],
    "name": "Green Masala"
  },
  {
    "cook_time": "15 Minutes + Keep for a week",
    "description": "Avakkai is a type of Andhra pickle. Along with a mix of spices, this recipe also used black channas.",
    "ingredients": [
      "3 raw mangoes ",
      "8 tsp red chilli powder ",
      "2 tsp turmeric powder     ",
      "1 tsp fenugreek powder ",
      "2 tsp mustard     ",
      "Salt to taste",
      "1 tsp asafoetida ",
      "3/4 sesame oil",
      "4 tsp black channa     "
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Choose solid,firm and good variety mangoes.Wash,pat dry and cut in to cubes as shown.",
      "Take mustard in a blender and powder nicely.",
      "Place cut mangoes in a clean vessel.Add red chilli powder,turmeric powder, fenugreek powder, asafoetida, mustard powder and salt.",
      "Add sesame oil and black channa.",
      "Mix well. Keep it covered in a clean jar and use after a week.",
      "The peculiarity of this pickle is addition of black channa and it gives a good aroma to the pickle, so don't avoid it.",
      "Adding red chilli powder is up to you, you may reduce it if you want.",
      "Do mix the jar daily once and keep it in sun light with a cloth tied to the jar. This increases the shelf live of the pickle."
    ],
    "name": "Avakkai"
  },
  {
    "cook_time": "1 hour ",
    "description": "A hearty broth made using chicken and an assortment of mushrooms - button, shiitake, shimeji, enoki, chanterelle, and simmered for over 6 hours. Patience is the key here!",
    "ingredients": [
      "1kg chicken bones, cleaned and chopped",
      "300gm fresh mushrooms, assorted (button, shiitake, shimeji, enoki, chanterelle)",
      "1 large onion, diced",
      "Salt and pepper to taste",
      "1 Tbsp palm sugar",
      "½ cup dark rice wine",
      "1 Tbsp rice wine vinegar ",
      "1 tsp smoked sesame oil"
    ],
    "prep_time": "5-6 hours",
    "method": [
      "Heat a large heavy pan, add a few drops of oil and add the chopped bones.",
      "Stir gently to get rid of the moisture and gradually brown the bones to a soft amber colour.",
      "Diced carrots, onion and celery may also be added to the pan for other broths - but for this particular soup it is not suggested.",
      "Add water to cover the bones and gradually bring the pan to a very slow simmer.",
      "Impurities from the bones - blood, tissues etc. will coagulate and begin to rise to the surface as scum. It is very important to skim this as it collects on the surface.",
      "Allow the broth or stock to simmer, un-covered, for 5 to 6 hours. Replenish water to keep the bones submerged.",
      "Slice the hardier mushrooms - the button and shiitake, clean the delicate ones but leave them whole.",
      "Once the chicken broth is ready, skim the surface for any scum one final time and then pour the clear broth into a pan through several layers of well washed muslin or cheese cloth. Reserve warm. The stock could be chilled and refrigerated, even frozen and used over weeks.",
      "Heat another heavy pan, add a few drops of oil, sliced garlic and the julienne of ginger, and sauté for a few seconds. Add the sliced mushroom and immediately increase the heat. Stir rapidly over high heat to sear the mushrooms to a nutty golden brown.",
      "Add a dash of the dark rice wine and then a few drops of the vinegar.",
      "Pour the chicken stock into the pan with mushrooms and bring it to a simmer.",
      "Season with palm sugar, salt and pepper.",
      "Add the shimeji and simmer for a few minutes.",
      "Serve in heated soup bowls, distribute mushrooms evenly and sprinkle the enoki and a few drops of sesame oil over each bowl."
    ],
    "name": "Seared Mushrooms and Chicken Broth"
  },
  {
    "cook_time": "20 Minutes + Keep for 2 days ",
    "description": "A tangy pickle that tastes great with curd rice. The use of roasted and ground mustard seeds in this recipe adds an additional burst of flavours. ",
    "ingredients": [
      "8 lemons     ",
      "20 red chillies     ",
      "3 tsp mustard ",
      "1 tsp fenugreek/methi",
      "1 tsp turmeric powder     ",
      "1 tsp asafoetida     ",
      "Salt to taste",
      "2 Tbsp sesame oil     "
    ],
    "prep_time": "5 Minutes",
    "method": [
      "Wash and pat dry the lemons and cut into small pieces as shown. Place them in a clean bowl or vessel.Add the juices too. Add salt.",
      "In a pan dry roast fenugreek and red chillies one by one. Place in a blender and powder finely.",
      "Add this powder along with turmeric powder to the salt lemon mixture.In a small pan add sesame oil and add mustard seeds. Add in asafoetida. When the mustard seeds crackle switch off the flame. Cool the oil completely.",
      "Add the oil in lemon mixture and and mix well. ",
      "Store in a clean dry container, bottle or ceramic pot for at least two days before you use. ",
      "Be sure to use a clean and dry spoon while taking the pickle out.",
      "Use fresh firm lemon for pickles.",
      "Also use the juice of lemon,since that enhances the flavour of the pickle. "
    ],
    "name": "Lemon Pickle"
  },
  {
    "cook_time": "15 Minutes",
    "description": "Nutrition-packed pumpkin hummus dip to go with your favourite tortilla chips.",
    "ingredients": [
      "250 gms yellow pumpkin (roasted)     ",
      "4 Tbsp tahini paste ",
      "1/2 tsp cumin powder ",
      "2 1/2 tsp garlic (minced)",
      "1 1/2 tsp lemon juice ",
      "3 tsp olive oil ",
      "Salt as per taste"
    ],
    "prep_time": "10 Minutes ",
    "method": [
      "Peel and roughly cut the pumpkin, mix garlic cloves, olive oil and roast in a pre-heated oven till golden & cooked."
    ],
    "name": "Roasted Pumpkin Hummus"
  },
  {
    "cook_time": "10 Minutes",
    "description": "This easy spinach dips is warm and gooey, unlike your regular accompaniments. Serve with freshly baked tortilla chips.",
    "ingredients": [
      "200 gm spinach",
      "1 onion (medium)",
      "1/2 cup cream",
      "25 gm garlic (chopped)",
      "Bechamel sauce",
      "Nutmeg (pinch)",
      "Salt to taste",
      "1 tsp lime-juice",
      "1 cup artichoke hearts (cubed)",
      "25 gm polenta",
      "20 gm refined flour",
      "Pinch of salt",
      "1/2 cup water",
      "2 Tbsp butter",
      "2 Tbsp  flour",
      "1 1/4 cups milk, heated",
      "Salt to taste",
      "Freshly ground pepper (to taste)"
    ],
    "prep_time": "10 Minutes",
    "method": [
      "Take 200 grams of fresh spinach and blanch in hot water, soak spinach in chilled water for 5-7 minutes.",
      "Squeeze and drain all the water from the spinach.",
      "Take one medium sized onion and chop finely.",
      "Add 25 grams of chopped garlic and toss in olive oil on high flame.",
      "Add bechamel sauce & fresh cream to the pan. ",
      "Add nutmeg and salt to taste. Let the mixture cool down and put in blender and grind for desired consistency. ",
      "Return the mix to the pan and add lime-juice and cubed artichoke hearts. Add burnt garlic for garnish. Serve warm.",
      "Take 25 grams of polenta, 20 grams of refined flour and a pinch of salt and half a cup of water and knead until mixed well. ",
      "Roll with a rolling pin until thin. Cut the tortilla sheet into triangular shapes.",
      "3.  Fry and serve with dip.",
      "For the Bechamel Sauce",
      "Melt butter in a saucepan over medium heat.",
      "Add flour, cook, stirring, with a wooden spoon, for 1 to 2 minutes or until mixture bubbles. ",
      "Gradually stir in milk and bring it to boil. ",
      "Reduce heat to medium. Cook, stirring, for 4 to 5 minutes or until mixture thickens."
    ],
    "name": "Spanish Artichoke And Spinach Dip"
  },
  {
    "cook_time": "20 minutes + 20 minutes for marination",
    "description": "This super easy recipe is always a hit with kids - tender chicken smeared with a bunch of spices and fried crisp.",
    "ingredients": [
      "300g chicken breast, cut into strips",
      "1/2 tsp salt",
      "1 tbsp garlic paste ",
      "1 tbsp ginger paste ",
      "1 tbsp green chilli paste ",
      "1 cup oats",
      "3/4 cup refined flour ",
      "1/2 tsp salt",
      "1/2 tsp freshly ground black pepper",
      "1 tbsp dried mixed herbs (italian herb)",
      "1 tsp garlic powder "
    ],
    "prep_time": "20 minutes + 20 minutes marination",
    "method": [
      "Place the chicken breast on a flat surface lined with cling wrap and hammer it with a meat mallet until you get equal thickness.",
      "Cut the chicken breast into 2 inch thick strips (horizontally).",
      "Place chicken strips in a mixing bowl. ",
      "Add salt, ginger, garlic and green chilli paste and mix well, ensuring the marinade gets rubbed into the chicken pieces. Keep aside to marinate for 15-20 minutes.",
      "To make the oat crumb, place oats in a food processor, and process for 20 seconds or until coarsely ground. Add flour, salt, pepper, garlic powder and herbs. Pulse to make a coarse powder and spread out in an even layer in a plate. ",
      "To cook chicken tenders, heat a pan and brush with oil. Take each chicken strip, dredge in oat mixture and place on the hot pan, ensuring it is completely flat. ",
      "Cook until golden brown (3-5 minutes). When cooked on one side, flip over and cook on the other. ",
      "Serve hot and crispy."
    ],
    "name": "Oat Crusted Chicken Tenders"
  }
]